{"X-MEN: GOD LOVES, MAN KILLS TPB (Trade Paperback)": "The Uncanny X-Men. Magneto, Master of Magnetism. The bitterest of enemies for years. Now, they must join forces against a new adversary who threatens them all and the entire world besides - in the name of God. The members of the Stryker Crusade are poised to cleanse the earth, no matter how much blood stains their hands. With Professor X as their enemy and Magneto as their ally, the X-Men undergo an apocalyptic ordeal ordained by a minister gone mad! One of Chris Claremont's most powerful and influential stories, the partial basis for X2 is reprinted in softcover for the first time in years.", "Black Widow (2019) #5": "No Restraints Play isn’t playing anymore. As the field of play shifts underneath Black Widow’s feet, the true enemy is revealed. Lines are crossed. There is no turning back. ", "Domino: Hotshots (2019) #3": "BEHOLD! THE CREATION CONSTELLATION! What does it do? You know, besides incite an international arms race between the most powerful governments in the world…\n", "Black Widow (2019) #4": "LIGHTS! CAMERA! ACTION! The Black Widow has been trapped in someone else’s web! Natasha finds herself captured by the villains behind the online torture show known as No Restraints Play. The bids are coming in. The clock is counting down. Work fast, Widow!\n", "Black Widow (2019) #3": "VILLAINS, VILLAINS EVERYWHERE… The mysterious, self-proclaimed Prince of Madripoor is t hrowing a party, and the guest list is filled with a who’s who of villains! Black Widow is looking to crash that party. HARD. That is, if she can escape the deadly clutches of Madame Masque!", "Marvel Adventures: Super Heroes (2019) #1": "The Avengers assemble with two new team members, one a cocky rookie with cosmic powers, and another the world's most talented secret agent! Welcome to the Avengers, Nova and Black Widow!", "Marvel Adventures: Super Heroes (2019) #2": "Will even the combined powers of the Mighty Avengers be a match for the ghost of a giant that's been terrorizing Britain? It's a new Avengers line-up versus the Old World, with the life of an entire village at stake!", "Marvel Knights by Dixon & Barreto: Defenders of the Streets (Trade Paperback)": "Collects Marvel Knights (2000) #1-15. Daredevil! Black Widow! Dagger! Shang-Chi! And…the Punisher?! What terrible evil could unite these vigilantes on a single mission? Would you believe…Ulik the Troll?! As DD leads them deep underground in search of answers, is Ulik really the priority — or is it taking down Frank Castle? How about helping Dagger’s troubled partner, Cloak? Could it be Zaran the Weapons Master, who’s leaving a trail of bodies in his wake? Or maybe it’s the ancient menace for whom Zaran is working! Whatever the biggest problem faced by this vigilante team, only Moon Knight would be crazy enough to want in! Doctor Strange makes a house call as the group faces a nightmarish enemy, while Widow takes Dagger under her wing. All this plus Nick Fury, Luke Cage and the final face-off between the Punisher and Daredevil!", "Marvel Knights Black Widow by Grayson & Rucka: The Complete Collection (Trade Paperback)": "Collects Black Widow (1999) #1-3, Black Widow (2001) #1-3 and Black Widow: Pale Little Spider #1-3. Natasha Romanoff has always led a life of adventure. A former Soviet spy, she defected to the West and became a super hero and Avenger. Natasha has earned a reputation as a consummate professional, coldly efficient and deadly as her namesake. But now, her time as Black Widow may be running out! Yelena Belova is the first student in the history of the Red Room to exceed Natasha’s skills — and now she’s gunning for the mantle she feels was stolen from her. And she’s determined to put Natasha in the grave! Prepare for a war of the Widows that will rage from the Middle East’s deserts to New York’s Upper West Side. And explore the history of the “pale little spider” in a never-before-collected tale!", "Infinity Wars (2018) #2": "Who is Requiem? Who controls the Infinity Stones? The war has begun to control infininty and the war has come to Earth!", "Infinity Countdown (2018) #5": "THE COUNTDOWN CONCLUDES! The battle for Infinity among the stars comes to its dramatic conclusion, and all the stones are in place to bring the INFINITY WARS to Earth!", "The Punisher (2016) #227": "The Punisher and Black Widow go off the grid on a secret mission of revenge! Frank and Natasha are now Most Wanted by heroes and villains alike! The War Machine armor is busted, and with the forces coming down on our heroes, they’re going to need every bit of firepower they can get.", "Punisher: Shadowmasters (Trade Paperback)": "Collects Shadowmasters #1-4, Punisher War Journal (1988) #1-3 and #8-9 and Punisher (1987) #24-25. In his relentless war on crime, the Punisher doesn't have many allies. But those he can rely on include…the Shadowmasters! They're the latest in a long line of ninjas who have served as the protectors of Japan's Iga Province for centuries. In the wake of World War II, U.S. Army Captain James Richards and Shadowmaster Shigeru Ezaki forge a friendship in battle. Years later, Ezaki has trained the two men's children — Philip, Sojin and Yuriko — in the ways of the ninja. Together, they must face the reborn menace of the Sunrise Society — which brings them into the murky world of the Punisher! Along with the Black Widow, can they fend off armored Sunrise assassins? Or will the eternal evil plague Frank Castle and the Shadowmasters once again?", "Infinity Countdown: Black Widow (2018) #1": "Given the incredibly powerful Space Stone to look after by an old friend, Black Widow has no intention of letting it fall into the wrong hands…but is even the top espionage agent in the world ready to handle cosmic responsibility?", "Tales of Suspense: Hawkeye & The Winter Soldier (Trade Paperback)": "Collects Tales Of Suspense (2017) #100-104. A glorious title from classic Marvel history returns, for a suitably suspenseful tale springing from the pages of SECRET EMPIRE! The Black Widow is dead…but someone out there is killing her old enemies one by one. With a broken heart and a bloody trail to follow, Clint Barton — the Avenger known as Hawkeye — is looking for answers. And the only person alive who may have them is another of Natasha Romanoff’s ex-boyfriends: Bucky Barnes, the Winter Soldier! Can Clint and Bucky trust each other long enough to honor the Black Widow’s legacy and unravel the web of mysteries Natasha left behind? Or as they close in on the new Red Room, will they discover far more than they bargained for?", "Secret Avengers by Ed Brubaker: The Complete Collection (Trade Paperback)": "Steve Rogers has a big secret! The former Captain America has assembled a special-ops squad to counter the world’s deadliest threats. But who are the Secret Avengers? Spy intrigue meets super hero action as the Super-Soldier, Black Widow, War Machine, Ant-Man, Valkyrie, Moon Knight and more take on a case that crosses dimensions and lands on Martian soil — and somehow involves Nick Fury! Then, the Celestial Order of the Hai-Dai launches a brazen attack on Shang-Chi. Its mission? To return him to his father, a man of consummate evil who has perpetuated his brand of wickedness and corruption for more than 3,000 years! Can Steve’s stealth team — and an old friend from his World War II days — save the Master of Kung Fu? Ed Brubaker’s blockbuster run is collected in full! Collecting SECRET AVENGERS (2010) #1-12.", "Marvel Universe Avengers: Ultron Revolution (2017) #23": "THE AVENGERS: IN SPACE! IRON MAN, CAPTAIN AMERICA, BLACK WIDOW and the others join CAPTAIN MARVEL in an all-out fight to stop a powerful scientist from destroying Earth!", "Tales of Suspense (2017) #104": "It ends here, one way or another. BUCKY and HAWKEYE are closing in on the new Red Room. But what happens when they finally find the BLACK WIDOW? Will she stand with them and turn on the people who made her? Or are some bonds too strong to break?The tragic tale of an Archer, an Assassin, a Widow and a woman caught between two worlds concludes here!", "Avengers: Shards of Infinity (2018) #1": "EARTH’S – AND THE MOON’S – MIGHTIEST HEROES!? A new threat has emerged: An evil organization calling itself LUNAR has been secretly building a powerful weapon on the surface of the Earth’s moon. BLACK WIDOW infiltrates the group to uncover an even more startling revelation: Their weapon is powered by shards of the COSMIC CUBE! Legendary creators Ralph Macchio and Andrea Di Vito bring CAPTAIN AMERICA, BLACK PANTHER, THE FALCON and BLACK WIDOW together for a cosmic thrill ride you won’t want to miss – and new villains you won’t want to mess with!", "Marvel Universe Avengers: Ultron Revolution (2017) #17": "AVENGERS VS. INHUMANS! When several townspeople mysteriously transform into primitive beings, the AVENGERS must step in and try to help.", "Marvel's Avengers: Infinity War Prelude (Trade Paperback)": "Collects Marvel’s Avengers: Infinity War Prelude #1-2, Infinity #1 And Thanos Annual #1. When a terrorist puts the Avengers at odds, Captain America and the Winter Soldier go rogue to find him — but Iron Man isn’t far behind. Will the Avengers survive the fallout? Then, find out where Captain America, Falcon and Black Widow are headed next — because the world needs heroes, whether it wants them or not. Get a sneak peek at Tony Stark’s brand-new armor! Get ready for 2018’s biggest blockbuster with this special prelude! Plus, with the Avengers distracted, see Thanos seize his opportunity to strike at Earth in the first chapter of Jonathan Hickman’s epic Infinity! Delve into the Mad Titan’s past as he joins himself on a time-bending journey of discovery — one that sets the stage for his next cosmic odyssey!", "Tales of Suspense (2017) #103": "The whole world was watching when Black Widow died. Hawkeye was there when her body was buried. There’s no chance in the world that Natasha Romanoff survived. Unless...", "Marvel Universe Avengers: Ultron Revolution (2017) #15": "Everyone's favorite synthezoid joins the AVENGERS! Enter…THE IMPENETRABLE VISION!", "AVENGERS: SOLO ACT Presented by DISNEY CHILD LIFE  (2018) #1": "Hawkeye learns that sometimes even super heroes need help from their friends. Especially if your friends happen to be the mighty Avengers.", "Marvel Universe Avengers: Ultron Revolution (2017) #13": "In an epic showdown, it's the AVENGERS versus the THUNDERBOLTS!", "Tales of Suspense (2017) #102": "BUCKY and HAWKEYE find the answers they’ve been looking for, but something feels off. An assassin with no motives, an old ally with no memories and a trail of clues no spy would ever leave can only mean one thing — they’re being played. But if THE BLACK WIDOW isn’t doing it, who is? The exciting epic of teamwork, treason, brainwashing and buried black sites continues here!", "Zombies Assemble Vol. 2 Manga (Digest)": "Collects Zombies Assemble 2 #1-4. The Avengers face a threat even bigger and more menacing than they could have imagined as the stakes are raised in the race to cure the zombie outbreak! Caught in a massive explosion, Captain America, Hawkeye and Iron Man wake up in the midst of a city overrun by zombies. Miraculously, they find they haven’t been turned, though they come face-to-face with Jasper Scott — a mysterious scientist who claims to have a cure for the virus. But who is he really, and does he actually possess the antivirus Bruce Banner has been struggling to create? More important: Is the Hulk immune to the zombie plague? Marvel’s English-language adaptation of the original blockbuster manga series rolls on!", "Tales of Suspense (2017) #101": "RED LEDGER PART 2. HAWKEYE and BUCKY are forced to work together to track down the mystery assassin. The style and choice of targets have all led them to believe THE BLACK WIDOW is somehow alive and on the warpath...until now. When their latest victim surfaces, everything our heroes think they know is about to get blown to pieces! The titillating tale of Avengers, assassins, perilous plots and past mistakes continues here!", "Marvel Universe Avengers Assemble: Civil War (2017) #8": "Can Captain America and Iron Man put aside their differences before Ultron can make his final move? The grand finale to MARVEL UNIVERSE AVENGERS ASSEMBLE: CIVIL WAR is here!", "Marvel Universe Avengers Assemble: Civil War (2017) #7": "United they stand! The divided Avengers will need to reunite to save the world from ultimate destruction!", "Marvel Masterworks: Daredevil Vol. 12 (Hardcover)": "Collects Daredevil (1964) #120-132 and material from FOOM (1973) #13. The Man Without Fear’s life is about to change forever. Bullseye is coming. The countdown begins when Daredevil, Black Widow and Nick Fury unite to battle a renewed Hydra. In the aftermath, Black Widow leaves and a new love interest, Heather Glenn, enters, but Matt Murdock’s growing obsession with his life as Daredevil puts their budding relationship at risk. The drama continues with Death-Stalker, the Torpedo, a destructive day in court for Man-Bull and the opening of Murdock and Nelson’s storefront law practice. Last, but certainly not least: Marv Wolfman, Bob Brown and iconic Daredevil inker/finisher Klaus Janson unleash one of comics’ most iconic adversaries. It’s the first appearance of Bullseye, the madman with perfect aim and no mercy.", "Punisher Epic Collection: Capital Punishment (Trade Paperback)": "Collects Punisher (1987) #63-75, Punisher: G-Force, Punisher: Die Hard in the Big Easy, Punisher/Black Widow: Spinning Doomsday's Web. The Punisher hits Europe! When Frank Castle heads to London in pursuit of the assassin Snakebite, he finds a whole continent of trouble - and also his biggest fan: the British vigilante Outlaw! Their fragile Anglo-American alliance must survive a deadly chase from country to country that will draw in mercenaries from Batroc to the Tarantula! But can the Punisher put a stop to a plot that goes all the way up to the Kingpin himself? And if he returns to America in one piece, Frank will be targeted by the anti-vigilantism task force known as V.I.G.I.L.! Plus: the Punisher in space! The death-dealing Baron Cemetery! And a tense team-up with the Avengers' own Black Widow!", "Marvel Universe Avengers: Ultron Revolution Vol. 3 (Digest)": "Collects Marvel Universe Avengers: Ultron Revolution #9-12. The Avengers take on the Inhumans! When several townspeople mysteriously transform into primitive beings, the Avengers must step in and try to help. However, this puts Earth's Mightiest Heroes at odds with another super-powered group - the truly uncanny Inhumans! Will the Avengers be able to do the right thing in the face of conflict? Or will tensions boil over into an all-out battle?! You know you're hoping for option B!", "Marvel Super Heroes: Larger Than Life (Trade Paperback)": "Your favorite heroes from the movies, in blockbuster comic-book adventures! Captain America, Iron Man, Thor, Hawkeye, Black Widow and the Hulk have assembled as the Avengers, but their teamwork needs, well, work when Hydra strikes! Hank Pym is the original Ant-Man, the little hero with a flair for big trouble! Cap and the Widow must forge a new Avengers squad from fresh recruits Scarlet Witch, Vision, Falcon and War Machine! Stephen Strange struggles to master the mystic arts! The Guardians of the Galaxy are targeted by one of the deadliest bounty hunters in the cosmos: Death’s Head! And Spider-Man must foil the Crime Master’s master plan! Collecting AVENGERS: OPERATION HYDRA #1, ANT-MAN: LARGER THAN LIFE #1, CAPTAIN AMERICA: ROAD TO WAR #1, DOCTOR STRANGE: MYSTIC APPRENTICE #1, GUARDIANS OF THE GALAXY: DREAM ON #1 and SPIDER-MAN: MASTER PLAN #1.", "Marvel Universe Avengers Assemble: Civil War (2017) #4": "Captain America takes a stand against Iron Man! It's time: whose side are you on in this super hero Civil War?", "Marvel Adventures: Super Heroes (2019) #3": "The Avengers cross paths with long-forgotten criminal, Gary Gaunt! And discover his monstrous \"Jekyll and Hyde\" transformations!", "The Mighty Captain Marvel (2017) #126": "DARK ORIGIN Part 2. They say you can’t go home again…but what about a creepy, dark version of your childhood home? CAROL DANVERS finds herself in just such a place and brings new meaning to sneaking out of the house! Plus, as ALPHA FLIGHT endeavors to find Carol, what they do find will change everything!", "Marvel Universe Avengers Assemble: Civil War (2017) #3": "SECRETS THREATEN TO DESTROY THE AVENGERS! Find out the secret Iron Man has kept from the team...and how it will change the Avengers' future!", "Zombies Assemble Vol. 1 Manga (Digest)": "The original manga is adapted into English for the first time! Time and again, the Avengers have assembled to save the Earth from destruction. But they’ve never had to face a threat as gruesome and as UNDEAD as this one! Now, Earth’s Mightiest Heroes must fight to contain an outbreak of horrifying zombies and stop them from spreading across the Earth! But not all of the Avengers will escape uninfected… Printed in black and white in the original right-to-left reading orientation. Collecting ZOMBIES ASSEMBLE #0-3.", "Secret Empire (Hardcover)": "The year’s most startling and unexpected comic-book event! Captain America, Sentinel of Liberty, is living a lie! The Cosmic Cube has remade the world’s greatest hero into a secret true believer in the cause of Hydra, wholly dedicated to its mission of progress through authority and unity through adversity! Now, using the trust and respect he’s been accorded by the great powers of the Marvel Universe, Steve Rogers makes Hydra’s ideals a reality — and changes the landscape of the world dramatically! How will he take some of his biggest threats off the board? Who will remain to stand against him? And which heroes will fight on his side? Find out as the impossible becomes real! Hail Hydra! Collecting SECRET EMPIRE #0-10 and OMEGA, and material from FREE COMIC BOOK DAY (SECRET EMPIRE) #1.", "SECRET EMPIRE: UNITED WE STAND TPB (Trade Paperback)": "The Hydra world order has arrived, but it's not one that everybody agrees with. Not by a long shot! Prepare for the reign, the resistance - and the revolution! Steve Rogers takes matters into his own hands to maintain peace - by any means necessary! Black Widow recruits the young heroes of the Marvel Universe for a deadly plan! And a coalition of heroes seeks an end to the national nightmare - but first they must brave the dangers of the Savage Land! Meanwhile, imprisoned by Hydra, the Uncanny Avengers have a cunning escape plan! And it falls to the Guardians of the Galaxy to fight off the Chitauri invasion - but can they rely on aid from Yondu Udonta?! Collecting SECRET EMPIRE: UNITED #1, UNDERGROUND #1 and UPRISING #1; UNCANNY AVENGERS (2015B) #24-25; CAPTAIN AMERICA (2017) #25; and ALL-NEW GUARDIANS OF THE GALAXY ANNUAL #1.", "Marvel Universe Avengers: Ultron Revolution (2017) #1": "THE BAND IS BACK TOGETHER! As the Avengers unite once more, they'll have to relearn how to work as a team. And they'd better figure it out quickly before Ultron's master plan kicks into high gear!", "Wolverine by Daniel Way: The Complete Collection Vol. 2 (Trade Paperback)": "Continuing the blistering run of Daniel Way - with a blockbuster assist by Jeph Loeb and Simone Bianchi! Wolverine has been completely shattered by recent revelations, and must now ask himself some hard questions. Can he continue on his quest? Should he? He finally remembers who he was, but who - and what - is he now? The answers involve Madripoor, Jubilee, old foes Cyber and Omega Red, and the deadly debut of Daken - the son that Wolverine never knew he had! Learn Wolverine's secret history with Black Widow...and gasp as a savage showdown with Sabretooth draws the manipulative mastermind Romulus out of the shadows! Plus, ask \"what if?\" tragedy turned Logan away from the path of Wolverine - and on to that of an even more punishing vigilante! COLLECTING: WOLVERINE: ORIGINS #6-15, ANNUAL #1; WOLVERINE (2003) #50-55; WHAT IF: WOLVERINE #1.", "Secret Empire (2017) #7": "It was foretold by Ulysses, it's haunted Spider-Man's nightmares for months, and now the moment has arrived: It's time for Miles Morales to kill Captain America! Unless Natasha…", "Captain America and the Avengers: The Complete Collection (Trade Paperback)": "Captain America spends some one-on-one time with his Avengers buddies! Something is eating the locals in the San Andres Mountains - Cap and Hawkeye had better hope that arrows and a shield will be enough to defeat a hive of dino-monstrosities! Then, Cap and Iron Man head to Madripoor for a technology expo - but when Batroc's Brigade shows up, a nightmare is unleashed! Back in World War II, Invaders Cap and Namor face a huge problem when the Thule Society releases the Kraken! And Captain America and Black Widow are chased across countless worlds by Kashmir Vennema and her multiversal corporation! It's all leading to a huge confrontation involving Hawkeye, Iron Man and...Doctor Doom? Collects Captain America and Hawkeye #629-632, Captain America and Iron Man #633-635, Captain America and Black Widow #636-640, Captain America and Namor #635.1.", "Secret Empire: Uprising (2017) #1": "Hydra has made their move and Black Widow enlists the younger heroes of the Marvel Universe – Miles Morales, a.k.a. Spider-Man, Ironheart, Wasp, Amadeus Cho, Falcon, and more, for a dark-ops mission no one – not even the heroes themselves –are prepared for. Can Black Widow forge these champions into a new elite strike force against Hydra's forces? Or will her time run out and send the younger heroes into the fight unprepared for what's to come?", "The Amazing Spider-Man Omnibus Vol. 3 (Hardcover)": "Few comic books have ever come close to reaching the page-turning power, action, and drama of AMAZING SPIDER-MAN. Guided by Stan Lee, John Romita Sr. and Gil Kane, Spidey grew to become not just the most relatable hero in comics, but also the industry's top seller! And you'll see the reasons why again and again in this truly amazing third Omnibus collection. One iconic story follows another: the Stone Tablet Saga, the debut of Black Widow's new look, Kingpin's Shakespearean family drama, Captain Stacy's tragic death, the pathos of Peter Parker's love triangle with Gwen Stacy and Spidey, the historic Comics Code-defying \"drug\" issues, and Morbius the Living Vampire's debut! Collecting AMAZING SPIDER-MAN (1963) #68-104.", "Black Widow Vol. 2: No More Secrets (Trade Paperback)": "Now that Natasha knows the Weeping Lion's secret, she's in control of his very particular skills. Natasha plans to use him to destroy the Red Room's reincarnation, the DARK ROOM. But she'll have to face RECLUSE, daughter of the Red Room's headmistress, who's fixated on killing Natasha to prove her worth. Collects Black Widow (2016) #7-12.", "Marvel Masterworks: Daredevil Vol. 11 (Hardcover)": "Daredevil teams up with not just one, but two stunning women of Marvel when the Black Widow and Shanna the She-Devil join the battle against the Black Spectre. Together, they must uncover the secret leaders of an organization bent on bringing the United States to its knees. It's a massive saga that will pull in heroes from across the Marvel Universe including Moondragon and the ever-lovin' blue-eyed Thing, culminating in a battle on the White House lawn! Classic villains like the Gladiator and the Owl abound, and new enemies emerge when Death-Stalker hatches a plan that brings the Man-Thing into the fray. Add in a return to Fogwell's Gym, where it all began, and what we have in store and true Marvel Masterworks! COLLECTING: DAREDEVIL (1964) #108-119, MARVEL TWO-IN-ONE (1974) #3.", "Black Widow (2016) #11": "INFESTATION! While Widow’s been collecting information, her enemy has been collecting allies. Natasha faces a full-scale invasion! What’s the target? And can Widow shield it on her own?", "Black Widow (2016) #10": "THE INNOCENTS Widow and Bucky barely escaped with their lives! There’s a Recluse on the loose, children playing with Lions, and a man on the moon. Is Widow weaving a masterful web, or are her threads starting to unravel?", "Black Widow (2016) #9": "THE RETURN OF BUCKY BARNES! Natasha’s living in a world without secrets, and Bucky’s got a pretty big one…You can’t go home again…particularly when there’s a deadly killer targeting you!", "Black Widow (2016) #8": "DARK ROOM FIELD TRIP! Students of the DARK ROOM — the successor of the Red Room — are making their way into the world. One young assassin has her sights set on a VERY high profile target. There’s no shortage of men prepared to stop her, and BLACK WIDOW will have to fight them all to save her.", "Captain America: Steve Rogers (2016) #7": "“HAIL HYDRA” STARTS NOW! The Red Skull marches across Europe, and S.H.I.E.L.D. comes apart at the seams! Steve opens a door – and the secret behind it will shake the Marvel Universe to its core…", "Black Widow (2016) #7": "“LION TAMER” STARTS NOW!\nNow that Natasha knows the Weeping Lion’s secret, she’s in control of his very particular set of skills. Natasha plans to use him to destroy the Red Room’s reincarnation, the DARK ROOM. But she’ll have to face RECLUSE, the daughter of the Red Room’s headmistress, who’s fixated on killing Natasha to prove her worth.", "Black Widow (2016) #6": "DRAWING BACK THE IRON CURTAIN!\nThe WEEPING LION has released the BLACK WIDOW’s most dangerous secret into the world. Now Natasha is on a collision course with the INVINCIBLE IRON MAN! Even if they survive CIVIL WAR II, the AVENGERS will never be the same!", "Black Widow (2016) #5": "THE WEEPING LION’S HUNTING GROUND Using her darkest secret as leverage, the Weeping Lion has pushed Natasha further from the straight and narrow. And Agent Elder of S.H.I.E.L.D. is closing in — is he fellow prey that needs Black Widow’s protection, or another predator?", "Black Widow (2016) #4": "Nearly dead after her last mission, Natasha struggles to complete her latest assignment from the Weeping Lion. But she’ll get by with a little help from old friends…although old enemies lie in wait. She must recover the missing files from the Red Room by infiltrating its newest incarnation…the Dark Room.", "Avengers VS (2016) #1": "It's the Avengers versus some of their all-time greatest foes! Powerful Asgardian artifacts are on Earth...but can the Avengers recover them before Loki?", "Black Widow (2016) #1": "S.H.I.E.L.D.’S MOST WANTED!\nThe Eisner Award-winning team of Mark Waid and Chris Samnee are taking Black Widow on the lam! Natasha has spent years gathering secrets, and when some of the darkest ones begin mysteriously going public, no one is safe. With her betrayed former confederates at S.H.I.E.L.D. on her heels and a lifetime of training and ingenuity at her disposal, Natasha’s out for answers in a knock-down-drag-out tale of action and espionage! Hidden enemies, old friends and unusual allies collide, and all eyes are on Black Widow. The chase is on!", "New Avengers (2013) #28": "IN 5 MONTHS...TIME RUNS OUT!", "New Avengers (2013) #26": "IN 6 MONTHS...TIME RUNS OUT!", "Avengers World (2014) #14": "- The UPRISING is over; now the NEW ORDER begins!\n- Avengers World has become A.I.M. World.\n- The Avengers can't stop the combined might of A.I.M., The Gorgon and Morgan Le Fey.\n- But what about the NEXT Avengers?", "Black Widow (2014) #9": "\"FRIEND FROM FOE.\" In the pursuit of XAOC, Black Widow finds THE PUNISHER! And they are trapped on an abandoned oil tanker rigged to explode with CROSSBONES and his SKULL SQUAD! Don't miss the other side of this action-packed crossover event in THE PUNISHER #9!", "Original Sin (2014) #6": "EVERYBODY HAS ONE...", "Original Sin (2014) #4": "TRUST NO ONE. NOT EVEN YOURSELF.\n- One hero goes rogue. Another loses his head.\n- Dr. Strange and the Punisher team up for a daring raid.\n- And all trails now lead to one suspect.\n- But he... how is that even possible?", "Black Widow (2014) #7": "The Finale, Part 1:\n- David. Clint. Barney. The Building. The Tracksuit Draculas. The Clown.\n- Ever seen \"Rio Bravo?\" Check it out, it's pretty good.", "Original Sin (2014) #3": "ANSWERS AT ALL COSTS.\n- In the wake of last issue's explosion of secrets, the heroes of the Marvel U are reeling, leaving Nick Fury to stand alone.\n- He Who Holds the Eye is still on the run, and now we meet his boss, the villainous mastermind behind the raid on the Watcher's lair.\n- And in deep space, the Winter Soldier leads a team that uncovers the most bizarre murder of all.", "Original Sin (2014) #2": "WHO HOLDS THE EYE? WHO KNOWS ITS SECRETS?\nThe cosmic manhunt for the Watcher's killer continues. More bodies are discovered. The killer's trail leads to the far corners of the universe and beyond. And just when Nick Fury and the Avengers think they've cornered their murderer...EVERYTHING EXPLODES, unleashing the Marvel Universe's greatest secrets.", "Black Widow (2014) #6": "- The entity behind the attacks sits alone and mysterious on the dark water-can Natasha infiltrate the floating lair?\n- Black Widow's strength and cunning will be put to the test as she follows the trail of blood and destruction to the beginning...\n- This is a mission too dangerous even for S.H.I.E.L.D.\n- Read the thrilling conclusion of the first arc of the book that critics are calling \"an example of just how good a comic book can be.\" (-Bag&Bored)", "Original Sin (2014) #1": "WHO SHOT THE WATCHER?\nThe Watcher, the mysterious space-god who's been watching us from the moon for as long as we can remember... is dead. Thus begins the greatest murder mystery in Marvel Comics history.\nAs Nick Fury leads the heroes of the Marvel Universe in an investigation, other forces are marshaling as well and other questions are arising. Why is Black Panther gathering a secret team of his own, including Emma Frost, the Punisher and Dr. Strange? Who is the Unseen? What was the Original Sin? What was stolen from the Watcher's lair? And most importantly, who now holds the Marvel Universe's darkest secrets in the palm of their hand?", "Black Widow (2014) #5": "NATHAN EDMONDSON (W) - Phil NOTO (A/C)\n- Paris, London, Montenegro. Natasha is in a race against time, under the shadow of the hammer...\n- A dark plot threatens Europe, and even SHIELD doesn't know who's behind it...\n- With nowhere to turn for answers, Natasha has no choice but to ask THE RAVEN for help...", "Black Widow (2014) #4": "<ul><li>From the cold streets of old Russia, the Hand of God reaches out to crush Black Widow&mdash;and it is merciless.</li><li>Outmatched by the brute force of a powerful new villain, Natasha finds a deadly plot unfolding that spans the entire globe</li><li>Jump on to the sensational new series as the most lethal The Avenger faces her deadliest test!</li></ul>", "Black Widow (2014) #3": "The Finely Woven Thread - PART 3: &quot;FOLIAGE&quot;\r\n\r\n\r\n\r\n\r\n<ul><li>She&#39;s the kind of woman you call when you need to escape from a South American prison.</li><li>Don&#39;t miss the book everyone is talking about (and it isn&#39;t even out yet!)</li></ul>", "Black Widow (2014) #2": "In fact, it&#39;s so good, that you won&#39;t want to wait another month for the next issue. And you won&#39;t have to!", "Black Widow (2014) #1": "You&#39;ve seen Black Widow as an Avenger and even an Agent of Shield. But on her own time she searches for atonement for her past as a KGB assassin&mdash;in ways of which those teams just wouldn&#39;t approve. From the darkest corners of the Marvel Universe, Nathan Edmonson (Who is Jake Ellis?) and Phil Noto (Thunderbolts, X-23) bring you a new ongoing series as gorgeous and mysterious as Nastasha Romanov herself!", "Avengers Assemble (2012) #22": "INHUMANITY TIE-IN\n\n\n\n\n<ul><li>Spider-Woman and the Hulk -- Team Sad! -- are Back in Black&hellip; and red. And yellow. And purple and green. A lot of green.</li><li>Speaking of green&hellip; Spider-Girl follows in the footsteps of her investigative reporter Dad and follows the money.</li><li>The Toxic Doxie has her very own Inhuman&hellip; All that a homicidal maniac could ask for.</li></ul>", "Avengers Assemble (2012) #21": "- Remember all that crazy science from earlier issues?? Here's where it gets positively INHUMAN!\n- When Spider-Girl is in trouble...who does she go to?\n- Black Widow, Spider-Girl and Spider-Woman.\n- Spider-Woman as a mentor...Who thought this was a good idea?", "Avengers: Endless Wartime (2013)": "The first in a series of all-new original graphic novels! An abomination, long thought buried, has resurfaced in a war-torn land. But now it wears an American flag. Faced with another nightmare reborn, Captain America will not stand for yet more death at the hands of a ghost from his past. Haunted by his greatest shame, Thor must renew the hunt for a familiar beast. At their side, an assemblage of allies united to end the threats no one of them could face alone. They are soldiers. Warriors. Comrades-in-arms. Mighty heroes led by a living legend, stronger together than apart. They are the Avengers.", "Avengers Assemble (2012) #19": "INFINITY TIE-IN!\n- Part 2 of 2! Spider-Woman and Black Widow to the rescue!\n- Watch out alien marauders...these ladies pack a sting!", "Avengers Assemble (2012) #18": "INFINITY TIE-IN!\n- Part 1 of 2! A Spider-Woman's eye-view as the Avengers engage the seemingly unstoppable Builder fleet!\n- You know, the last time Spider-Woman was involved in a big alien invasion thingie, it didn't go so well for her.\n- I wonder, is Jessica Drew the kind of woman who holds a grudge?", "Avengers Assemble (2012) #17": "Part 4 of 5 of THE ENEMY WITHIN\n\n\n<ul><li>With the world quite literally ripping apart at the seams, and the Avengers scatteredةhow much longer can Captain Marvel fend off the madness of the Magnitronة?</li></ul>", "A+X (2012) #10": "<ul><li>BLACK WIDOW and FANTOMEX find themselves on opposite sides of the law in Russia!</li><li>SCARLET WITCH and DOMINO try their luck together!</li></ul>", "Fearless Defenders (2013) #6": "<ul><li>Still guest staring most of the heroines in the Marvel Universe.</li><li>Someone dies... Stock up on tissues.</li><li>I know. You're still upset about issue 6. But stick with us for a status quo change so big we can't actually show you anything!</li><li>Do not judge anyone's safety by this cover.</li></ul>", "Secret Avengers (2013) #5": "&ldquo;Barbuda&rdquo;\r\n\r\n\r\n\r\n<ul><li>Showdown on AIM Island: The Secret Avengers vs. The New High Council of AIM!</li><li>S.H.I.E.L.D. will never be the same!</li></ul>", "Avengers Assemble (2012) #16": "THE ENEMY WITHIN: PART 2 OF 5<br />- Who wants YOU for dinner? The Brood!<br />- Spider Woman &amp; Captain Marvel declare war on the Magnetron! (Who?)<br />- Hawkeye has a bright idea!", "Deadpool (2012) #11": "<ul><li>Concluding the 2nd arc of MARVEL NOW! Deadpool!</li><li>Can Wade trust hell to keep their side of his contract?</li><li>Will all of Deadpool&rsquo;s new friends end up dead because of him?</li><li>Are turkey sandwiches better than ham?</li><li>2 of these 3 questions will be answered!</li></ul>", "Avengers Assemble (2012) #14": "AGE OF ULTRON TIE-IN\r\n\r\n&hellip;and the end of the world as we know it.\r\n\r\n<ul><li>Black Widow heads back to her old stomping ground of San Francisco for coffee, old friends&hellip;</li><li>The Age of Ultron is here -- and nobody&rsquo;s getting out in one piece&hellip;</li></ul>", "Avengers Assemble (2012) #13": "<ul><li>Time to pay the piper&hellip; or the psychopathic lizard girl. Black Widow and Hawkeye stand in judgment for the sins of their pasts.</li><li>Spider-Woman caught in the middle.</li><li>Natasha don&rsquo;t drink that, it&rsquo;s--! &hellip;Uh-oh.</li></ul>", "Age of Ultron (2013) #2": "For years the heroes of the Marvel Universe have lived in fear that the artificial intelligence known as Ultron would one day evolve to fulfill its desire to wipe out all organic life and take over the Earth -- that day has arrived. This massive 10-part Marvel Universe-spanning event is brought to you by Eisner award-winning writer Brian Michael Bendis and comics legend Bryan Hitch.", "Secret Avengers (2013) #1": "&ldquo;The Most Dangerous Secrets We Have... Are The Ones We Keep From Ourselves.&rdquo; The new Nick Fury leads a covert Avengers strike team including but not limited to Hawkeye, Black Widow, The Hulk, The Winter Soldier, Maria Hill and Phil Coulson on missions so dangerous, even the team members themselves can&rsquo;t know about them!", "Avengers Assemble (2012) #12": "<ul><li>The sins of Black Widow&rsquo;s past have resurfaced and threaten the safety of not only the Avengers, but also the entire world!!</li><li>Widow, Spider-Woman and Hawkeye must travel to Siberia to search for a missing girl with ties to an old Soviet assassination.</li><li>But the truth behind this girl&rsquo;s disappearance may be more than the Avengers are prepared to handle!</li><li>Acclaimed writer Kelly Sue DeConnick teams with Pete Woods for an all new Avengers Assemble epic!</li></ul>", "Secret Avengers (2010) #37": "<ul><li>The conclusion to the Rise of the Descendants! All secrets revealed!</li><li>Father and the Descendants begin Contagious Robotic Evolution, merging the Descendants with all of humanity!</li><li>What is the secret behind the power of Parvez?</li><li>The ultimate test of Hawkeye!</li></ul>", "New Avengers (2013) #2": "The Illuminati gather to plan for the death of everything. Infinity gems, old wounds, lies, agendas and universal incursions are all on the agenda!", "Secret Avengers (2010) #36": "<ul><li>In The Core Venom and Valkyrie set out on a mission to kill Father.</li><li>In New York The Master Mold rises and the only way to stop him is to kill The Torch!</li><li>Black-Ant vs Hawkeye the final showdown!</li></ul>", "New Avengers (2013) #1": "To prevent the collision of our universe with another, the Illuminati, led by the Black Panther, must assemble NOW! It's the most powerful and brilliant team in the Marvel Universe--The Black Panther, Iron Man, Doctor Strange, Black Bolt, Mister Fantastic, Namor the Sub-Mariner and The Beast--against an infinite legion of parallel realities.", "Secret Avengers (2010) #35": "- Contagious Robotic Evolution is go and the remaining Secret Avengers are the only ones left! But how do you stop a plague that has already begun to spread?\n- Torch, Venom and Valkyrie infiltrate the rebel robot base In The Core, but are Lord UltraVision and Monarch Machine Man friend or foe?\n- Torch must choose between mankind and the perfect future Father will create for all automatons", "Captain America and Bucky (2011) #640": "- FINALE ISSUE! GET READY TO HAVE YOUR FACES PUNCHED CLEAN OFF!\n- Captain America and Black Widow lead the multiverse's finest in a final assault on Venemma Multiversal!\n- Black Widow vs. Black Widow...to the death!\n- Forget 11...on a scale of 1 to AWESOME this eye-popping, senses-snapping, jaw-dropping final issue goes to 12!", "A+X (2012) #2": "Spider-Man and Beast fight zombies, while Iron Man, Kitty Pryde, and Lockheed battle the Brood!", "Captain America and Bucky (2011) #639": "Cap and Black Widow face Lizard-Ock!\n\n\n<ul><li>Chased by a super-powered kill squad, Cap and Widow jaunt through the multiverse!</li><li>The stage is set for a final assault against Venemma Multiversal!</li></ul>", "Ultimate Comics Ultimates (2011) #18": "UNITED WE STAND CONCLUSION  It's the Ultimates' final stand against Hydra on American soil! Thor must make a startling choice: America or Asgard? And Captain America must endure one last temptation with the country hanging in the balance!", "Captain America and Bucky (2011) #638": "<ul><li>Venemma Multiversal has sent Cap and Black Widow on a wild goose chase through countless worlds.</li><li>Cap and Widow battle corporate-sponsored alien war machines!</li><li>And that&rsquo;s not even the strangest thing that happens this issue&hellip;!!</li></ul>", "Secret Avengers (2010) #33": "THE RISE OF THE DESCENDANTS part 1\n- THE RISE OF THE DESCENDANTS BEGINS HERE! The event that will devastate the lives of the Secret Avengers!\n- Descendants siege on Avengers Lighthouse station!\n- Father launches his invasion. Can the Marvel Universe survive the plague of contagious robotic evolution?\n- A terrible new Avenger's foe is born: Beware the bite of The Black Ant!", "Secret Avengers (2010) #32": "- The Abyss spreads. The new Masters of Evil being their invasion.\n- A traitor amidst the Avengers revealed. A friendship forever shattered. An Avenger quits.\n- A shocking death that will destroy the team.", "Avengers Vs. X-Men (2012) #12": "Extra-sized final issue! \n* It's all come down to this! The final battle-as the world burns!", "Captain America and Bucky (2011) #637": "Captain America and the Black Widow are on a deadly collision course! Crosshairs are trained on Cap! Kashmir Venemma dies! At least twice! Guest-starring Hawkeye, Iron Man, and...Dr. Doom?", "Ultimate Comics Ultimates (2011) #16": "CLASSIFIED!", "Secret Avengers (2010) #31": "The Masters of Evil are gathered -- an army of villains unlike any ever collected before. The Secret Avengers are defeated with no hope of backup. The Shadow Council's true goal and Max Fury's ultimate scheme are revealed. Enter the power of The Abyss!", "Ultimate Comics Ultimates (2011) #15": "CLASSIFIED!", "Avengers Assemble (2012) #7": "* Thanos Rules!", "Captain America and Bucky (2011) #636": "* Captain America and the Black Widow are on a deadly collision course!\n* Crosshairs are trained on Cap!\n* Kashmir Venemma dies! At least twice!\n* Guest-starring Hawkeye, Iron Man, and Dr. Doom", "Ultimate Comics Ultimates (2011) #14": "- Someone is working behind the scenes to divide the country, but who?!\n- Ultimate Cap, Ultimate Iron Man, and Ultimate Thor finally reunited! ULTIMATES ASSEMBLE!\n- A crisis in the United States forces the Ultimates into action!\n- DIVIDED WE FALL continues to rock the Ultimate Universe!", "Avengers Assemble (2012) #6": "- Thanos is claiming Earth as his own!\n- The Avengers and the Guardians of the Galaxy team up to bring the\nMad Titan some cosmically-charged pain!", "Secret Avengers (2010) #29": "<ul><li> To prevent a death the Secret Avengers must risk starting a war!\n</li><li> A secret romance heats up!\n</li><li> A rivalry between two members threatens to jeopardize the mission!\n</li><li> Will Hawkeye discover he has a spy on his team in time to prevent tragedy?</li></ul>", "Avengers Assemble (2012) #5": "<ul><li> The secret behind Avengers Assemble is revealed but what does it mean for the future of the Marvel Universe?</li><li> PLUS: The return of the characters you demanded!</li></ul>", "Avengers Assemble (2012) #4": "The secret of the Zodiac is finally revealed! Thanos makes his grand return! What impact will this revelation have on the Avengers, and what cosmic threats does the Mad Titan have in store for Earth's Mightiest Heroes?", "Amazing Spider-Man (1999) #687": "ENDS OF THE PART SIX. Doctor Octopus has a new Sinister Six: the Avengers! Can Spider-Man sacrifice one life to save the entire planet?", "Hulk Smash Avengers (2011) #5": "Hulk's \"smashing\" series comes to an end! With Red Hulk squaring off against some of the Avenger's biggest names, the team must rally together in order to end Red Hulk's destructive path.", "Amazing Spider-Man (1999) #686": "In this perilously penultimate issue of Ends of the Earth, Spider-Man faces down with the diabolical Doctor Octopus! We promised the End of the Earth and this is it!", "Avengers Assemble (2012) #3": "The Avengers square off against the Zodiac for the good of the city. Will the team defeat their new-found enemies or will they crumble beneath their star-studded powers?", "Amazing Spider-Man (1999) #685": "PART 4 ENDS OF THE EARTH Doctor Octopus appears to join in on the fight! With help from Black Widow and Silver Sable, their enemies are in for a battle that they will not soon forget!", "New Avengers (2010) #25": "AVX TIE-IN With the battle between man and mutant about to unfold, Iron Fist discovers a shocking connection to the cosmic Phoenix Force!", "Amazing Spider-Man (1999) #684": "- Spider-Man's Globetrotting Adventure Against The Sinister Six Moves To The Middle East For A Face Off Against...The Sandman!\n- In The Past, Spidey's Fought Sandman On Beaches, In Quarries, But Never Like This -\nHow Can Web-Head Hope To Defeat Sandman When He's Controlling The Sahara Desert?! \n- Special Guest Stars: Black Widow And Silver Sable.", "Avengers Assemble (2012) #2": "The Avengers continue to square off against their astrological powered enemies, The Zodiac. How did these villains gain their abilities, and will the Avengers be enough to defeat this new threat?", "Secret Avengers (2010) #25": "Its man vs. machine!  Can the Secret Avengers stop a group of maniacal mechanical monstrosities from carrying out a contagious robotic evolution? To make matters worse, the team faces a betrayal from within their own ranks!", "New Avengers (2010) #24": "AVX Tie-In!  The New Avengers have received the call to duty by Captain America to go to war against the X-Men.  Both an Avenger and an X-Man, Wolverine will be forced to choose a side.", "Avengers Assemble (2012) #1": "- The Avengers Versus The *Brand-New* Zodiac!\n- One Of The Greatest Avengers Villains Of All Time Gets Reinvented For The \nModern Age Just In Time For The Blockbuster Movie Event Of The Summer!\n- A Perfect Jumping-On Point Featuring The Cast Of The Summer Blockbuster\nBut In Marvel Universe Continuity!", "Winter Soldier (2012) #2": "&bull; Bucky and Black Widow on the hunt for men trained by the Winter Soldier himself!\r\n<br />&bull; Who is trying to kill Dr. Doom?\r\n<br />&bull; Also featuring - talking gorillas! Yeah, you heard me.", "Secret Avengers (2010) #21": "Captain America and Hawkeye undertake a mission to the Red Light Nation, a country run by criminals, for criminals!", "Secret Avengers (2010) #20": "The Secret Avengers are all dead...save for the Black Widow. The world's greatest secret agent finds herself one year in the past, on the most secret mission of all: saving her team and the world without letting anyone see her -- especially her team.", "Secret Avengers (2010) #19": "In the city of Aniana, a drug lord plans to sell something to the Shadow Council. The Secret Avengers must get there before the handover, and take whatever the goods are. This mission uncovers an unexpected, ancient, and terrible threat to the world!", "Captain America and Bucky (2011) #624": "The final chapter in Cap and Bucky's first arc is here, completing the retelling of Bucky's early days with a heartbreaking tale of the Winter Soldier and Black Widow in the 1950s, and our secret narrator is finally revealed - as are the things that tie this series to current continuity.", "Fear Itself: The Fearless (2011) #3": "Sin, Crossbones, and Valkeryie race across the globe in search of the missing hammers! The Secret Avengers guest-star in a battle against Raizo and an army of zombies!", "Point One (2011) #1 (Bradshaw Variant)": "Here are SEVEN all -new stories that set the stage for everything coming your way in 2012 from the biggest names in the comics industry.You CANNOT miss this. Catch a tease of the biggest change to the Marvel Universe in over 35 years !", "Fear Itself (2010) #7": "Tony Stark returns from the depths with a last-chance arsenal that will transform the Avengers from Earth's Mightiest Heroes...into Earth's Last Hope!", "Hulk (2008) #43": "HULK OF ARABIA Part Two! Teaming up with Machine Man, Red Hulk sets out on a covert mission that may be the most dangerous of his life!", "Hulk (2008) #42": "HULK OF ARABIA Part One! A ghost from General Ross's past has resurfaced, embroiled in a dangerous war in the Middle East. Red Hulk goes off the grid on an unsanctioned mission that puts him at direct odds with the Secret Avengers and Steve Rogers.", "Gambit: From the Marvel Vault (2011) #1": "From those halcyon days gone by when the Champions were L.A.'s premier super-team comes this amazing assemblage featuring: Ghost Rider, The Black Widow, Angel, Remy LeBeau and the demi-god Hercules! It's The Champios vs. M.O.D.O.K.!", "Secret Avengers (2010) #16": "A city buried a mile beneath American soil, only discovered through leakage of von Doom radiation -- emitted only by time-travel devices. A mission underground to this strange metropolis-- because a time machine is the worst kind of WMD imaginable!", "Marvel Adventures Super Heroes (2010) #17": "TWO HUGE STORIES!  RAMPAGING ROBOTS RUN RAMPANT as Iron Man's armor has been taken over by the Mad Thinker, forcing Hawkeye to team up with Tony Stark in order to bring down the most sophisticated and deadly weapon in the world!  Meanwhile, the tough and deadly Avenger Black Widow in action protecting a secretive mystery man from the world's greatest assassins!", "Black Widow: Kiss or Kill TPB (Trade Paperback)": "A senator is seduced and assassinated, and his journalist son follows the trail to a fatally sexy Soviet agent. This deadly \"woman in black\" moonlights as a high-class escort to lure powerful men into her web of blackmail and death. But Nick Crane believes he's finally found his father's murderer, and he's about to expose...the Black Widow! Plus: Tony Stark gets his spy on, and the Black Widow proves she's an Iron Man's best friend, when the Armored Avenger goes undercover to take down a foe using his own decommissioned tech! Collecting BLACK WIDOW (2010) #6-8 and material from IRON MAN: KISS AND KILL.", "Secret Avengers (2010) #15": "FEAR ITSELF TIE-IN THE NEW AVENGERS and AVENGERS must join forces in the face of true fear! Who will join the New Avengers for the first time ever? The battle for humanity continues!", "Marvel Masterworks: The Avengers Vol. 11 HC (DM Variant) (Hardcover)": "Avengers Assemble! Back in another beautifully restored MARVEL MASTERWORKS edition, Cap, Iron Man, Thor and the gang present another set of trendsetting adventures! Starting off with an intriguing Harlan Ellison adaptation, there's no time wasted upping the ante when the mutant-hunting Sentinels return from the heart of the sun. Then, the order changeth! After six years as writer of Earth's Mightiest Heroes, Roy Thomas passes the torch to the new scribe who would take the super-team to even loftier heights. Enter: Steve Englehart! Without skipping a beat, he descends into the time-lost Savage Land and brings back the Black Panther - all the while devising the machinations of the Grim Reaper and the Space Phantom that cruelly twist the Vision to their will. The tension peaks when Hawkeye quits, and the mutant menace Magneto takes out not just the Avengers, but the X-Men, too. Toss in Daredevil and the Black Widow, and what we've got here is an epic in the Marvel manner. So reserve that copy today, True Believer! Collecting THE AVENGERS #101-111 and DAREDEVIL #99.", "Marvel Masterworks: The Avengers Vol. 11 HC (Hardcover)": "Avengers Assemble! Back in another beautifully restored MARVEL MASTERWORKS edition, Cap, Iron Man, Thor and the gang present another set of trendsetting adventures! Starting off with an intriguing Harlan Ellison adaptation, there's no time wasted upping the ante when the mutant-hunting Sentinels return from the heart of the sun. Then, the order changeth! After six years as writer of Earth's Mightiest Heroes, Roy Thomas passes the torch to the new scribe who would take the super-team to even loftier heights. Enter: Steve Englehart! Without skipping a beat, he descends into the time-lost Savage Land and brings back the Black Panther - all the while devising the machinations of the Grim Reaper and the Space Phantom that cruelly twist the Vision to their will. The tension peaks when Hawkeye quits, and the mutant menace Magneto takes out not just the Avengers, but the X-Men, too. Toss in Daredevil and the Black Widow, and what we've got here is an epic in the Marvel manner. So reserve that copy today, True Believer! Collecting THE AVENGERS #101-111 and DAREDEVIL #99.", "Fear Itself (2010) #4": "The blockbuster Marvel event of the year continues! AFTERMATH: the heroes reel in the wake of last issue's shocking finale. Thor finds himself unwelcome in two homes. Steve Rogers makes the decision of a lifetime. And Iron Man prepares to make the ultimate sacrifice. Every move the heroes make just serves to make The Serpent stronger-- and the feat he accomplishes in this issue will rock the Avengers.", "Fear Itself: Black Widow (2011) #1": "FEAR ITSELF TIE-IN! Russia's deadliest assassin! France's most iconic city! As fear ravages the streets of Paris, a group of diabolical extremists plot an act of mass terrorism. In order to avert nuclear disaster, The Black Widow must brave a city in chaos, face down a crack team of deadly mercenaries, and infiltrate a well-protected government facility. She's on her own... which is just the way she likes it.", "Captain America (2004) #619": "From his cold Russian prison cell, Bucky must decide what to do next. Meanwhile, the repercussions of Bucky's actions may destroy everything Steve has worked so hard for. ", "Black Widow: The Name of the Rose (Trade Paperback)": "The Black Widow's house of cards is crashing down around her! As one of the world's greatest spies, the Black Window lives in lies and half -truths. Her long career in espionage has spun a web of deceit decades long. Her fellow Avengers and her lover, Captain America, can never know all the blood she has on her hands - even if they wanted to. Although her heroics have redeemed her, she can never escape her past or all the lives she's led. What is the one secret she buries the deepest? Is she hiding something that would destroy everything she's worked for? More important, what will she do to keep it hidden? Collecting BLACK WIDOW #1-5 and material from ENTER THE HEROIC AGE #1.", "Fear Itself (2010) #3 (Camuncoli Variant)": "The blockbuster Marvel event of the year continues! Sin leads the most audacious attack on American soil the world has ever seen as global panic sets in and we fall sway to the power of fear itself. On Asgard, Loki hatches the scheme to end all schemes. And everywhere, the Serpent's presence is felt...never moreso than when a major Marvel hero falls at his hands. The shock ending to end all shock endings...as the cycle of evil stretching millennia is at last completed. ", "Fear Itself (2010) #3 (Immonen Variant)": "The blockbuster Marvel event of the year continues! Sin leads the most audacious attack on American soil the world has ever seen as global panic sets in and we fall sway to the power of fear itself. On Asgard, Loki hatches the scheme to end all schemes. And everywhere, the Serpent's presence is felt...never moreso than when a major Marvel hero falls at his hands. The shock ending to end all shock endings...as the cycle of evil stretching millennia is at last completed. ", "Fear Itself (2010) #3": "The blockbuster Marvel event of the year continues! Sin leads the most audacious attack on American soil the world has ever seen as global panic sets in and we fall sway to the power of fear itself. On Asgard, Loki hatches the scheme to end all schemes. And everywhere, the Serpent's presence is felt...never moreso than when a major Marvel hero falls at his hands. The shock ending to end all shock endings...as the cycle of evil stretching millennia is at last completed. ", "Onslaught Unleashed (2010) #4": "The SECRET AVENGERS and YOUNG ALLIES prepare to fight for all humanity as ONSLAUGHT's epic plan reaches its climax! To have any hope of defeating him, NOMAD may have to make the ultimate sacrifice. But will STEVE ROGERS and BLACK WIDOW allow her to? And what surprising role will one of the Young Allies take on in order to see things through? We're not telling you! Read this sucker!", "Captain America (2004) #618": "Steve Rogers races against time to uncover the international conspiracy that trapped his ex-partner in a web of intrigue and lies. Meanwhile, Bucky Barnes fights for his life in a Russian Gulag. ", "Hawkeye: Blindspot (2011) #4": "Hawkeye, blinded and facing his most deadly foe yet, must make a decision that will change the course of his life! The defining chapter of the Avenging Marksman is here!", "Origins of Marvel Comics (Trade Paperback)": "An all-star lineup of creators brings you the origins of Marvel's greatest heroes! Short, accessible origin stories you'll want to cut out and tape up on your wall! From the Avengers to the X-Men! From Iron Man, Thor, the Fantastic Four and Spider-Man to Hulk, Deadpool, Black Widow and the Punisher! Cyclops! Wolverine! Magneto! They're all here! Plus: In the aftermath of SIEGE, Steve Rogers assesses the state of Earth's heroes, villains and mutants in almost 200 pages of character files! Collecting ORIGINS OF MARVEL COMICS, ORIGINS OF MARVEL COMICS: X-MEN, HEROIC AGE: SUPER HEROES, HEROIC AGE: VILLAINS and HEROIC AGE: X-MEN.", "Captain America: Allies & Enemies (Trade Paperback)": "From the dark days of World War II to the current Heroic Age come five stories of humanity, heroism, death and despair! Featuring Captain America's greatest allies and most terrible foes including Falcon, Peggy Carter, Crossbones, Batroc the Leaper, Black Widow and Agent 13. Fierce fisticuffs, death-defying?duels and good, old-fashioned espionage ensue! Collecting CAPTAIN AMERICA AND FALCON #1, CAPTAIN AMERICA?AND THE FIRST THIRTEEN #1, CAPTAIN AMERICA AND CROSSBONES #1, CAPTAIN AMERICA AND BATROC #1 and CAPTAIN AMERICA AND THE SECRET AVENGERS #1", "Captain America (2004) #617": "Bucky's life takes a turn no one ever expected, but that's all top secret. Meanwhile, Steve Rogers faces a world without a Captain America.", "Thunderbolts Classic Vol. 1 (Trade Paperback)": "Justice, like lightning! When the world's heroes disappear, a new team rises to take their place! Meet the Thunderbolts: Citizen V! Techno! MACH-1! Songbird! Meteorite! Atlas! But what dark secret are these heroes hiding? Read the stories that changed the way the world looks at redemption! Guest-starring the Hulk, Spider-Man, Black Widow and Franklin Richards! Collecting THUNDERBOLTS #1-5, #-1 and ANNUAL '97; INCREDIBLE HULK (1968) #449; SPIDER-MAN TEAM-UP #7; and material from TALES OF THE MARVEL UNIVERSE #1", "Ultimate Comics Avengers 2: Crime & Punishment (Trade Paperback)": "Who can stop the Ghost Rider? A 7-foot-tall biker with a flaming skull for a head has been brutally murdering rich and powerful men across America. Someone in the White House wants it to stop - immediately - and has ordered the Avengers to take down the Ghost Rider by any means necessary. Hawkeye, War Machine, Black Widow, the hulking gangster Tyrone Cash and the infamous Punisher: Together, they are Nick Fury's Avengers - assembled to do the jobs too dirty for the public-facing Ultimates team. But with a group of individuals this violent, this unstable, can any of them be trusted in the field? Superstar writer Mark Millar (KICK-ASS, WOLVERINE: OLD MAN LOGAN) returns to the Ultimate Universe he helped launch, bringing fan-favorite artist Leinil Yu (SECRET INVASION, NEW AVENGERS) along for all the ultra-violence! Collecting ULTIMATE COMICS AVENGERS 2 #1-6. 152 PGS./Parental Advisory ...$19.99", "Hawkeye: Blindspot (2011) #3": "The defining chapter of the Avenging Archer rages on!!Â  Battered, beaten, back against the wall, Hawkeye faces the foe that has plagued his life for years and a new threat that has rocked him to his core.", "Chaos War: Avengers (Trade Paperback)": "The Vision. Captain Mar-Vell. Yellowjacket. Deathcry. Swordsman. Dr. Druid. All lost their lives in the line of duty - or in disgrace. When Earth's Mightiest Heroes are themselves laid low in the carnage of the CHAOS WAR, and the graves give up their dead, these six find themselves mysteriously returned to reassemble against the Chaos King's most fearsome ally - one of the Avengers' greatest foes! It's a final chance at redemption and a second life - and an opportunity to prove, once and for all, that they're worthy of the name Avengers. Plus: Ares defeated Chaos King once before, but now the God of War is dead and armed only with his love for his lost son. How can he stop the living oblivion Chaos King has become, even with the help of Zeus and Hera? And at what price comes defeat? And in the midst of the epic battle raging through CHAOS WAR, Thor squares off against a foe who may be the most powerful he's ever faced: the alien god known only as Glory! This powerhouse has his sites set on helping Chaos King destroy all reality, so what hope does a simple Thunder God have of stopping him? Collecting CHAOS WAR: DEAD AVENGERS #1-3, CHAOS WAR: ARES #1, CHAOS WAR: THOR #1-2 and material from X-MEN: CURSE OF THE MUTANTS SPOTLIGHT. 152 PGS./Rated T+ ...$19.99", "Secret Avengers (2010) #11": "The secrets of John Steele and his link to the Shadow Council are revealed! What link does John Steele have with Captain America and the Prince of Orphans?", "Secret Avengers (2010) #11 (CAPTAIN AMERICA 70TH ANNIVERSARY VARIANT)": "The secrets of John Steele and his link to the Shadow Council are revealed in a special two-part World War Two espionage adventure! Also starring Captain America and the Prince of Orphans, deep behind enemy lines!", "Hawkeye & Mockingbird/Black Widow: Widowmaker (Trade Paperback)": "Who is hunting Marvel's super-spies? Espionage agents around the world are being assassinated, their covers blown, and governments' intelligence and security capabilities devastated! The person behind it: an all-new Ronin! The next two super-spies targeted for death: Black Widow and Mockingbird! The wildcard determined to unmask the killer: Hawkeye! Let the game begin as Marvel's spy community collides with its superhuman agents! Collecting WIDOWMAKER #1-4, plus a classic Hawkeye/Black Widow team-up from SOLO AVENGERS #14-16.", "Captain America and the Secret Avengers (2011) #1": "Steve Rogers' black ops femme fatales go on the hunt for a rogue assassin! Fierce fisticuffs, death-defying duels and good ol' fashioned espionage ensue as everything comes to a head in the Big Apple where the gals go in guns blazin'...", "Marvel Masterworks: The Avengers Vol. 3 Variant (DM Only) (Trade Paperback)": "Man, Thor, Giant-Man and the Wasp with a trio of former super villains, readers thought he'd gone mad. As it turned out, the only thing crazy about the adventures of Earth's Mightiest Heroes was how insanely exciting the lineup of Captain America, Hawkeye, Quicksilver and the Scarlet Witch became! With super-sized conflict within the team and colossal menaces without, the drama made every issue a nail-biting, edge-of-your-seat extravaganza. Classic stories including battles with Kang the Conqueror, Doctor Doom, Power Man and the Enchantress, and Attuma will prove that the Avengers are the world's preeminent heroes - while revelations like Captain America's departure will test the team at its most fundamental level. But it won't just be Cap's Kooky Quartet against the world forever. In these pages, you'll see also the return of Giant-Man and the Wasp, and Hank Pym's transformation into Goliath! And with the first appearances of the Collector, the Swordsman and the Sons of the Serpent - not to mention the entrance of the Black Widow into the Avengers' world - there's no questioning this collection's a MARVEL MASTERWORKS! Collecting AVENGERS #21-30.", "CAPTAIN AMERICA: REBORN MGC 1 (2011) #1": "Captain America Reborn #1 for only $1.00!", "Marvel Masterworks: The Avengers Vol. 3 (Trade Paperback)": "Man, Thor, Giant-Man and the Wasp with a trio of former super villains, readers thought he'd gone mad. As it turned out, the only thing crazy about the adventures of Earth's Mightiest Heroes was how insanely exciting the lineup of Captain America, Hawkeye, Quicksilver and the Scarlet Witch became! With super-sized conflict within the team and colossal menaces without, the drama made every issue a nail-biting, edge-of-your-seat extravaganza. Classic stories including battles with Kang the Conqueror, Doctor Doom, Power Man and the Enchantress, and Attuma will prove that the Avengers are the world's preeminent heroes - while revelations like Captain America's departure will test the team at its most fundamental level. But it won't just be Cap's Kooky Quartet against the world forever. In these pages, you'll see also the return of Giant-Man and the Wasp, and Hank Pym's transformation into Goliath! And with the first appearances of the Collector, the Swordsman and the Sons of the Serpent - not to mention the entrance of the Black Widow into the Avengers' world - there's no questioning this collection's a MARVEL MASTERWORKS! Collecting AVENGERS #21-30.", "Klaws of the Panther TPB (Trade Paperback)": "Klaw, Master of Sound, is no more dead than he is human.The killer composed of living sound is back with a new and deadly plan that will spill blood from the Savage Land to the streets of New York. Shuri, the new Black Panther, has already tried (and failed) to stop this monster - a defeat that owed as much to her own reckless rage as it did to Klaw's power. So this time, Shuri turns to some unexpected allies for help. Think you know the Black Panther? New York Times best-selling author Jonathan Maberry and artist Gianluca Gugliotta show you just how wrong you are! Collecting KLAWS OF THE PANTHER #1-4 and material from AGE OF HEROES #4.", "Onslaught Unleashed (2010) #2": "Onslaught is back--and no one is safe! As the Secret Avengers and Young Allies contend with murderous child soldiers and their remorseless leader, the Marvel Universe's baddest bad makes the heroes an offer--and you'll be surprised who takes him up on it!", "Hawkeye: Blindspot (2011) #2": "A hero lays dead at Hawkeye's feet, the villain pulling the strings is revealed, but the true master plan--and what major change it means for Hawkeye's life--is still to come! Can Hawkeye trust his eyes?", "Captain America (2004) #615": "THE TRIAL OF CAPTAIN AMERICA CONCLUSION Prepare for the verdict!  Will Captain America end up behind bars?\n", "Hawkeye: Blindspot (2011) #1": "Get it here: the past, present and future of the world's greatest archer set to star in the upcoming Marvel Studios' The Avengers movie! Hawkeye is left blindsided after the events of WIDOWMAKER, with a new vision of the world around him and, in order to move forward with his new life, he must first re-examine how it all began. All new era for the Avenging Archer begins here, as writer Jim McCann (Widowmaker, Return Of The Dapper Men) brings you a Clint Barton you've never seen before.!", "Widow Maker (2010) #4": "The game-changing conclusion! What startling new place will it take our heroes? And which hero will be completely rocked by the shocking end?\n", "Onslaught Unleashed (2010) #1 (LIEFELD VARIANT B)": "THE SECRET AVENGERS AND YOUNG ALLIES CO-STAR IN THIS SENSES-SHATTERING SAGA! Deep in the heart of Colombia, an immense and unmarked engine hums at a steady, ominous pace. Its purpose: to exploit a tear in the barrier between this world and another; to harvest and refine an exotic energy source for Roxxon Energy Corp. But just on the other side of that tear, inside the Negative Zone, a dark entity of vast power has been waiting for what has seemed like centuries, preparing for the moment when he can finally reach through the tear and once again cast his judgment on humans and mutants alike. For the psychomagnetic abomination called ONSLAUGHT, that moment is about to arrive...and he'll have the girl without a world--NOMAD--to thank for it! Eisner winner Sean McKeever and Filipe Andrade (X-23) team to bring you to the heart of terror and the edge of sanity in this hotly-anticipated epic!", "Onslaught Unleashed (2010) #1 (LIEFELD VARIANT A)": "THE SECRET AVENGERS AND YOUNG ALLIES CO-STAR IN THIS SENSES-SHATTERING SAGA! Deep in the heart of Colombia, an immense and unmarked engine hums at a steady, ominous pace. Its purpose: to exploit a tear in the barrier between this world and another; to harvest and refine an exotic energy source for Roxxon Energy Corp. But just on the other side of that tear, inside the Negative Zone, a dark entity of vast power has been waiting for what has seemed like centuries, preparing for the moment when he can finally reach through the tear and once again cast his judgment on humans and mutants alike. For the psychomagnetic abomination called ONSLAUGHT, that moment is about to arrive...and he'll have the girl without a world--NOMAD--to thank for it! Eisner winner Sean McKeever and Filipe Andrade (X-23) team to bring you to the heart of terror and the edge of sanity in this hotly-anticipated epic!", "Onslaught Unleashed (2010) #1": "THE SECRET AVENGERS AND YOUNG ALLIES CO-STAR IN THIS SENSES-SHATTERING SAGA!\nDeep in the heart of Colombia, an immense and unmarked engine hums at a steady, ominous pace. Its purpose: to exploit a tear in the barrier between this world and another; to harvest and refine an exotic energy source for Roxxon Energy Corp. But just on the other side of that tear, inside the Negative Zone, a dark entity of vast power has been waiting for what has seemed like centuries, preparing for the moment when he can finally reach through the tear and once again cast his judgment on humans and mutants alike. For the psychomagnetic abomination called ONSLAUGHT, that moment is about to arrive...and he'll have the girl without a world--NOMAD--to thank for it! Eisner winner Sean McKeever and Filipe Andrade (X-23) team to bring you to the heart of terror and the edge of sanity in this hotly-anticipated epic!", "Ultimate Avengers 3 (2010) #6": "The Vampires have taken over the Triskelion! With The Avengers on the ropes and the bloodsuckers growing stronger by the second, is there any hope for our heroes? It's Avenger versus Avenger in this blood soaked, blockbuster conclusion!\n", "Captain America (2004) #614": "THE TRIAL OF CAPTAIN AMERICA PART 4 With Bucky's trial distracting our heroes, the new Red Skull plots a terror attack at the heart of America!\n", "Marvel Adventures Super Heroes (2010) #10": "Reed Richards's secret plan is revealed at last, and a full scale Avengers assault on the Baxter Building is the result! But for which team will Susan Storm fight? And why are there TWO Black Widows?", "Marvel Adventures Super Heroes Vol. 7 Digest (Digest)": "Captain America, Iron Man, the Black Widow, Thor, the Vision, Nova, and the Invisible Woman...a powerful collective of the greatest heroes the world has ever known. They are the Avengers, and they want it known they're here to stay. Watch the all-ages action unfold when Captain America tries to take down the nefarious A.I.M. terrorist organization. Then see Thor battle the deadly Executioner aboard a pirate ship! And the Black Widow is forced to trespass into Prince Namor's domain in a desperate bid to save Tony Stark's life!", "Invincible Iron Man Vol. 4: Stark Disassembled (2011) #1": "Running out of time - and running out of mind! He's outrun\r\nNorman Osborn, embarrassed him on worldwide television, and kept the database filled to the brim with superhuman secret identities safe and secure. But in doing so, Tony Stark has lost just about everything: His armor. His power. Even his very mind.  Now, at his absolute lowest point, with his whole life disassembled and the Siege of Asgard raging outside his door, it will take Tony Stark's last reservoir of will and a band of brothers standing by him including Thor, Captain America, War Machine and Black Widow to keep from losing it all. Collecting INVINCIBLE IRON MAN #20-24.\r\n136 PGS./Rated A ...$15.99 ISBN: 978-0-7851-3686-6", "Captain America (2004) #613": "THE TRIAL OF CAPTAIN AMERICA PART 3 Bucky Barnes' future hangs in the balance as evidence of the Winter Soldier's crimes comes to light.\n", "Widow Maker (2010) #2": "Who is hunting Marvel's super spies? Espionage agents around the world are being assassinated, their covers blown, and governments' intelligence & security capabilities devastated! Let the game begin as Marvel's spy community collides with its superhuman agents!", "Klaws of the Panther (2010) #4": "Klaw and AIM are poised to conquer the Earth with their unstoppable new weapon: The Scream. Now Shuri, the new Black Panther, has to break into DEAD AIM, the most secure facility on the planet. Featuring the Black Widow! ", "Widow Maker (2010) #1": "Espionage agents around the world are being assassinated. The person behind it: an all-new Ronin! The next two super-spies targeted for death: Black Widow and Mockingbird! The wildcard determined to unmask the killer: Hawkeye.\n", "Ultimate Avengers 3 (2010) #4": "With Cap bitten, the super-soldier is turning into a super-vampire. Blade finally reveals Vampire X's true intentions, but can the heroes stop this mysterious enemy - or are they one bite closer to an eternity of immortal behavior?\n", "Black Widow (2010) #8": "\"KISS OR KILL,\" PART 3 Your name is Nick Crane. You've met this beautiful girl, and you're traveling all over Eastern Europe. It'd be like some crazy romantic comedy, except for... well, the secret government torture rooms. The black hood (that smells like garlic) over your head. The kidnapping, the poison mist, the gunfire, the chase through the bitter cold and the train derailing. And now there's this crazy guy in a robot suit and some messed-up witch-looking woman coming after you, and the only thing between you and them is that beautiful girl, who calls herself Black Widow... and you know, you kind of think she still may have killed your father. Duane Swierczynski and Manuel Garcia's new era for the super-spy Avenger known as Black Widow continues here! Jump on now before the thrill-packed, globe-hopping, bone-snapping crossover with HAWKEYE AND MOCKINGBIRD kicks off next month. 32 PGS./Rated T  ...$2.99", "Secret Avengers (2010) #7": "After Shang-Chi is captured, the Secret Avengers must spring into action to save him. Putting their morals on the line, the team must decide how far they are really willing to go to save him.", "Captain America (2004) #612": "THE TRIAL OF CAPTAIN AMERICA PART 2 Not even Captain America can escape the crimes buried in his past...\n", "Chaos War: Dead Avengers (2010) #1": "CHAOS WAR tie-in! The Vision. Captain Mar-Vell. Yellowjacket. Deathcry. Swordsman. Dr. Druid. When Earth's Mightiest Heroes are taken out, these six find themselves mysteriously resurrected, to re-assemble against the Chaos King!", "Captain America (2004) #611": "THE TRIAL OF CAPTAIN AMERICA PART 1 Bucky's public approval rating has taken a nosedive off a cliff. To clear his name, Bucky turns himself in to the United Nations. Now he must answer for his crimes as Winter Soldier.\n", "Ultimate Avengers 3 (2010) #3": "Vampire X has gotten his fangs into Captain America! Will Blade be able to help the Avengers hunt creatures of the night? Or are the heroes being prepped for a vampire main course?\n", "Black Widow (2010) #7": "Nick Crane has been kidnapped by his father's murderer, a woman calling herself Black Widow. And just as he begins to unravel the mystery of the murder, a group of highly trained, heavily armed super assassins make a surprise attack on Widow!", "Black Widow (2010) #6 (CAMPBELL VARIANT)": "New readers, jump aboard here! Duane Swierczynski and Manuel Garcia kick off a new era for the super-spy Avenger known as Black Widow! A senator is seduced and assassinated...and his journalist son follows the trail to a fatally sexy Soviet agent. This deadly \"woman in black\" moonlights as a high-class escort to lure powerful men into her web of blackmail and death. But Nick Crane believes he's finally found his father's murderer, and he's about to expose...the Black Widow!\r\nRated T  ...$2.99", "Black Widow (2010) #6": "A senator is seduced and assassinated. His journalist son, Nick Crane, follows the trail to a fatal Soviet agent. Crane believes he's finally found his father's murderer, and he's about to expose...the Black Widow!", "Iron Man 2: Agents of S.H.I.E.L.D. (2010) #1": "IRON MAN 2! You saw the Hollywood smash - now get more of the story! Officially set in the movie universe! Iron Man, Black Widow, Nick Fury and Agent Coulson in action! Think you know S.H.I.E.L.D.? Check out what you DIDN'T see in the movie!\r\nRated A ...$3.99", "Black Widow (2010) #5": "Black Widow gets answers! The villain revealed! The mystery plot on Natasha's life comes to deadly light as the Black Widow uncovers who's conspiring to destroy her...and gets some payback for the attempt on her life!", "Captain America (2004) #609 (WOMEN OF MARVEL VARIANT)": "Bucky must return to the place where his life once ended as Baron Zemo continues to rip his life apart.  It's the hardest hitting arc of Captain America ever by the awesome team of Ed Brubaker and Butch Guice.\nRated T $3.99", "Ultimate Avengers 3 (2010) #1": "Blade is back in a bad way and that can only mean one thing: vampires are afoot! As the Avengers get deeper into black ops, there's no telling who'll be thirsting for blood and who'll be next on the menu!\n", "Black Widow (2010) #4": "The Avengers haven't been able to help, the US government is somehow involved and the web of intrigue surrounding Natasha has tightened into a noose! Will the Black Widow discover who's out to destroy her before it's too late?", "Ultimate Comics Avengers 2 (2010) #5": "CRIME AND PUNISHMENT PART 5 The Avengers have hell to pay as they fight on against the Ghost Rider. With vice-president Blackthorne next on Ghost Rider's list, the Avengers get ready to save some souls!", "Iron Man: Kiss and Kill (2010) #1": "He's got the tux. He's got the tech. He's got the babes. But he'll leave the martini, thank you very much. Tony Stark gets his spy on in these two twisty tales of espionage and international intrigue. First, Joe Ahearne (FANTASTIC FOUR) and Brian Ching (Star Wars) show you why the Black Widow is an Iron Man's best friend when Tony has to go undercover to take down a foe using his own decommissioned tech! Then, Karl Kesel (MARVEL APES) and Eric Nguyen (HALO: BLOODLINE) take you behind the velvet rope when Tony infiltrates the Hellfire Club to help out a wayward thief. Good thing he's got Wolverine to back him up! Wait, no, that's not going to end well...", "Black Widow (2010) #3": "When Elektra and other familiar faces are crawling out of the woodwork to chase Marvel's top super-spy, where will Natasha be able to turn?", "Ultimate Comics Avengers 2 (2010) #3": "CRIME AND PUNISHMENT PART 3 Nick Fury's Avengers have assembled: Black Widow, The Punisher, a new Hulk, War Machine and Hawkeye are ready to face off against the Ghost Rider, a mysterious new villain from Hell!", "Invincible Iron Man (2008) #25 (2ND PRINTING VARIANT)": "Double-sized issue! Co-released alongside this summer's surefire blockbuster hit IRON MAN 2, this issue is the perfect jumping-on point for fans of the films and readers new and old alike! New year. New decade. New trade dress. New threats. New loves. New armor. New Tony Stark. New storyline: RESILIENT. Get on board the Eisner-award winning INVINCIBLE IRON MAN here! Rated A $3.99", "Ultimate Comics Avengers 2 (2010) #2": "CRIME AND PUNISHMENT PART 2 The Avengers get their first mission: track and neutralize the Ghost Rider for good. To do this the team is going to need one more recruit to help. The Hulk. War Machine and Hulk go head-to-head!", "Black Widow (2010) #2": "Black Widow has narrowly escaped death. Recovering from her near-fatal injuries, Natasha sets out on a mission of retaliation! But what do Iron Man and Wolverine know about her attacker and why won't they help her? Find out here!", "Iron Man 2- Black Widow: Agent of S.H.I.E.L.D. (2010) #1": "MARVEL DIGITAL COMICS EXCLUSIVE\r\nTop intelligence agent and paramilitary operative the Black Widow is assigned by S.H.I.E.L.D. to work undercover as a notary public within Stark Industries and get close to Tony Stark in this story set in Marvel movie continuity!", "Black Widow (2010) #1 (2ND PRINTING VARIANT)": "The deadly super-spy from IRON MAN 2, INVINCIBLE IRON MAN and CAPTAIN AMERICA in her own ongoing series!\r\nNatasha Romanoff is not a super hero. She's not psychic. She doesn't fly. And yet as the Black Widow, she manages to hold her own against a world of incredibly powerful enemies...and allies. But now someone has tried to kill Natasha...and almost succeeded. Injured gravely, almost beyond her ability to recover, Black Widow sets out to find her attacker...with no suspects and no leads. Who could be deadly enough to get the drop on Natasha? And what connections do they have to some of her closest super hero friends...? Plus, a backup detailing the deadly history of the Black Widow!\r\nRated T  ...$3.99", "Invincible Iron Man (2008) #25 (TRIMPE VARIANT)": "Double-sized issue! Co-released alongside this summer's surefire blockbuster hit IRON MAN 2, this issue is the perfect jumping-on point for fans of the films and readers new and old alike! New year. New decade. New trade dress. New threats. New loves. New armor. New Tony Stark. New storyline: RESILIENT. Get on board the Eisner-award winning INVINCIBLE IRON MAN here! Rated A", "Invincible Iron Man (2008) #25 (MOVIE VARIANT)": "Double-sized issue! Co-released alongside this summer's surefire blockbuster hit IRON MAN 2, this issue is the perfect jumping-on point for fans of the films and readers new and old alike! New year. New decade. New trade dress. New threats. New loves. New armor. New Tony Stark. New storyline: RESILIENT. Get onboard the Eisner-award winning INVINCIBLE IRON MAN here! Rated A", "Invincible Iron Man (2008) #25 (IRON MAN BY DESIGN VARIANT)": "Double-sized issue! Co-released alongside this summer's surefire blockbuster hit IRON MAN 2, this issue is the perfect jumping-on point for fans of the films and readers new and old alike! New year. New decade. New trade dress. New threats. New loves. New armor. New Tony Stark. New storyline: RESILIENT. Get on-board the Eisner-award winning INVINCIBLE IRON MAN here! Rated A", "Black Widow (2010) #1": "The deadly super-spy from IRON MAN 2, INVINCIBLE IRON MAN and CAPTAIN AMERICA in her own ongoing series!\nWho could be deadly enough to get the drop on the Black Widow? And what connections do they have to some of her closest super hero friends...?", "Black Widow (2010) #1 (FOREMAN VARIANT)": "The deadly super-spy from IRON MAN 2, INVINCIBLE IRON MAN and CAPTAIN AMERICA in her own ongoing series!\r\nNatasha Romanoff is not a super hero. She's not psychic. She doesn't fly. And yet as the Black Widow, she manages to hold her own against a world of incredibly powerful enemies...and allies. But now someone has tried to kill Natasha...and almost succeeded. Injured gravely, almost beyond her ability to recover, Black Widow sets out to find her attacker...with no suspects and no leads. Who could be deadly enough to get the drop on Natasha? And what connections do they have to some of her closest super hero friends...? Plus, a backup detailing the deadly history of the Black Widow!\r\nRated T", "Black Widow (2010) #1 (MOVIE VARIANT)": "The deadly super-spy from IRON MAN 2, INVINCIBLE IRON MAN and CAPTAIN AMERICA in her own ongoing series!\r\nNatasha Romanoff is not a super hero. She's not psychic. She doesn't fly. And yet as the Black Widow, she manages to hold her own against a world of incredibly powerful enemies...and allies. But now someone has tried to kill Natasha...and almost succeeded. Injured gravely, almost beyond her ability to recover, Black Widow sets out to find her attacker...with no suspects and no leads. Who could be deadly enough to get the drop on Natasha? And what connections do they have to some of her closest super hero friends...? Plus, a backup detailing the deadly history of the Black Widow!\r\nRated T", "Hercules: Fall of an Avenger (2010) #1": "When the most beloved Olympian of all time falls, who will mourn him?  Acclaimed INCREDIBLE HULK artist Ariel Olivetti joins writers Greg Pak and Fred Van Lente for a two-part mini-epic that marks the end of an era and the beginning of something utterly unexpected for Hercules, the Lion of Olympus.  Bring your hankies -- and your golden adamantine maces -- as an all-star cast including Thor, Namor, Namora, Snowbird, Alflyse, Bruce Banner, and of course, Amadeus Cho send off the Son of Zeus with shocking tales, smash-tastic action, bawdy tomfoolery, and heart-rending drama that will change the course of Marvel's marvelous mythological milieu... forever!  Plus: There are some missions that require a woman's touch- so the rest of the Agents of Atlas hang back and let Venus and Namora go out and show their stuff!\r\nRated T  ...$3.99", "Captain America: Reborn (2009) #6 (2ND PRINTING VARIANT)": "The story so big we needed another issue to finish it!  The return of Captain America! The fight for the body and soul and mind of Steve Rogers! Avengers versus the Red Skull and his cronies!  The biggest finale of the year is finally here! Brought to you by Ed Brubaker, Bryan Hitch and Butch Guice!\r\nRated T  ...$3.99", "Black Widow & the Marvel Girls (2009) #4": "The Black Widow is not normally a woman who involves herself in gang wars, but this one is a bit different. When an ousted Torino family lieutenant forms a new mob \"family\" and comes after his old family with a vengeance, leading a renegade mob of moloids and kidnapping a U.S. senator who's a personal friend of the X-Men known as Storm, it's up to the Black Widow to put an end to this mob war. And she has to do it all with a team comprised of herself, and Storm, and the world's number one expert on moloids...the Mole Man.\r\nRated A ...$2.99", "Incredible Hulks (2010) #607 (MCGUINNESS VARIANT)": "FALL OF THE HULKS Tie-In The mysterious Red She-Hulk takes on the Earth's Mightiest Heroes -- and only Banner and Son can save the day!  But will they?   The life of an Avenger hangs in the balance as Bruce Banner finally reveals his true alliances and objectives!  Be there as the gamma-sized FALL OF THE HULKS continues with fan favorite Hulk-writer Greg Pak (PLANET HULK, WORLD WAR HULK) and spectacular penciler Paul Pelletier (WAR OF KINGS)!  Plus, a backup feature continuing the first mission of Red She-Hulk! Rated A", "Captain America: Reborn (2009) #6": "The story so big we needed another issue to finish it!  The return of Captain America! The fight for the body and soul and mind of Steve Rogers! Avengers versus the Red Skull and his cronies!  The biggest finale of the year is finally here! Brought to you by Ed Brubaker, Bryan Hitch and Butch Guice!\r\nRated T  ...$3.99", "Black Widow & the Marvel Girls (2009) #3": "She's S.H.I.E.L.D. agent Natasha Romanoff, and Nick Fury has two missions for his newest recruit. First, find out everything possible about the mysterious Ms. Marvel, and deal with her if deemed necessary. Secondly, infiltrate the Red Skull's organization and discover the location of one of the Skull's \"Sleeper\" robots before it spells doom for all mankind. Natasha Romanoff, the Black Widow, is soon to find that combining these two cases is the one way to stay alive.\r\nRated A ...$2.99", "Black Widow & the Marvel Girls (2009) #2": "Fitting in with the Avengers is not an easy job, not for a woman with no true powers beyond years of training and a ruthless ambition to succeed at any given task, and after a midair battle separates the Black Widow from the rest of her team, the mission to protect an advanced robot just got harder. Luckily, the Black Widow has her skills on her side, and the Avenger known as the Wasp at her back. Unluckily, the robot's owner is Dr. Doom, and Latveria's despotic ruler will stop at nothing to reclaim his own. \r\n32 PGS. (EACH)/Rated A ...$2.99 (EACH)", "Captain America: Reborn (2009) #5": "Steve Rogers is back...or is he? This is the action-packed finale of the best-selling series as the Avengers try to rescue their best and brightest from the Red Skull's darkest designs. Find out the fates of Steve Rogers and Bucky Barnes and what their futures hold in store!\r\nRated T  ...$3.99", "Black Widow & the Marvel Girls (2009) #1": "She's the most efficient spy in the world and one of the world's deadliest women, but before there was ever a Black Widow, there was the Red Room, a brutal KGB training ground for assassins, undercover agents, and the most ruthless of spies. Now, tasked with removing a rogue weapon's dealer from an impregnable safe house, the Black Widow remembers her escape from the Red Room training facility, an escape only made possible with the aid of the most unlikely of allies, the Asgardian sorceress known as Amora...the Enchantress.", "Captain America: Reborn (2009) #4": "Steve Rogers, the original Captain America - trapped in time! Bucky and Sharon Carter - in the hands of the enemy!\r\nAs Dr. Doom and the Red Skull make a terrifying pact that could destroy what Captain America means forever! \r\nEd Brubaker and Bryan Hitch bring you the penultimate issue of Marvel's event of the year!\r\nRated T  ...$3.99", "Captain America: Reborn (2009) #3": "Dr. Doom and the Red Skull together again! And what is the fate of the original Captain America, Steve Rogers -- and how can he help save himself from the accidental trap he's found himself in? All this and more -- as the Avengers and the FF battle insane odds to save Marvel's Fallen Son!\r\nBy the astonishing team of Brubaker, Hitch, and Guice!", "Wolverine Origins (2006) #39": "ROMULUS PART 3 Deep in the heart of Russia, Wolverine drags himself one step closer to the truth about the man known only as Romulus-but the death-touch of Omega Red stands in his way!", "Captain America: Reborn (2009) #2": "The race for Steve Rogers is on! On one side - BUCKY and the BLACK WIDOW and members of the AVENGERS and FANTASTIC FOUR! On the other - NORMAN OSBORN and HAMMER, THE RED SKULL and his evil hordes, with DR. DOOM waiting in the wings! And where... oh where, is the real CAPTAIN AMERICA?\r\nEd Brubaker, Bryan Hitch and Butch Guice bring you the biggest Marvel comic of the year!\r\nRated T  ...$3.99", "Captain America: Reborn (2009) #1": "Following the events of Captain America #600, Steve Rogers' closest friends and allies may have found a way to bring back the original Captain America.  Or is what they found something more sinister?  The Red Skull's greatest plan to destroy Captain America has been in motion and its completion is almost at hand.  Will Captain America be lost forever or will he be REBORN?    \r\nRated T  ...$3.99", "Adam: Legend of the Blue Marvel (Trade Paperback)": "An unstoppable super-villain attacks New York City - and the Mighty Avengers fall before him! Where did Anti-Man come from? And who can stop his overwhelming rampage?! Now Iron Man races to find the only man who's ever defeated Anti-Man - THE BLUE MARVEL! A hero the world hasn't seen since 1961! Will Tony Stark uncover the truth behind Blue Marvel's disappearance and will Blue Marvel ever recover from it? Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League) join forces to create Marvel's newest powerhouse super hero! Collecting ADAM: LEGEND OF THE BLUE MARVEL #1-5.\r\nRated T  ...$19.99 \r\nISBN: 978-0-7851-2409-2", "Avengers/Invaders (2008) #8": "With the real enemy revealed, two teams of Avengers are drawn together for a brutal battle royale. Meanwhile, a secret from the Invaders' past threatens to destroy the present, upend the chessboard and send several heroes back through the veils of time...perhaps lost forever.\r<br>Rated T+ ...$2.99\r<br>", "Adam: Legend of the Blue Marvel (2008) #1": "An unstoppable super-villain attacks New York City--and the Mighty Avengers fall before him! Where did Anti-Man come from? And who can stop his overwhelming rampage?! Now Iron Man races to find the only man who's ever defeated Anti-Man--\r\nTHE BLUE MARVEL...a hero the world hasn't seen since 1961! Will Tony Stark uncover the truth behind Blue Marvel's\r\ndisappearance...and will Blue Marvel ever recover from it? Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League) join forces to create Marvel's newest powerhouse super hero!\r\nRated T  ...$3.99", "Captain America: The Death of Captain America Vol. 2 - The Burden of Dreams (Trade Paperback)": "'Beloved comic book hero Captain America is back in action, armed and ready to fight for freedom in the 21st century.' ' abcnews.com\r\nAgent 13. Bucky Barnes. The Falcon. Black Widow. Iron Man. Steve Rogers was often the glue that bound these heroes together in common cause. Now, in the aftermath of his death, they come together again in a desperate attempt to keep his dream alive. But the collapse of Steve Roger's dream was just the first step in the wicked machinations of the Red Skull, who is determined to see the death of America follow soon after the death of the Captain. As the Skull's master plan kicks into motion, and chaos begins to take hold of the United States, only one man stands in its way ' but is he up to the task? Collecting CAPTAIN AMERICA #31-36.\r\nRated T  '$14.99\r\nISBN: 978-0-7851-2424-5", "X-Men: The Complete Onslaught Epic Book 3 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got underway! Professor X hasn't been himself lately - moody, inscrutable, but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, the Fantastic Four, the Avengers, but forgotten stars of the nineties like Green Goblin Phil Urich, Nate Grey the X-Man and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Hulk, the Pantheon, the Punisher, S.H.I.E.L.D. and others! Collecting HULK #445, IRON MAN #332, AVENGERS #402, PUNISHER #11, X-MAN #19, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, FANTASTIC FOUR #416 and WOLVERINE #105.\r<br>Rated T+ ...$29.99\r<br>", "Mighty Avengers Vol. 1: The Ultron Initiative (Trade Paperback)": "'THIS is the once and future Avengers.' ' Ain't It Cool News\r\nDoom looks like a lady! The super-hero Civil War is over, but Iron Man's work is just beginning. As the new head of S.H.I.E.L.D. and creator of the nationwide Initiative program, he's rebuilding the Avengers with a handpicked roster of Earth's mightiest heroes: Wasp, Black Widow, Wonder Man, Sentry, Ares and new team leader Ms. Marvel. A group this powerful should be ready for just about anything ' except, perhaps, the return of genocidal killing machine Ultron. The Avengers' insane robotic foe has rebuilt himself yet again, this time in the form of'a beautiful woman!? NEW AVENGERS writer Brian Bendis and Liberty Meadows creator Frank Cho launch an all-new Avengers series pitting the team against the ultimate femme fatale! Collecting MIGHTY AVENGERS #1-6.\r\nRated A '$14.99", "The Mighty Avengers (2007) #15": "SECRET INVASION TIE-IN! Discover how the heroes were replaced by Skrull doppelgangers in this look back in time!", "Captain America: The Death of Captain America Vol. 1 (Trade Paperback)": "'The quintessential American super hero is dead.' ' U.S. News & World Report\r\nLeaping from the final pages of CIVIL WAR, this is the biggest Cap story that Ed Brubaker and Steve Epting have yet to tell '\r\nguaranteed to stun readers and send shockwaves through the entire Marvel Universe! As repercussions ripple outward, the\r\nWinter Soldier finally chooses a side ' his own. But what are the Red Skull and his minions up to behind the scenes? Collecting CAPTAIN AMERICA #25-30.\r\nRated T  '$14.99\r\nISBN: 978-0-7851-2423-8", "Avengers/Invaders (2008) #2": "The cross-time team-up of the year continues with the award winning team behind EARTH X, Justice and Project:\r\nSuperpowers! With World War II's greatest heroes mysteriously transported to 2008, it takes the Mighty Avengers to bring them in before the world realizes that the Invaders are back...including the original Captain America. But will Iron Man and S.H.I.E.L.D. have enough firepower to hold them...or do the Invaders have everyone just where they want them?\r\nRated T  ...$2.99", "The Mighty Avengers (2007) #11": "Get ready to see an Avengers/Doctor Doom knock-down drag-out! And we promise an ending you've never seen in the history of Doom!  All this and the Secret Invasion is upon us!", "Captain America (2004) #36": "THE SECOND ACT OF THE DEATH OF CAPTAIN AMERICA COMES TO ITS SHOCKING CONCLUSION!\nThe new Captain America fights the Red Skull's minions with Black Widow at his side and chaos erupting all around them!  Meanwhile, Sharon Carter, still under the control of Dr. Faustus, makes a horrifying discovery about the next stage of the Skull's plans!  By Eisner and Harvey Award-Winning Best Writer Ed Brubaker with art by master storytellers Steve Epting and Butch Guice.", "The Mighty Avengers (2007) #9": "DOCTOR DOOM!! The Avengers invade Latveria to take down Doctor Doom for his chemical attack on America. Only maybe it wasn't Doom exactly.", "Incredible Hercules (2008) #114": "Driven into a berserker rage by Ares, Hercules has become the critical piece of Cho's plan to destroy S.H.I.E.L.D. Will Herc fall into place or has he become the biggest liability of all?", "New Avengers (2004) #38": "Conspiracy, paranoia, and betrayal may have taken their toll on the Avengers newlyweds Jessica Jones and Luke Cage. Has Jessica turned her back on The Avengers? Guest-starring the Mighty Avengers.", "The Mighty Avengers (2007) #8": "It's the Mighty Avengers versus the New Avengers who have been overtaken by a symbiote virus. So, yeah, it's Avengers versus Avengers symbiotes!! Janet gets new powers!! And the Mighty Avengers declare war on a foreign country!!", "The Mighty Avengers (2007) #7": "A Venom virus hits the city of New York!! A Venom virus!! The entire city of New York turns symbiote.  Plus, Wonder Man gets a much needed makeover.  All this and Tony Stark gets himself a green-skinned present in a body bag.", "Giant-Size Avengers Special (2007) #1": "As the Avengers battle to take down the Serpent Society, the team recalls never-before-told tales of their past! Watch as:  \r<br>Spider-Man tries to integrate into a team and learns a thing or two about history, Luke Cage and Wolverine go toe-to-toe against a terrifying cosmic foe, Henry Peter Gyrich becomes an unlikely hero on an unlikely world, and Jarvis the butler cleans house...after some robot Vikings drop by unexpectedly. On top of all that-it's the return of the critically-acclaimed Fin Fang Four by Scott Grey and Roger Langridge! That's 55 pages of all-new comics, PLUS classic reprints from Avengers history!\r<br>\r<br>Rated A ...$4.99", "The Mighty Avengers (2007) #6": "The shocking conclusion to the Ultron terror as the Avengers reassemble and go on the offensive. It's now or never for an Ultron butt-kicking. How on Earth will Tony Stark survive this??? And how does this connect to the startling Skrull infestation that may have taken over the Marvel Universe? The next big clue to the truth is HERE!!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Atlas (2007) #1": "Walk through Marvel's Earth with the first-ever official atlas! In the first half of this indispensable guide, travel through Europe, Asia and the Pacific with digestible in-depth features including: the splendor of Dr. Doom's Latveria! The wonders of Muir Island! The glory of Silver Sable's homeland Symkaria! The urban squalor of Madripoor! The underwater marvels of Lemuria! From the shores of Ireland to the ocean's very depths, it's all mapped out for you courtesy of handbook legend Eliot R. Brown (PUNISHER ARMORY, IRON MANUAL)!", "Captain America: The Death of Captain America Vol. 1 Premiere (Hardcover)": "The death of Captain America! Leaping from the final pages of CIVIL WAR, this is the biggest Cap story that Ed Brubaker and Steve Epting have yet to tell - guaranteed to stun readers and send shockwaves through the entire Marvel Universe for the next year! As repercussions ripple outward, the Winter Soldier finally chooses a side, after the Civil War has ended - his own. But what are the Red Skull and his minions up to behind the scenes? Collecting CAPTAIN AMERICA #25-30.\r<br>Rated T+ ...$19.99\r<br>", "Captain America (2004) #32": "THE EPIC DEATH OF CAPTAIN AMERICA STORY CONTINUES! \nThe Falcon and Black Widow hunt together! Can they save the Winter Soldier from becoming a tool of the Red Skull again? And if they do, will he just go kill Tony Stark?  And what of Agent 13, Sharon Carter, who shot the final bullets into her true love, Steve Rogers, and has seen her life fall apart since then?  Those answers, much action, and more! From the Eisner Award-Winning Best Writer Ed Brubaker and Fan-Favorite Artist Steve Epting.", "The Mighty Avengers (2007) #5": "The shocking conclusion to the Ultron terror as the Avengers reassemble and go on the offensive. It's now or never for an Ultron butt-kicking. How on Earth will Tony Stark survive this??? And how does this connect to the startling Skrull infestation that may have taken over the Marvel Universe? The next big clue to the truth is HERE!!", "Marvel Masterworks: The Avengers Vol. 7 (Hardcover)": "Earth's Mightiest Heroes assemble once again under the banner of the crème de la crème of comics collections-the Marvel Masterworks. Joined by the titanic talents of John Buscema, Gene Colan, and Barry Windsor-Smith, AVENGERS scribe, Roy Thomas, elevates the intrigue to fever pitch in yet another watershed collection. Featuring Hank Pym's first turn as Yellowjacket, Hawkeye's metamorphosis into Goliath, the wedding of Giant-Man and the Wasp, a solo adventure with the Black Panther, and building to a boil with a battle against the one and only Ultron, we dare to catch your breath while reading this classic collection! And to top it all off, we're including Roy Thomas and Howard Purcell's rare Black Knight tale from the pages of MARVEL SUPER-HEROES! Reserve that copy today, True Believer!\r<br>Collecting THE AVENGERS #59-68 and MARVEL SUPER-HEROES #17 \r<br>256 PGS./Rated A ...$54.99 \r<br>ISBN: 978-0-7851-2680-5 \r<br>MARVEL MASTERWORKS: THE AVENGERS VOL. 7 - VARIANT EDITION VOL. 84 \r<br>256 PGS./Rated A ...$54.99 \r<br>ISBN: 978-0-7851-2681-2\r<br>", "Marvel Adventures the Avengers (2006) #16": "Look, sorry pal- ow- but this isn't Robin Hood and the Merry Men- ow-ow-, this is The Avengers- ow!  Hey, watch it with those thi- ow, ow, OW! Fine. What did you say your name was, Hawk-something?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Wolverine: Origins Vol. 2 - Savior (Trade Paperback)": "Completely shattered by recent revelations, Logan must now ask himself some hard-almost impossible-questions, such as whether he can continue on his quest...or if he even should. Though he now remembers who he was, the more pressing \r<br> question becomes who-and what-is he now? Answering these questions will take the help of one of Logan's closest friends and one of his deadliest enemies: Omega Red! Collecting WOLVERINE: ORIGINS #6-10\r<br>128 PGS./Parental Advisory ...$13.99\r<br>ISBN: 978-0-7851-2288-3\r<br>", "Women of Marvel Vol. 2 (Trade Paperback)": "More classic tales of Marvel's leading ladies! Featuring Kitty Pryde, Black Cat, Dagger, Spider-Woman, Tigra, Jubilee and more! Collecting AVENGERS #83, STRANGE TALES #10-11, SPIDER-WOMAN #10, WEST COAST AVENGERS #15, visions & the Scarlet Witch #12, Uncanny X-Men #168, 189, 201, & 218\r<br>232 PGS./Rated A ...$24.99 \r<br>", "The Mighty Avengers (2007) #4": "Ultron has taken over the world!! The Black Widow has taken over S.H.I.E.L.D.! The Sentry's life is changed FOREVER! And the rest of the Avengers are faced with the power of the new Iron Man unleashed!!", "Paradise X Vol. 1 (Trade Paperback)": "In EARTH X, Captain America, the Fantastic Four, Thor, the Hulk and the X-Men discovered that their purpose - and the meaning of all super heroes and mutated people in the universe - was nothing more than to protect their host planet, in this case Earth, from outside invasion. They learned super heroes are merely biological antibodies to protect a growing embryo within the Earth. An embryo for the Celestial race: This is the way these Gods fought back - only to cause a terrible ecological imbalance, a rift at its core that in time would wipe out all life on the planet. In UNIVERSE X, Captain Marvel was reborn on Earth years after his death. But he also still claimed to walk in the realm of the unliving, where Earth's fallen champions still exist. Mar-Vell led a team of heroes in a quest for the greatest weapons of mass destruction on Earth, suggesting this would limit the destruction caused by the growing power struggle on the planet. But this was not the only reason. For his crusade on Earth only supported and armed a battle he fought in the realm of the fallen, a battle against Death herself. Those living champions who died in his collection of artifacts were added to the battle raging in this other realm. Mar-Vell led a charge against Death and killed her. But now that Death is dead, no one will ever die again. They may writhe in pain in hospitals because their bodies have been broken beyond repair, but they will not die. They will call out for an end to their suffering. They will cry out for peace but there will be no answer. Paradise will be denied them. Yes. Death is truly dead. Long live the living. Collecting PARADISE X #0-5, PARADISE X: XEN and HERALDS #1-3.\r<br>304 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2415-2\r<br>", "Captain America (2004) #27": "It's follow-up to Cap's side of the story from Civil War that you can only find here in Captain America -- and all we can tell you right now is, nothing is what it seems!", "Avengers Classic (2007) #1": "In the tradition of CLASSIC X-MEN, we're re-presenting the original AVENGERS #1 digitally re-mastered with THX ™ surround sound and a brand spankin' new cover by ARTHUR ADAMS! But that's not all!!! We have not one, but TWO brand new short stories as well! DWAYNE McDUFFIE and painter MICHAEL AVON OEMING bring you a tale of the Avengers first tumultuous meeting and STAN \"THE MAN\" LEE (who started it all!) and artist extraordinaire KEVIN MAGUIRE bring you a compelling tale about how the Avengers REALLY formed!\r<br>Face it, this book is HOT!\r<br>48 PGS./Rated A ...$3.99 \r<br>SPECIAL OVER-SIZED FIRST ISSUE!\r<br>", "The Mighty Avengers (2007) #3": "Mighty Avengers versus the next gen Ultron! Ultron has taken over everything by taking over Iron Man! And now she has to face the Sentry unleashed! A battle of the titans Avengers style! Plus, Tigra guest stars.", "The Mighty Avengers (2007) #2": "ULTRON IS BACK and, yes, now he's a she. What?? Ultron's a girl?? It's Ultron as only Frank Cho can bring it. And the Mighty Avengers haven't had a moment to get to know each other before they are thrown into one of the most epic adventures in the history of the Avengers.", "Avengers: Earth's Mightiest Heroes II (2006) #8": "This is it!  The concluding chapter of this untold tale in Avengers' history.  The Super-Adaptoid has returned for its final revenge... facing off against the one Avenger whose powers it cannot duplicate: the Vision!  It's all-out android carnage in the streets of Manhattan -- the moment where this unlikely lineup of Avengers will finally prove their worth once and for all!\r<br>32 PGS./CARDSTOCK COVER/Rated A ...$3.99 \r<br>", "Avengers: The Initiative (2007) #1": "After Armory's weapon causes the death of M.V.P., she washes out of the Initiative Program. The circumstances of the event have since been made hush-hush. As far as the Initiative is concerned, M.V.P. never died in Stamford...", "Irredeemable Ant-Man (2006) #7": "Why fight super-villains when you can watch attractive ladies take their clothes off in the privacy of their own homes? Ant-Man has got it made! That is until he realizes that the subject of his perverted voyeurism is none other than Ms. Marvel!", "Avengers Assemble Vol. 4 (Hardcover)": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>", "Avengers: Earth's Mightiest Heroes II (2006) #5": "The Super-Adaptoid has gone underground, and Hank Pym has stared down his deepest demons.  And when the mysterious Yellowjacket arrives on the scene... why do the Avengers have to act like they don't know him?  And how does his appearance lead to the most surreal super hero wedding in Marvel history?  All the answers are here!\r<br>32 PGS./Rated A ...$3.99 \r<br>", "Champions Classic Vol. 2 (Trade Paperback)": "Demon-gods, alien monsters and killer bees - it only goes to show that Angel, Iceman, Hercules, Black Widow and Ghost Rider did more before #17 than some teams get done by #50! The short-lived super-team squeezed multiple mayhem into mere months of masked marvelry! Featuring the Stranger and the Stilt-Man! Magneto and MODOK! The world reign of Doctor Doom! The Sentinels and the Brotherhood of Evil Mutants! Guest-starring Spider-Man and the Avengers! Plus: destined for the pages of Punisher War Journal...Rampage! Collecting CHAMPIONS #12-17, IRON MAN ANNUAL #4, AVENGERS #163, SUPER-VILLAIN TEAM-UP #14. and PETER PARKER, THE SPECTACULAR SPIDER-MAN #17-18.\r<br>216 PGS./Rated A ...$19.99\r<br>", "Wolverine Origins (2006) #8": "SAVIOR PART 3 While Omega Red holds Jubilee hostage and with S.H.I.E.L.D. hot on his trail, Logan makes his way to Berlin to retrieve an elusive artifact from the Cold War that may be Red's undoing!", "Avengers Assemble Vol. 3 (Hardcover)": "The crisis of the Eighth Day is followed by Triathlon's first day as an Avenger, which takes the team south of the border and back in time thousands of years! And how does the mystery of Madame Masque match the curse of Count Nefaria? Guest-starring Spider-Man and Captain Marvel! Plus: Citizen V, the Crimson Cowl and Scourge! Includes an untold tale of the Avengers' earliest adventures! Collects AVENGERS #23-34 & #1 1/2 and THUNDERBOLTS #42-44.\r<br>432 PGS./Rated T+ ...$34.99\r<br>", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Champions Classic Vol. 1 (Trade Paperback)": "Okay, a god, a demon, a spy and two mutants walk into... resulting in some of the strangest scenarios of the '70s! It's gods vs. heroes in the City of Angels! With mad scientists, Russian super-spies, and guest-stars from Marvel's western and horror eras! Plus: the secrets of the Black Widow! Featuring Hawkeye! Collects CHAMPIONS #1-11.\r<br>208 PGS./ Rated A ...$19.99\r<br>", "Daredevil Vol. 13: The Murdock Papers (Trade Paperback)": "The Eisner Award-winning run of Brian Michael Bendis and Alex Maleev comes to a blistering conclusion! First, they outed Daredevil in the press, then they married him and made him the Kingpin of Hell's Kitchen. What could they possibly do to top that? Four words: WILSON FISK IS BACK! Collects DAREDEVIL #76-81.\r<br>144 PGS./T+ SUGGESTED FOR TEENS AND UP ...$14.99\r<br>", "Captain Universe: Universal Heroes (Trade Paperback)": "Captain Universe is known as the name for the recipient of the mysterious Uni-Power, a special kind of energy that endows an individual with superhuman powers during a time of crisis. How it has determined its hosts in the past remains a mystery. Now, the unraveling of one of the greatest enigmas in the universe begins as the Uni-Power must possess a handful of Marvel heroes-Hulk, Daredevil, X-23, Invisible Woman and Silver Surfer-to save itself form an enemy hell bent on its destruction! Collects AMAZING FANTASY #13-14, CAPTAIN UNIVERSE/HULK, CAPTAIN UNIVERSE/DAREDEVIL, CAPTAIN UNIVERSE/X-23, 136 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$13.99\r<br>ISBN: 0-7851-1857-8\r<br>", "New Avengers Vol. 1: Breakout (Trade Paperback)": "In the wake of the systematic destruction of the original Avengers, just what sort of threat to the world could persuade Captain America to assemble an all-new team? And following the events of AVENGERS DISASSEMBLED, who could possibly be on this team? How does Cap, Iron Man, Spider-Man and Wolverine sound? Fate has brought them together, and now Captain America wants to make it permanent! Who will take his hand and join the new Avengers? And will they be strong enough to fight the mysterious forces at play around them? Collects NEW AVENGERS #1-5.\r<br>152 PGS./Rated A ...$14.99\r<br>ISBN: 0-7851-1479-3\r<br>", "Daredevil (1998) #80": "Matt Murdock makes one of the most important decision of his entire life as the race to secure the Murdock Papers escalates.", "Daredevil (1998) #79": "Will the justice system Matt Murdock has dedicated his life to serving abandon him in the face of the biggest challenge of his life? The battle for the Murdock Papers takes a shocking turn.", "Daredevil Vol. V: Out (Trade Paperback)": "A down-on-his-luck FBI agent has sold the hero's most guarded secret to a tabloid newspaper, exposing Daredevil's identity to the entire world. How far will the Man Without Fear go to reclaim his life?", "Daredevil (1998) #78": "Matt Murdock's entire future is on the line. The Kingpin has pure evidence of his dual identity, and if the Feds get it, game over. And the one person that knows where this evidence is? Elektra!", "Daredevil (1998) #77": "Wilson Fisk makes an offer to the Feds they can't refuse. The Kingpin offers up Matt Murdock in exchange for a free pass out of trouble and the Feds are taking the deal!", "Marvel Visionaries: Chris Claremont (Hardcover)": "In celebration of the 30th anniversary of Chris Claremont's first X-Men story, the House of Ideas presents a timeless testament to another true Marvel visionary! Best known for ushering the X-Men from reprints to blockbuster franchise, Claremont has steered Marvel's mutants for three decades while working alongside some of comicdom's top artists. This deluxe keepsake edition collects some of his greatest moments - including stories from DAREDEVIL #102; MARVEL PREMIERE #11; IRON FIST #14; UNCANNY X-MEN #137, #153, #205, #268 and ANNUAL #12; AVENGERS ANNUAL #10; WOLVERINE #3; NEW MUTANTS #21; CLASSIC X-MEN #13; EXCALIBUR #16; and X-MEN UNLIMITED #36.\r<br>376 PGS./Marvel T+ ...$29.99\r<br>ISBN: 0-7851-1887-x\r<br>", "New Avengers (2004) #6": "Hold on to your hats! Wall-to-wall action New Avengers-style. The New Avengers have gathered to avenge those affected by the wild events of the Breakout. But the questions revealed in this issue will have deep ramifications for the rest of the Marvel Universe.", "Marvel Masterworks: The Invincible Iron Man Vol. (Hardcover)": "Marvel's Man of Metal makes his triumphant return to the Masterworks! Yes, it's time to fess up and Face Front, True Believers: After a thirteen-year vacation, the iron-clad Avenger's back with his sophomore effort at long last. But it's guaranteed to be one harrowing homecoming!\r<br>This tome's classic tales pit Tony Stark against a virtual who's who of adversaries in the mighty Marvel manner that could only be brought to you by Stan Lee and the lavish pen of \"Dashing\" Don Heck! There's the return of Iron Man's arch-nemesis, the Mandarin, and said vile villain's origin, followed up by the first appearance of the long-loved Avenger, Hawkeye -- but he's not playing on the side of angels here. No, he's teamed-up with the Black Widow against ol' Iron Boots! And finally, Iron Man must test his mettle against no less than Captain America and his own Iron Man armor as the new Iron Man fights the old! It's a slam-bang barrage of Marvel classics with drama galore and a little '60s Russkie \"Red Scare\" that can't be beat. Reserve your copy today! Collecting TALES OF SUSPENSE #51-65.\r<br>240 PGS./ALL AGES ...$49.99\r<br>", "Black Widow: Homecoming (Trade Paperback)": "Acclaimed science-fiction novelist Richard K. Morgan (Altered Carbon and Broken Angels) and comics legend Bill Sienkiewicz (ELEKTRA: ASSASSIN, Stray Toasters) bring you old ghosts and new revelations about the original Black Widow - Natasha Romanova - in this hardboiled noir tale. The deadliest agent in the Marvel Universe has finally gotten out of the spy game, and she's not asking for much, just a life of her own. When a sudden assassination attempt provides a harsh reality check, the former Soviet agent tracks a string of international killings that will lead her back to a Russia she can barely recognize. Collects BLACK WIDOW #1-6.\r<br>144 PGS./Marvel PSR ...$14.99\r<br>", "Marvel Team-Up (2004) #6": "\"THE GOLDEN CHILD\"\r<br>The epic struggle over Paul Patterson has caught the eye of a certain one-eyed S.H.I.E.L.D. agent.  Luckily Captain America is on hand and is dispatched along with the Black Widow to deal with the problem--once and for all.  Meanwhile Titannus continues to set his master plan in motion and the stage is set for the next great Marvel Team-Up epic starting next month!  Part 6 (of 6).  \r<br>32 PGS./Marvel PSR ...$2.25", "Black Widow (2004) #6": "Hell hath no fury like the Black Widow. She's here, she's feared, and she's ready to take down those who want her dead. Still reeling from the discoveries about her Red Room past, Natasha must first uncover one more secret...and the only person who can help her is the one person who's betrayed her the most! Featuring an appearance by Nick Fury. The searing comics debut of Philip K. Dick Award-winning novelist Richard K. Morgan will leave you hungry for more!", "Black Widow (2004) #5": "Armed with the shocking revelations about her Red Room past, Natasha leaves Moscow and heads to the birthplace of the Black Widow program. Has the time finally come for her to meet her maker?", "Essential Peter Parker, the Spectacular Spider-Man Vol. (Trade Paperback)": "In 1976, backed by popular demand, Marvel launched PETER PARKER, THE SPECTACULAR SPIDER-MAN - an all-new action series starring your friendly neighborhood wall-crawler! In these inaugural issues, never before reprinted in one volume, Spidey faces some of his most fearsome foes - including Tarantula, Kraven, Lightmaster, Vulture, Hitman, Morbius, Brother Power, Hate Monger, Beetle and the Enforcers! Guest-starring the Fantastic Four, Inhumans and Champions! Collects PETER PARKER, THE SPECTACULAR SPIDER-MAN #1-31.", "Black Widow (2004) #4": "The Widow comes home to Moscow for the first time in ages -- and what she finds there ain't pretty. The Motherland has changed a lot in the years since Natasha left the KGB. Picking up the pieces of her lost past leads her straight back to the elite black-ops training academy known only as the Red Room..or what's left it. The secrets she discovers about her training there will shatter her past and send shockwaves deep into her future.", "Black Widow (2004) #3": "The intrigue continues as the spy who melted Siberia - Natasha Romanova - uses herself as bait to get vital info.  Meanwhile, her hunters in our nation's capital track her down, meaning - you guessed it - a guest appearance by Nick Fury!  Join mega-watt stars Richard K. Morgan & Bill Sienkiewicz (and cover artist Greg Land) as they heat up Marvel's hardboiled redhead this November!", "Daredevil Vol. 10: The Widow (Trade Paperback)": "You asked for it; you got it: Daredevil's fiery, redheaded ex-partner returns to Hell's Kitchen to help the new Kingpin keep the streets clean. But why is she really back? One of Marvel's greatest love stories takes an interesting turn, and all in the horrible face of...JIGSAW! Guest-starring Nick Fury and the Avengers! Collecting DAREDEVIL #61-66 - plus the very first meeting of Daredevil and the Black Widow, from 1971's DAREDEVIL #81!", "Marvel Masterworks: The Avengers Vol. 4 (Hardcover)": "Avengers Assemble! Earth's Mightiest Heroes join the mighty Marvel Masterworks line with another top-notch volume of Silver Age classics! Hold on tight to your Avengers membership card as Captain America, Goliath, the Wasp and Hawkeye battle the villainous Sons of the Serpent, the Living Laser, Ultrana and no less than the scheming Sub-Mariner himself! Featuring guest appearances by Iron Man, Black Widow, Hercules, the Scarlet Witch and Quicksilver, this one's a packed-to-the-gills thriller! Reserve your copy today, True Believer! Collects AVENGERS (Vol. 1) #31-40.", "Black Widow (2004) #2": "PART 2 (OF 6) No matter what she does to get out of the spy game, Natasha's past keeps catching up with her. With the help of a retired agent from her old S.H.I.E.L.D. days, the Black Widow investigates the murder of a woman and makes a startling discover", "Daredevil (1998) #64": "THE WIDOW PART 4 Who is behind the assassination attempts against the Widow?", "Ultimate Nightmare (2004) #2": "ULTIMATE NIGHTMARE PART 2 In Tunguska, Russia, teams led by Charles Xavier and Nick Fury appear in an area rife with mutations and far, far more. Neither team is aware of the other's existence, but something very bizarre is about to occur.", "Daredevil (1998) #63": "THE WIDOW PART 3 With the Black Widow back in Matt Murdock's life, Daredevil finds he now has two targets on his head. And a brutal new enemy called Quinn.", "Avengers Assemble (Hardcover)": "\"The Avengers embark on one of their strongest eras ever! Kurt Busiek and George Pérez have renovated the comic-book field with such works as Astro City and New Teen Titans, respectively; now, see their take on Earth's Mightiest Heroes. Fresh from the Heroes Reborn fiasco, the Avengers find themselves thrown into yet another alternate reality, under the power of Morgan Le Fay! Meanwhile, on the home front, the Squadron Supreme challenges their very identities! Collects AVENGERS #1-11 and ANNUAL '98.\"", "Daredevil (1998) #61": "THE WIDOW PART 1 Daredevil's fiery, redheaded ex-partner returns to Hell's Kitchen to help the new Kingpin keep the streets clean. But why is she really back? Guest-starring Nick Fury and the Avengers!", "Marvel Masterworks: The Silver Surfer Vol. 2 (Hardcover)": "In 1940, as America prepared for war, a frail young man volunteered for an experiment that transformed him into the premiere physical specimen - the American Super Soldier! Steve Rogers then battled the Nazis until a freak mishap placed him in suspended animation for decades. When he awakened, Rogers was truly a man out of time; though no less committed to fighting the evils of this perilous new era! The Silver-Age revival of America's greatest superhero is chronicled here, including the origin of Captain America and Bucky! The Assassins of Zemo! And the Red Skull strikes! Collects TALES OF SUSPENSE #59-81", "Marvel Masterworks: Captain America Vol. 1 - 2nd Edition (Hardcover)": "In 1940, as America prepared for war, a frail young man volunteered for an experiment that transformed him into the premiere physical specimen - the American Super Soldier! Steve Rogers then battled the Nazis until a freak mishap placed him in suspended animation for decades. When he awakened, Rogers was truly a man out of time; though no less committed to fighting the evils of this perilous new era! The Silver-Age revival of America's greatest superhero is chronicled here, including the origin of Captain America and Bucky! The Assassins of Zemo! And the Red Skull strikes! Collects TALES OF SUSPENSE #59-81", "Avengers Legends Vol. 2: The Korvac Saga (Trade Paperback)": "Hailing from the unimaginable era the 31st century, Korvac the Machine Man flees through the timestream, pursued by the futuristic defenders the Guardians of the Galaxy. Establishing a secret presence on present-day Earth in the persona of the mysterious unassuming Michael, Korvac contemplates the elements of a universe he thirsts to command. Yet despite the subtlety of his machinations, the mighty Avengers discover his cosmos-conquering scheme, drawing the two titanic forces into inevitable conflict.\r\nCollecting AVENGERS (Vol.1) #167, 168, 170-177.", "Avengers: The Kang Dynasty (Trade Paperback)": "When duty calls, the legendary Avengers answer' but Kang is a foe unlike any other; his ultimate goal is nothing short of global domination, to impose his will over all.", "Marvel Knights (2002) #6": "This is it! When Mr. Tune decides to stay behind to finish his masterpiece of evil, it's up to Punisher to shut the madman down! Will the Brothers Grace fall by the end of this issue?", "Marvel Knights (2002) #5": "Without the money to pay off Kingpin's former associates, the Brothers Grace decide to bail out on New York -- but the Marvel Knights won't let them get away that easily!", "Marvel Knights (2002) #4": "The Knights take to the high seas in a daring move to bring down the criminal empire of the plastic surgery-addicted European multi-billionaires known as the Brothers Grace! But, like cornered rats, the Brothers Grace become even more vicious when attacked -- and that is very, very vicious indeed!", "Marvel Knights (2002) #3": "New York's criminal enterprises have been consolidated under the control of the Brothers Grace, two plastic surgery-addicted European multi-billionaires whose corruption now reaches into the highest levels of city government! Realizing that conventional crime-fighting methods will no longer work, the Marvel Knights begin training for a very unconventional assault on the root of the Grace Brothers' evil -- but first they'll have to fend off an attack by the Graces' private army.", "Daredevil (1998) #33": "Foggy and Matt try to figure out what to do now that Matt's other life has been exposed to the world.", "Marvel Knights (2002) #2": "The Brothers Grace, multi-billionaire European businessmen addicted to plastic surgery, continue their campaign to build a new criminal empire in New York City! Extortion, drug-dealing and murder are the order of the day, and even the best efforts of DD and the Black Widow aren't enough to stop the mayhem in the streets! When an exhausted Punisher lets down his guard, he's captured by Mr. Tune, the evil captain of the Graces' shock troops. But in the end, it will prove to be a fatal mistake... for someone!", "Marvel Knights (2002) #1": "The Brothers Grace, multi-billionaire European businessmen who happen to be addicted to plastic surgery, are moving into the vacuum left by the Kingpin's absence. Under the direction of their evil majordomo, Mr. Tune, the Brothers' personal army begins their absorption of every criminal enterprise in the city! North Korean police detective, (and S.H.I.E.L.D. undercover agent), Sgt. Helen Kim has been assigned to assist Black Widow, but will her personal vendetta against the Brothers get in the way of our urban avengers? Desecration, animal sacrifice, plastic surgery, and European independent filmmaking? Yep, MARVEL KNIGHTS has it all!", "Iron Man (1998) #50": "Tony Stark used to create and sell arms. Now those same weapons are being used to kill innocent lives. Can he, as Iron Man, do anything about his past events?!", "Marvel Knights (2000) #15": "Black Widow and Dagger battle an army of death-dealing robots across the S.H.I.E.L.D. Helicarrier, all under the command of the rogue AI known as CELINE! Meanwhile, Punisher is determined to settle accounts with Daredevil and forces the frightened Vermin to lead him to the hero!", "Marvel Knights (2000) #14": "Shang-Chi, master of kung-fu, is a hero - but his father is pure evil! And when his dear daddy launches a major assault on the Knights, one member calls it quits! But who leaves: Daredevil, Moon Knight, Luke Cage...or Shang-Chi himself? Meanwhile, there's something rotten at the heart of S.H.I.E.L.D. - and Dagger and Black Widow are determined to find out what it is!", "Black Widow Vol. I (Trade Paperback)": "Yelena Belova, a young yet dangerous assassin, seeks to claim the mantle of Black Widow from Natasha Romanov, a former Soviet spy who defected to the West.", "Marvel Knights (2000) #13": "Shang-Chi's evil father sees his son as his biggest threat, and he wants Shang-Chi dead! As Shang-Chi and his allies Luke Cage, Daredevil and Moon Knight fight the deadly Zaran the Weapons Master and his cult of assassins, Black Widow and Dagger fend off a robot double of Nick Fury determined to kill them! And what's going on with Dagger's powers?", "Marvel Knights (2000) #12": "Daredevil, Moon Knight, Black Widow, Shang-Chi, Dagger and Luke Cage confront a convicted war criminal - but he's got a trio of super-villains defending him...and they may be too much even for the Marvel Knights. Plus: Shang-Chi's father strikes!", "Marvel Knights (2000) #11": "The Marvel Knights welcome their newest member: Luke Cage, Power Man. But why will this latest addition cause conflict within the group? And what awaits Cage on his first mission?", "Marvel Knights (2000) #10": "Ride along with the Punisher as he makes an unexpected detour -- to the slammer. Will Frank Castle pay for his crimes? Or will he use his \"get out of jail free\" card?", "Daredevil (1998) #15": "Daredevil's identity is finally revealed to Echo as well as the truth about her father. Her new target: Wilson Fisk!", "Black Widow (2001) #3": "Natasha comes face-to-face with herself. Disguised as Natasha, Yelena Belova takes on the original Black Widow in a face-off of ultimate espionage. Who will prove to be a better Natasha Romanoff? \n", "Daredevil (1998) #14": "It's Round Two for Echo and Daredevil. Will Echo reign supreme or will DD get the best of her? Meanwhile, Foggy Nelson is getting along swimmingly without Kingpin mucking things up for him.", "Marvel Knights (2000) #9": "Get ready for the fight you thought you'd never see: Cloak vs. Dagger! And as the battle between former partners rages on in our world, the Marvel Knights must escape from Cloak's dimension of darkness.", "Black Widow (2001) #2": "Natasha Romanoff begins her mission as Yelena Belova. She quickly discovers that her true identity may be under fire sooner than she thinks as she comes face-to-face with the real Yelena Belova, disguised as Natasha!\n", "Marvel Knights (2000) #8": "Daredevil, Black Widow and Moon Knight have been sucked into the demented darkness that is Cloak. Can Dr. Strange and Shang Chi rescue their missing teammates? And will Dagger bring herself to fight against her former partner?", "Black Widow (2001) #1": "As an attempt to fool the enemy, Natasha Romanoff undergoes a procedure to look like her nemesis Yelena Belova. Unbeknownst to the Black Widow, Yelena seems to have a similar trick up her sleeve. \n", "Marvel Knights (2000) #7": "Has Cloak gone bad? That question is answered as the Marvel Knights and special guest star Dr. Strange finally confront Dagger's former partner. Will Cloak revert back to form or will he turn out the lights on the Knights?", "Marvel Knights (2000) #6": "Chang Chi battles his evil father's personal assasin.  And surprise guest stars - the Fantastic Four!", "Avengers (1998) #34": "Count Nefaria threatens to turn the world's population into his own demented puppets with the power of an ionic energy bomb!", "Marvel Knights (2000) #5": "The Punisher continues his one-man war of crime but he might have to set his sights on the Marvel Knights next!  Plus, Chang Chi's father sets a deadly trap for his son.", "Avengers (1998) #33": "The Avengers must stop Count Nefaria from attacking Madame Masque. But are they too late?", "Marvel Knights (2000) #4": "The Marvel Knights have their next opponent and its...the Punisher?  Plus: enter Moon Knight - the latest Marvel Knight!", "Avengers (1998) #32": "It's a battle royale of unbelievable proportions as the Avengers, the Grim Reaper, Count Nefaria, and Madame Masque all throw down!", "Marvel Knights (2000) #3": "Punisher one-on-one with Ulik the Troll! Can Daredevil accomplish his mission in time to save Franks Castle or will be a casualtly of the Marvel Knights first mission?", "Marvel Knights (2000) #2": "One of Thor's oldest enemies, Ulik the Troll, is stomping around Earth and it comes down to Punisher, Daredevil and the other Marvel Knights to stop his plan to destroy Asgard.", "Marvel Knights (2000) #1": "Punisher. Daredevil. Black Widow.  Dagger.  Shang Chi.  This team of Marvel Knights stop threats both small and large.  But what happens when they encounter a threat that has battled the Avengers to standstill before?  All-out action from your favorite cult Marvel heroes!", "Avengers (1998) #27": "There's a new Avengers lineup, but not everyone is happy about it! What's really going on behind the scenes?", "Earth X (1999) #12": "The new Galactus has arrived...to save Earth X?", "Earth X (1999) #10": "Black Bolt is Earth X's only hope as Cap's final battle with the Red Skull begins!", "Daredevil (1998) #9": "Nelson & Murdock Law Firm is still under construction but that doesn't mean there aren't any clients for Foggy and Matt. They've taken on the case of a police informant working from within Kingpin's organization and Kingpin isn't too happy about that!", "Earth X (1999) #9": "A terrifying truth behind the genesis of Earth X is revealed as its end nears.  Who can stop its destruction?", "Daredevil Visionaries: Kevin Smith (Daredevil Vol. I: Guardian Devil) (Trade Paperback)": "Daredevil's notion of faith is tested when a mysterious baby winds up on his doorstep. Following the death of his longtime lover, Daredevil must find the strength to continue.", "Daredevil Vol. II: Parts of a Hole (Trade Paperback)": "Maya Lopez' deaf, but capable of assimilating an individual's fighting style on sight' has set her sights on Daredevil, who she believes to be responsible for her father's death.", "Earth X (1999) #8": "Red Skull confronts President Osborn as Colossus joins Cap's crew.", "Black Widow (1999) #3": "The Black Widow is dead. Yelena takes up arms against General Khan and gets into more trouble then she bargained for. With little hope, where will Yelena turn to as she squares off against Deathless Frenzy?\n", "Black Widow (1999) #2": "After Yelena fails to execute Black Widow, Natasha makes her way to assassinate Dr. Didier Ines, and the bio-weapon, Deathless Frenzy. With Yelena hot on her trail, Black Widow's morals are put to the test. Will she betray her mission or herself?\n", "Black Widow (1999) #1": "Natasha Romanoff has been assigned to track a new bio weapon created by Dr. Didier Ines. With Yelena Belova, the soon-to-be new Black Widow, shadowing Natasha, the pair may be in for more trouble than they realize.", "Daredevil (1998) #8": "Matt attends the funeral of Karen Page. Foggy's name is cleared and he's released from prison. And the fate of the mysterious child is revealed... Featuring, Spider-Man!", "Daredevil (1998) #7": "The showdown between Daredevil and the man behind Karen's death, the appearance of the Messiah baby, and all that has befallen Matt Murdock is here! Two shall fight...one shall live.", "Wolverine (1988) #134": "WOLVERINE VS. THE MARVEL UNIVERSE! Featuring too many guest stars to name!\n", "Daredevil (1998) #4": "Matt Murdock's mother reveals herself to her son! Can this rendezvous help to clear Matt's head or will it just stir things up again? Plus, Bullseye has been hired to retrieve the child!", "Daredevil (1998) #2": "As Matt begins to investigate his recent forced adoption of the so-called Messiah, new evidence comes to light. The child Matt has been made caretaker of is not the Messiah, but rather the Anti-Christ! Plus, Karen Page returns.", "Avengers (1998) #4": "The Avengers have emerged victorious from their last battle. Now it is time to form the new roster for the superhero team. Who will be chosen? Who will be left out?", "Daredevil (1964) #375": "Karen Page is on trial for the death of a police officer! Mr. Fear is working against her testimony, doing all he can to put Karen behind bars. Can Daredevil cope with the imprisonment of his love? Will Attorney Matt Murdock rise to Karen's defense?", "Avengers (1998) #3": "Captain America must train his newly-freed friends to act in an Iron Man-lead attack on Morgan. But when the heroes are forced to battle their ensorcelled teammates, will they be willing to see this battle to the end?", "Avengers (1998) #2": "The Avengers are trapped in strange medieval reality in which they are the playthings of Morgan. But Captain America and Hawkeye have broken the witch's spell and must free their teammates. Meanwhile, Wonder Man is summoned!", "Avengers (1998) #1": "The Avengers are reunited! As the founding members come together to discuss the recent wave of attacks on former teammates, Thor interrupts the proceedings with grave news: Asgard is in ruins, the Twilight Sword has been taken...doom awaits Midgard!", "Daredevil (1964) #371": "While Matt recovers from his wounds, Karen blows off steam, (and spite), with a shopping spree on Matt’s credit card. Daredevil meets up with Black Widow to discuss the kiss they shared. Is DD’s love with Karen in jeopardy? Has he at long last been caught in Widow’s web?", "Daredevil (1964) #370": "Held captive by the Russians, Daredevil and Black Widow set aside their differences and align themselves to escape! Once freed from their bonds, the heroes try to take down the Russian Mafia. Daredevil recruits two Soviet allies.", "Thunderbolts (1997) #9": "Black Widow offers advice to Songbird and MACH-1 by telling them a tale of the first replacement Avengers.", "Daredevil (1964) #368": "Daredevil finds himself at the mercy of Omega Red! Only the villain has no mercy to give. Just as Omega Red is about to kill Daredevil, a third player enters the game; Black Widow saves Daredevil’s life with not a moment to spare. But whose side is Natasha on?", "Daredevil (1964) #361": "Molten Man looks for help while Daredevil reunites with Black Widow!", "Force Works (1994) #19": "Hawkeye reaches out to Black Widow, U.S. Agent and War Machine to help them track down Iron Man and stop Kang.", "Uncanny X-Men (1963) #307": "Beast, Xavier and USAgent defend themselves against the Genoshan Magistrates. Meanwhile, Sersi and Exodus battle it out while Quicksilver and Jean Grey look for a way into Genosha's capitol to save Luna from Cortez's clutches.", "X-Men (1991) #26": "Working against the clock, the X-Men fly to Genosha to help Xavier. During the journey Colossus must make a difficult decision concerning where his loyalties lie. Meanwhile, Xavier and Beast must bide their time by fighting against new enemies.", "Punisher/Black Widow: Spinning Doomsday's Web (1992) #1": "Frank Castle, the scourge of the underworld known as the Punisher, must team-up with super-spy the Black Widow to stop a madman from unleashing Armageddon on the world.", "Punisher War Journal (1988) #9": "Black Widow guest-stars to spin her own web of intrigue with Punisher!\n", "Solo Avengers (1987) #16": "It's been a long time since Hawkeye and the Black Widow fought as a team. But now, it looks like they may die together unless they can find a way to thwart the plans of A.I.M.! Also featuring a story starring Galactic Avenger, Moondragon!", "Solo Avengers (1987) #15": "Hawkeye has been reunited with his old partner, the Black Widow. And it's a good thing! The avenging archer is going to need all the help he can get when he faces the hordes of A.I.M.!", "Solo Avengers (1987) #14": "When the Black Widow finds herself about to be snuffed by A.I.M., it's Hawkeye to the rescue!", "Marvel Team-Up (1972) #141": "Spider-Man is missing! What has happened to the spectacular one? Regardless, Daredevil and the Black Widow must keep working on the pawnbroker murder case in order to prevent an innocent man from going up the river! ", "Marvel Fanfare (1982) #13": "First, Natasha employs all the spy decoys she can against Snapdragon in \"The Widow...Alone\"! Then, Fandral, Volstagg and Hogun contribute to the mythic lore of Asgard in \"Ballad of the Warriors Three\"!", "Marvel Fanfare (1982) #12": "The Web Tightens for Black Widow as Iron Maiden swings into deadly action! Digital issue omits \"Marvel Fanfare\" story.", "Marvel Fanfare (1982) #11": "Black Widow is back on her home turf to track a missing comrade! Digital issue omits \"Kaa's Hunting\", published in Marvel Illustrated: Jungle Book (2007) #1.", "Marvel Fanfare (1982) #10": "The Black Widow spins a web of intrigue in a four-part epic! Natasha must locate her companion Ivan, and turns to S.H.I.E.L.D. for an alliance. Digital issue omits \"How Fear Came\", published in Marvel Illustrated: Jungle Book (2007) #1.", "Marvel Team-Up (1972) #85": "Shang-Chi joins the fray alongside Spider-Man, Nick Fury and Black Widow! The Silver Samurai doesn't stand a chance!", "Peter Parker, the Spectacular Spider-Man (1976) #18": "Spider-Man's putting Bobby Drake on ice! Iceman attacks Angel and Spidey when Stuart Clarke is incapacitated. Will Spidey be able to cool down his friend? And more importantly, will Peter get his story for the Daily Bugle?", "Peter Parker, the Spectacular Spider-Man (1976) #17": "Peter travels to Los Angeles to investigate the collapse of the Champions, L.A.'s own super hero team. But will former member Angel be forthcoming with answers? Plus, Rampage on the streets!", "Daredevil (1964) #124": "Foggy is having some trouble with politics, facing re-election for District Attorney. Lucky for him, Murdock may have something up his sleeves…", "Marvel Two-in-One (1974) #10": "As the Widow tries to escape from the Sword of Judgment, both she and the Thing are captured and are taken to a platform that is floating on the ocean!", "Daredevil (1964) #123": "Daredevil has been defeated, but never count him for being down and out. Foggy Nelson needs him!", "Daredevil (1964) #122": "Daredevil, The Man Without Fear, finds himself soaring above the skies outmatched by none-other-than Blackwing of Hydra!", "Daredevil (1964) #120": "Matt Murdock quickly has to spring into action as Daredevil when a group of terrorists take to an airport fully strapped!", "Daredevil (1964) #116": "After a cryptic phone call from Natasha, Daredevil travels to San Francisco and finds her missing from her mansion!", "Daredevil (1964) #115": "Daredevil returns to New York to rescue Foggy and Candace, and once again finds himself facing Death-Stalker!", "Daredevil (1964) #104": "Kraven the Hunter’s been hired to stalk out and eliminate Daredevil. But who put out the hit? Black Widow may pay the ultimate price for her involvement with Ol’ Hornhead…but not if Matt Murdock can help it!", "Daredevil (1964) #101": "Black Widow’s back! And just in time too- Daredevil and Widow must take out Angar the Screamer before he drives all of San Francisco mad! But when Widow falls under the Screamer’s spell, will DD lose his comrade in arms?", "Daredevil (1964) #99": "Daredevil and Black Widow are greeted by Hawkeye upon their return from battling the Dark Messiah. This time, Clint Barton won't leave San Francisco until Natasha agrees to rekindle their romance.", "Daredevil (1964) #98": "The Man Without Fear and the Black Widow finally tackle the so-called Dark Messiah- while a city quakes beneath their very feet!", "Daredevil (1964) #97": "Rise of the Dark Messiah! When Daredevil saved a street performer from an attack, he never anticipated that the young man would become his greatest adversary. And with Black Widow out of commission, Daredevil must face Dark Messiah solo!", "Daredevil (1964) #96": "While Black Widow takes Daredevil to a hospital to treat his gunshot wound, Man-Bull tampers with the water supply of San Francisco! He adds an ingredient- the same serum that’s transformed him into a Man-Bull! Widow tries to save the day, but fails. Is the entire city doomed?", "Daredevil (1964) #95": "Hell-bent on exacting revenge, Man-Bull charges to San Francisco! The Bull and Daredevil paw the ground, lower their horns, and buck heads!", "Daredevil (1964) #94": "The Indestructible Man’s tearing through San Francisco and nothing can stop him! It’s up to Daredevil and Black Widow to try, but how do you defeat the Indestructible Man?", "Daredevil (1964) #93": "Haunted by a nightmare of nuclear holocaust, and given the location of the Project Four sphere, Damon Dran suits up and becomes…the Indestructible Man! Elsewhere, Black Widow is under some kind of mystic control and turns on Daredevil. The couple duke it out, but can Daredevil subdue his romantic partner without causing her harm?", "Daredevil (1964) #92": "Black Widow has left Daredevil without a word and our horned hero is furious about it! DD prowls the streets of San Fran looking for clues to Black Widow’s whereabouts. Little does he know, Widow’s been captured by Damon Dran, and is being prepped for torture!", "Daredevil (1964) #91": "He's back from the dead! Mr. Fear, the only man who knows Daredevil’s true identity. Matt Murdock better watch his back.", "Daredevil (1964) #90": "The mysteries of Project Four! But, what happens when the Man Without Fear becomes…a coward? Cold fear seizes Black Widow- but why?", "Daredevil (1964) #89": "Death in the wind-lashed sky! Electro and Killgrave gang up against the Man Without Fear! Plus, will the Widow accept Daredevil’s help when the chips are down?", "Daredevil (1964) #88": "Killgrave, the Purple Man, is back, and DD may never be the same again. That is, if he lives! Plus, Black Widow's secret past.", "Daredevil (1964) #87": "DD and the Widow hit San Francisco! And nobody's minding the welcome wagon…all but Electro! A titanic turning-point issue for Natasha and Matt.", "Daredevil (1964) #86": "Remember the ominous Ox? Well, he's back, and so is the breathtaking Black Widow! But they'd both better hurry; DD's leaving New York!", "Daredevil (1964) #85": "Mile-high madness, as the Man Without Fear battles the power-packed Gladiator...in the deadly skies!", "Avengers (1963) #64": "Adversaries for years, the Falcon and Henry Gyrich are on the verge of fighting it out! What role will the sinister Scarecrow play in the unfolding drama?", "Avengers (1963) #63": "The Avengers must make an emergency landing over the Arctic after the Panther’s ship malfunctions. Meanwhile, Hank Pym confesses to the team that he is struggling with his schizophrenic personality, Yellowjacket.", "Avengers (1963) #30": "Goliath sets off to South America to find a cure for Quicksilver and the Scarlet Witch's dwindling powers, while the other Avengers take on the Black Widow and her unit once again. This time, Hawkeye wants to take them down all by himself!", "Tales of Suspense (1959) #55": "Will Tony Stark be able to free himself from the clutches of his most malevolent foe â€\" or can no one, not even Iron Man, escape the Mandarin? Plus: insight on the new MK III armor!\n"}