{"Marvel 2-in-One (2017) #12": " Our heroes were betrayed and left for dead, but now that the FANTASTIC FOUR are back, where’s RACHNA KOUL? The HUMAN TORCH and INVISIBLE WOMAN will soon find out, provided they can get past THE MOLE MAN! ", "Fantastic Four (2014) #7": "ORIGINAL SIN: THE FATEFUL FOUR PART II\nThe FANTASTIC FOUR are being torn apart at their very foundation!\nWill Ben be able to cope with the Original Sin he&#39;s learned about Johnny?\nWill Sue and Reed lose FRANKLIN and the rest of the FUTURE FOUNDATION?\nWill what&#39;s left of the team be able stop their headquarters from being shut down by&hellip;THE AVENGERS?", "Fantastic Four (2014) #6": "EVERYBODY HAS ONE...", "Fantastic Four (2014) #5": "\"THE FALL OF THE FANTASTIC FOUR\" PART 5 - Super-Sized issue!\n- The Baxter Building is quarantined and shut down!\n- The Fantastic Four held accountable for the destruction in Manhattan!\n- A major turning point for the team and a dire blow to the family!\n- The trial of the century featuring an all-star roster of guest artists!", "Fantastic Four (2014) #4": "\"THE FALL OF THE FANTASTIC FOUR\" PART 4\n- FLAME OFF!!! JOHNNY STORM has lost his powers! - The HUMAN TORCH is no more!!!\n- With one member down, a new threat emerges -- the WRECKING CREW...with powers mysteriously elevated to A-level destruction as they team-up with the WIZARD to be a new, devastating version of the FRIGHTFUL FOUR!\n- And as BEN and ALICIA'S romance rekindles, so looms the PUPPET MASTER with dark plans for both of them.\n- All this and the return of FF members ANT MAN, MS. THING and SHE-HULK.", "Fantastic Four (2014) #3": "\"THE FALL OF THE FANTASTIC FOUR\" PART 3\n- The FANTASTIC FOUR were victorious defending Manhattan from inter-dimensional invasion but at a terrible cost!!!\n- Is this \"Flame Off\" forever for the HUMAN TORCH?\n- Introducing a new stronger, deadlier version of the WRECKING CREW!!!", "Fantastic Four (2014) #2": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 2\n\n\n\n\n\n<ul><li>Manhattan is under attack by a monstrous killer swarm from a corrupted pocket universe, and in order to defeat it the FANTASTIC FOUR will need all their courage, powers and skill...as well as those of every other hero in New York!</li><li>But to attain final victory one of the First Family will must make a TERRIBLE SACRIFICE!</li><li>And so the first strings are pulled and the first pieces are put in place...</li><li>...On the Fantastic Four&#39;s DOWNFALL!</li></ul>", "Fantastic Four (2014) #1": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 1\nThe world&#39;s greatest comics magazine begins anew with Marvel&#39;s First Family, the Fantastic Four! But as the brilliant MR. FANTASTIC, the compassionate INVISIBLE WOMAN, the ever lovin&#39; THING &amp; the hot-headed HUMAN TORCH embark on a strange mission, they aren&#39;t met with new beginnings, but an untimely end! As the family of cosmic explorers head towards their darkest hour, who could possibly be behind their downfall? And how is one of their oldest enemies, the sadistic dragon known as Fing-Fang-Foom involved? Prepare for the fantastic!", "FF (2010) #22": "* Concluding the crossover with FF #610, witness the fallout of Bentley 23&rsquo;s reunion with his father, the Wizard. It&rsquo;s Bad Father, Worse Son.", "FF (2010) #21": "In a move that surprises everyone, Black Bolt and the Inhumans return to Earth. What does this mean for Marvel's first family?", "FF (2010) #20": "<ul><li> A closer look at the Universal Inhuman supergroup. \n</li><li> See what happens when they are called home to Attilan. \n</li><li> Witness the shocking events of what happened when\nBlack Bolt caught the new Supreme Intelligence.</li></ul>", "Fantastic Four (1998) #604": "The epic conclusion of Jonathan Hickman's three year Fantastic Four epic!", "Ff by Jonathan Hickman (Hardcover)": "The War of Four Cities escalates as Black Bolt returns, determined to reclaim his throne. And as the war expands\r\nto encompass the entire Marvel Universe, the Future Foundation is caught in the middle! What does it all mean for\r\nMarvel's First Family? Collecting FF #6-11.", "Fantastic Four (1998) #601": "\"Forever\" Part 2 Finally, It's Clobberin' Time.", "FF (2010) #12": "The beginning of a 4-part arc that runs parallel with FOREVER in the Fantastic Four. We've teased it for years, now find out exactly how Doctor Doom and the Future Foundation will save us all.", "FF (2010) #11": "A galactic empire is born as the War of Four Cities comes to a close. What does it mean for Marvel's First Family?", "Fear Itself: The Fearless (2011) #1": "When Fear Itself is over, the hunt is on! Mystical hammers lay strewn across the entire Marvel Universe and it is Valkyrie's mission to find them, no matter what the cost, and no matter who stands in her way...even if it's Captain America & the Avengers!", "FF (2010) #10": "Ben Grimm returns as Ronan the Accuser and the armies of the Kree Empire invade the Earth!\n", "X-Men (2010) #19": "Dr. Doom has betrayed our heroes and sold them out to the evil leaders of the Scorpius people. The only one who can save them all is... Magneto? The two greatest villains of the Marvel U face off in the climactic conclusion to the dimension spanning story!", "Fantastic Four: Season One (2012) #1": "In Manhattan's most famous skyscraper, the Baxter Building, scientific genius Reed Richards hatches a plan that will change the lives of those he loves most - and the very course of human history - in a way no one could have ever imagined. Revisit the story that irrevocably altered comics and pop culture in this all-new graphic novel, modernizing the journey of Reed Richards, Susan Storm, Johnny Storm and Ben Grimm as they travel to the stars - and return with fantastic, devastating results! Plus: Witness the FF's cataclysmic first battles with the Mole Man, Dr. Doom and Prince Namor, the mysterious Sub-Mariner, in a way you've never seen before. You only think you know the story! Also features FANTASTIC FOUR #570 by Jonathan Hickman and Dale Eaglesham.\n136 PGS./Rated T+ ...$24.99", "X-Men (2010) #19 (Mc 50th Anniversary Variant)": "\"Betrayal in the Bermuda Triangle\" GUEST-STARRING THE FF! Dr. Doom has betrayed our heroes and sold them out to the evil leaders of the Scorpius people. You know these villains are serious because they took down the X-Men and the FF! The only one who can save them all is... Magneto? The two greatest villains of the Marvel U face off in the climactic conclusion to the dimension spanning story! Part 4 (of 4)", "FF (2010) #9": "The Future Foundation is caught in the middle of the War of Four Cities. Watch as the war expands to encompass the entire Marvel Universe!", "FF (2010) #8": "The War of Four Cities escalates and we learn what Marvel's First Family fears most!", "FF (2010) #7": "At what ends will Black Bolt go to in order to become king of the Inhumans once again? And will the prophecies of the War of Four Cities come to pass?", "Amazing Spider-Man (1999) #666": "THE SPIDER-MAN STORY OF THE DECADE BEGINS WITH THS \"SPIDER-ISLAND: PRELUDE\"! Super-star writer Dan Slott and fan-favorite Spidey artist Stefano Caselli are back! New York has been INFESTED and the web grows as it gets ready to explode into SPIDER-ISLAND!  Normal people are getting Spider-Powers!  But not all of them realize that with great power must also come ....you know the rest. Okay, sure we often say Peter Parker's life will never be the same. But listen, pal, we've never been more serious. Heroes and villains are crawling all over Manahttan and no one knows why. This will change everything for Pete, for Spidey...and possibly for YOU! Look at it this way...If EVERYONE'S a Spider-Man then no one is.", "Fear Itself: FF (2011) #1": "FEAR ITSELF TIE-IN! XXXX XXXXX...one of the most beloved heroes in the Marvel Universe...is now the willing avatar of the Serpent's malice--an engine of discord cutting an unstoppable path of destruction through the heart of New York City! How did the Serpent's Hammer seduce him so easily? Can the rest of the XXXXXXX stop him before he levels the entire city in the name of his dark master?", "Amazing Spider-Man (1999) #665 (AMAZING SPIDER-MAN 665 I AM CAPTAIN AMERICA VARIANT)": "\"INFESTED\" ENDS WITH SPIDEY AT THE \"CROSSROADS\"! As Spider-Man, he's a member of the FF and TWO different Avengers teams.  As Peter Parker, he works all hours on his dream job at Horizon Labs.  That doesn't leave him with much time for anything or anyone else.  This is where he pays the price. In this landmark issue, one of Peter's greatest sins-- comes back to haunt him. And the life of someone dear to him hangs in the balance. Plus: With New York's Infestation complete, the run-up to Spider-Island is over. Prepare for hell to break loose.", "FF (2010) #6": "The return of the king! Black Bolt is back and determined to reclaim his throne.", "Amazing Spider-Man (1999) #665": "\"INFESTED\" ENDS WITH SPIDEY AT THE \"CROSSROADS\"! As Spider-Man, he's a member of the FF and TWO different Avengers teams.  As Peter Parker, he works all hours on his dream job at Horizon Labs.  That doesn't leave him with much time for anything or anyone else.  This is where he pays the price. In this landmark issue, one of Peter's greatest sins-- comes back to haunt him. And the life of someone dear to him hangs in the balance. Plus: With New York's Infestation complete, the run-up to Spider-Island is over. Prepare for hell to break loose.", "FF (2010) #5": "As the War of Four Cities heats up, the Universal Inhumans enter the fray! What role will the FF play in things to come?", "Fantastic Four: The Last Stand (2011) #1": "Collecting FANTASTIC FOUR #574 and #587-588", "Amazing Spider-Man (1999) #659 (2nd Printing Variant)": "Spider-Man joins the Future Foundation for a fantastic new adventure!", "Amazing Spider-Man (1999) #663": "\"The Ghost of Jean DeWolff\" ANTI-VENOM returns to help SPIDER-MAN wage war against MISTER NEGATIVE and his criminal empire... whether Spidey wants him to or not. And when an all-new WRAITH enters the fray, will she prove to be a friend or foe?  Plus: From the pages of SECRET AVENGERS, a special guest appearance by SHANG-CHI, The Master of Kung Fu! PLUS: \"Infested\" continues in...the lead-in to SPIDER-ISLAND.", "FF (2010) #4": "In order to prevent the war from spreading outwards to all areas of the globe, the FF spring into action to stem the tide of death and destruction. What chance does anyone have when all hope lies in Doom?!", "Amazing Spider-Man (1999) #661": "After his work with the new FF wraps for the week, what can the original teenaged super hero teach the world's most at-risk group of super-powered teens? Find out when Spider-Man substitutes at the Avengers Academy!", "Silver Surfer (2010) #4": "High Evolutionary's grand design is rewriting the world and Surfer can't save us on his own. The Future Foundation joins the fight as our penultimate issue builds to a cosmic climax that will be the Silver Surfer's greatest sacrifice ever!", "Amazing Spider-Man (1999) #661 (X-Men Art Variant)": "GUEST STARRING AVENGERS ACADEMY! After his work with the new FF wraps for the week, what can the original teenaged superhero teach the worlds most at risk group of super-powered teens?  Find out when Spider-Man substitutes at the Avengers Academy!  But it's far from a normal day at school when a field trip is interrupted by a vengeful PSYCHO-MAN armed with hate, doubt and fear! Guest starring the FF, Giant-Man.... and the Malevolent Marvel Monster Mayhem of  MONSTEROSO! Plus a \"Day in the Life of Spider-Man\" by Paul Benjamin and Javier Pulido!", "Amazing Spider-Man (1999) #660": "It's the Sinister Six versus The Future Foundation! But what happens when the world's deadliest super-villains take on the entire FF, including the kids?", "FF (2010) #3": "What has become of the surviving members of the Council of Reeds, loosed upon our world by Valeria? That's what Reed Richards and the new FF must now discover!Â ", "FF (2010) #2": "Doctor Doom: Tyrant. Madman. Evil genius. Member of The FF?", "Age of X: Universe (2011) #2": "The Avengers have been ordered to find Magneto and his army of fugitive mutants. But when the team is given a license to kill, not every member is up to the task. Who will kill and who will be killed?", "Amazing Spider-Man (1999) #659": "To the end of the universe! To the future and back! Up and down the Microverse! And France! These are the varied destinations on the FF's itinerary. Can Spidey handle the harrowing, universe-spanning antics of the FF?", "Amazing Spider-Man (1999) #658": "Johnny Storm has fallen. Who shall take his place? Why, it's your Friendly Neighborhood Spider-Man! Prepare for the Future Foundation's first mission with the Wallcrawler on the team roster!", "Amazing Spider-Man (1999) #658 (THOR HOLLYWOOD VARIANT)": "CLASSIFIED!", "Age of X: Universe (2011) #1": "In an age without the X-Men, mutants are hated and hunted. The surviving mutants create a last bastion for their dying race: Fortress X. With this AGE OF X, humanity vows to see mutants destroyed and a team of champions find themselves united.", "X-Men: First Class Vol. 2 GN-TPB (Graphic Novel)": "For millions of years, mankind's place on Earth was unchallenged - until five young people paved the way for a new kind of human! While students at the Xavier School for Gifted Youngsters, Cyclops, Marvel Girl, Angel, Beast and Iceman taught the world what it meant to be \n. These are the hidden stories of the team that laid the foundation of a mutant dynasty! Featuring Sue Storm, the Fantastic Four's Invisible Girl; the Incredible Hulk; mutant-hunting Sentinels; and more! Collecting X-MEN: FIRST CLASS (2007) #1, #5-7 and #10 ,à„à® plus cartoonist Colleen Coover takes on Xavier's five in the backup strips from issues #3, #5-6, #9 and #11-15; and the X-MEN: FIRST CLASS SPECIAL (2007).", "Amazing Spider-Man (1999) #657": "FF: THREE TIE-IN Spider-Man visits the FF for a very private wake-just for family.", "Fantastic Four (1998) #587 (3rd Printing Variant)": "One of the four will fall!", "FF (2010) #1": "The World's Greatest Comic Magazine just got greater! A bold new direction for Marvel's First Family featuring new members, old friends, older enemies and uneasy alliances!", "Fantastic Four (1998) #587 (2ND PRINTING VARIANT)": "The conclusion to \"Three\"!", "Fantastic Four (1998) #588": "THREE PART 6 Following the death of Johnny Storm, see how the remaining members of the Fantastic Four, the extended family, other heroes, and prominent villains react to the loss of this legendary hero.", "Atlantis Attacks (DM Only) (2011)": "Evil undersea monarchs Ghaur and Llyra are determined to bring the elder god Set to Earth, and no one on the surface world will stop them! Seven mortal women - including the Invisible Women, She-Hulk and Marvel Girl - have been selected to act as the brides of Set's snake heads, and the ensuing conflict will spread to nearly every hero on Earth, from the Avengers to Quasar to the Punisher to the X-Men to the Fantastic Four! Can the heroes stop this terrible plot in time? Plus: the complex history of the Serpent Crown, recounted in full! Collecting SILVER SURFER ANNUAL #2, IRON MAN ANNUAL #10, MARVEL COMICS PRESENTS #26, UNCANNY X-MEN ANNUAL #13, AMAZING SPIDER-MAN ANNUAL #23, PUNISHER ANNUAL #2, SPECTACULAR SPIDER-MAN ANNUAL #9, DAREDEVIL ANNUAL #5, AVENGERS ANNUAL #18, NEW MUTANTS #76, NEW MUTANTS ANNUAL #5, X-FACTOR ANNUAL #4, WEB OF SPIDER-MAN ANNUAL #5, AVENGERS WEST COAST #56, AVENGERS WEST COAST ANNUAL #4, THOR ANNUAL #14 and FANTASTIC FOUR ANNUAL #22.\nRated T ...$75.00\nISBN: 978-0-7851-4493-9", "Atlantis Attacks (2011) #1": "Evil undersea monarchs Ghaur and Llyra are determined to bring the elder god Set to Earth, and no one on the surface world will stop them! Seven mortal women - including the Invisible Women, She-Hulk and Marvel Girl have been selected to act as the brides of Set's snake heads, and the ensuing conflict will spread to nearly every hero on Earth, from the Avengers to Quasar to the Punisher to the X-Men to the Fantastic Four! Can the heroes stop this terrible plot in time? Plus: the complex history of the Serpent Crown, recounted in full! Collecting SILVER SURFER ANNUAL #2, IRON MAN ANNUAL #10, MARVEL COMICS PRESENTS #26, UNCANNY X-MEN ANNUAL #13, AMAZING SPIDER-MAN ANNUAL #23, PUNISHER ANNUAL #2, SPECTACULAR SPIDER-MAN ANNUAL #9, DAREDEVIL ANNUAL #5, AVENGERS ANNUAL #18, NEW MUTANTS #76, NEW MUTANTS ANNUAL #5, X-FACTOR ANNUAL #4, WEB OF SPIDER-MAN ANNUAL #5, AVENGERS WEST COAST #56, AVENGERS WEST COAST ANNUAL #4, THOR ANNUAL #14 and FANTASTIC FOUR ANNUAL #22.\nRated T ...$75.00\nISBN: 978-0-7851-4492-2", "Fantastic Four (1998) #587 (SPOILER VARIANT)": "One of the four will fall!", "Fantastic Four (1998) #585 (2ND PRINTING VARIANT)": "FANTASTIC FOUR #585 Written by JONATHAN HICKMAN Penciled by STEVE EPTING Cover by ALAN DAVIS World's apart from each other, the Fantastic Four embark on their individual journeys with one destined to end in tragedy and change the face of Marvel's first family. It's THREE, part 3:'The Last Kings of Atlantis'! 32 PGS./Rated A ...$2.99", "Fantastic Four (1998) #583 (3RD PRINTING VARIANT)": "Now joined by artist Steve Epting (CAPTAIN AMERICa) , Jonathan Hickman's tenure on FANTASTIC FOUR hits critical mass with \"THREE\", running through FF #583-588. The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last! Change is in the air as the World's Greatest Comic Magazine lives up to its motto! While the Fantastic Four have to deal with an uprising in the Forever City of the High Evolutionary, back home in the Baxter Building Val finds her father's Bridge machine and learns the Cost of Solving Everything. It's the return of Doctor Doom and the debut of superstar artist Steve Epting in THREE, part 1: 'In Lateveria, the Flowers Bloom in Winter. Rated A ...$2.99", "Fantastic Four (1998) #586 (2ND PRINTING VARIANT)": "As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth amidst the chaos of Galactus devouring Nu-World. 32 PGS./Rated A ...$2.99", "Fantastic Four (1998) #584 (2ND PRINTING VARIANT)": "It's the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again. Join Jonathan Hickman and superstar artist Steve Epting in THREE, part 2: 'Congratulations, Mr. Grimm...You're Human Again.'' Rated A ...$2.99", "Fantastic Four (1998) #587": "THREE PART 5 This is the penultimate chapter of THREE! Which member of the Fantastic Four will perish?", "Marvel Adventures Super Heroes (2010) #10": "Reed Richards's secret plan is revealed at last, and a full scale Avengers assault on the Baxter Building is the result! But for which team will Susan Storm fight? And why are there TWO Black Widows?", "Marvel Adventures Super Heroes Vol. 7 Digest (Digest)": "Captain America, Iron Man, the Black Widow, Thor, the Vision, Nova, and the Invisible Woman...a powerful collective of the greatest heroes the world has ever known. They are the Avengers, and they want it known they're here to stay. Watch the all-ages action unfold when Captain America tries to take down the nefarious A.I.M. terrorist organization. Then see Thor battle the deadly Executioner aboard a pirate ship! And the Black Widow is forced to trespass into Prince Namor's domain in a desperate bid to save Tony Stark's life!", "Fantastic Four (1998) #586": "THREE PART 4 As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth!", "Women of Marvel (2010) #2": "Jungle queens, invisible princesses and beautiful banshees, oh my! Marvel's magnificent Amazons take it up a notch in this smoldering selection of shorts by talent to watch out for! Shanna the She-Devil battles pilgrims and pterodactyls, Sue Storm forges a fairy tale ending for the Invisible Woman, and Songbird faces the music of her past when she meets...Screaming Mimi?! And little Lyra needs a prom dress...which brings the smallest She-Hulk against an all new foe: THE MALL!\r\n40 PGS./Rated T  ...$3.99", "Fantastic Four (1998) #585": "THREE PART 3 Worlds apart from each other, the Fantastic Four embark on their individual journeys. One member won't make it back...", "Chaos War: Chaos King (2010) #1": "As darkness blankets the stars, only the gods of Zenn-La, homeworld of the Silver Surfer, remain to oppose the Chaos King before he begins his march on the final battleground: Earth!", "Fantastic Four (1998) #584": "THREE PART 2 In this issue: the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again.", "Fantastic Four (1998) #583": "THREE PART 1 The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last!", "Fantastic Four (1998) #582": "At collapsed Chronopolis, after the death of the universe, Reed, Ben, Doom and Nathaniel Richards battle for both the past and the future.", "Fantastic Four (1998) #581": "The first of a two-part story featuring the return of Nathaniel Richards as he jumps through time back to the college years of Reed, Ben and Victor Von Doom and recruits them for an impossible mission in the future.", "Girl Comics (2010) #3": "The final issue is here, and you won't want to miss out on the event of the year comes as these acclaimed creators take on everything from Marvel romance to Marvel horror! Join the celebration with veteran creators of both classic Marvel and indie comics, including Marjorie Liu (DARK WOLVERINE), Ann Nocenti (DAREDEVIL) and Carla Speed McNeil (Finder).\r\nParental Advisory  ...$4.99", "Fantastic Four (1998) #580": "A giant toy store full of deadly videogame kids and killer playthings. An underground labyrinth inhabited by needy Swedish nannies. The Impossible Man. Arcade. And a babysitter named Johnny Storm...Enter the Frank-tastic Four.", "Fantastic Four (1998) #579": "Think the world is a bad place, everything is going to hell, and the end times are surely around the corner? Try reading the World's Greatest Comic Magazine.", "Sentry: Fallen Sun (2010) #1": "The SIEGE has ended and taken its toll on both sides of the battle field. The event seven years in the making has claimed many lives, and in this, its final chapter, a universe comes together to mourn the Sentry. The shocking death that ended the fight and gave birth to a new Heroic Age is remembered as a writer Paul Jenkins returns to lead the farewells.", "Fantastic Four (1998) #578": "PRIME ELEMENTS PART 4 The Fantastic Four head to the Negative Zone to deal with one of their most dangerous foes! Annihilus is back!", "Fantastic Four (1998) #576": "PRIME ELEMENTS PART 2 The Fantastic Four head to the bottom of the world to discover the mystery of the Vostok Station!", "Fantastic Four (1998) #575": "PRIME ELEMENTS PART 1 Witness the return of the Mole Man and see the Fantastic Four discover the world's smartest Moloid!", "Marvel Adventures Super Heroes (2008) #19": "The Avengers have barely moved into their new mansion before they have their first visitor, the super villain known as the Plant Man. But Plant Man isn't crashing the party, he's asking for help in his battle against a violently berserk Silver Surfer, an interstellar powerhouse intent on planting the Plant Man. How much will the Avengers put on the line to protect a super villain, and can even the assembled Avengers stand against the Power Cosmic?", "Fantastic Four (1998) #574": "All the Marvel cool kids show up at the bestest birthday party ever! We got X-kids, Power Pack, and Spider-Man in the house as Franklin celebrates his birthday!. Who cuts the cake? Who brings the best present? And who's the special guest of honor? It's Days of Future Franklin!", "Fantastic Four (1998) #573": "Adventures on Nu Earth! Ben and Johnny have big plans for a much needed vacation in the company of refugees from the future - booze, ladies, misadventures...and two stowaways named Franklin and Val.", "Fantastic Four (1998) #572": "Spinning Marvel's first family into a bold new era of adventure. Be there to see Reed Richards SOLVE EVERYTHING.", "Fantastic Four (1998) #570": "It's adventure, it's family, it's tough questions in dark times...See what happens when Reed Richards tries to SOLVE EVERYTHING.", "Fantastic Four (1998) #569": "THE MASTERS OF DOOM FINALE It's the last stand of the FF before the triumphant Marquis of Death! And should Marvel's First Family survive that, they've still got the wedding of the Thing to look forward to!", "Fantastic Four (1998) #568": "THE MASTERS OF DOOM PART THREE Reed Richards is offered a Solomon's choice by the triumphant Marquis of Death!", "The Mighty Avengers (2007) #26": "In this issue: Mr. Fantastic and Hank Pym's battle of the brains! Hercules and The Thing's battle o' the brawn! Plus, an all-new HQ for the team!", "Fantastic Four (1998) #567": "THE MASTERS OF DOOM PART TWO The Marquis of Death has returned to Earth. His first target: his once-pupil, Victor Von Doom! \n", "Adam: Legend of the Blue Marvel (Trade Paperback)": "An unstoppable super-villain attacks New York City - and the Mighty Avengers fall before him! Where did Anti-Man come from? And who can stop his overwhelming rampage?! Now Iron Man races to find the only man who's ever defeated Anti-Man - THE BLUE MARVEL! A hero the world hasn't seen since 1961! Will Tony Stark uncover the truth behind Blue Marvel's disappearance and will Blue Marvel ever recover from it? Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League) join forces to create Marvel's newest powerhouse super hero! Collecting ADAM: LEGEND OF THE BLUE MARVEL #1-5.\r\nRated T  ...$19.99 \r\nISBN: 978-0-7851-2409-2", "Fantastic Four (1998) #566": "THE MASTERS OF DOOM PART ONE They come from across the universe, returning to Earth after a 20 year journey of genocide and sadism. They're the men who tutored Doctor Doom in villainy, and they've returned to destroy the Fantastic Four!\n", "Fantastic Four (1998) #565": "A visit to Reed's most remote relatives becomes a fight for survival as a creature beyond the confines of science targets the Richards' offspring for consumption.\n", "Fantastic Four (1998) #564": "Prepare for a Christmas gone horribly wrong as the Fantastic Four must battle for survival just in time for the holidays!", "Fantastic Four (1998) #563": "Mr. and Mrs. Thing! A threat from the world of 1985! Plus: Who are the Masters of Doom?\n", "Fantastic Four Cosmic-Size (2008) #1": "To be revealed at a later date. Check back to Marvel.com, the Marvel Mailer & Diamond Daily for more information.\r<br>Rated A ...$4.99\r<br>", "Fantastic Four (1998) #562": "It's a Fantastic Four wedding and a funeral, as Sue Storm speaks at her own burial, and Ben Grimm finally pops the question!\n\n\n", "X-Men: The Complete Onslaught Epic Book 4 (Trade Paperback)": "The final onslaught is ON! Mutantdom's mightiest telepaths are forced to turn on one of their own, because Professor X's evil side won't stand for any more repression! The world's greatest hero teams gird for battle against one of their deadliest enemies, and when the smoke clears, not only will some of them not still be standing, they won't be there at all! The X-Men are left to take the blame for over a dozen dynamic disappearances, leading the man called Bastion to lay the groundwork for their NEXT crisis! But even if Onslaught is purged from this world, can a reborn world say the same? Guest appearances galore, plus step-by-step details on where the turning point of the 1990s began and ended! Collecting FANTASTIC FOUR #416, X-MEN #56, ONSLAUGHT: MARVEL UNIVERSE, CABLE #36, UNCANNY X-MEN #337, X-MEN #57, ONSLAUGHT: EPILOGUE, IRON MAN #6 & X-MEN: ROAD TO ONSLAUGHT.\r<br>Rated T+ ...$29.99\r<br>", "Adam: Legend of the Blue Marvel (2008) #2": "In the wake of Anti-Man's devastating attack on New York City, the Mighty Avengers are neutralized, and Iron Man's on a quest for answers! Who was the Blue Marvel?\r\nWhy did he disappear over 40 years ago? And...what alarming secrets will Iron Man discover about the U.S. government and his own agency of S.H.I.E.L.D.? There are no easy answers in the story of Marvel's newest super hero...created by Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League)!\r\nRated T  ...$3.99", "Marvels: Eye of the Camera (2008) #1": "News photographer Phil Sheldon's back, with the man-on-the-street's perspective on the big events of the Marvel Universe!", "Fantastic Four (1998) #561": "\"The Death of the Invisible Woman\" concludes, with...well, the death of the Invisible Woman!\r<br>Rated T+ ...$2.99\r<br>", "Marvel Masterworks: The Fantastic Four Vol. 11 (Hardcover)": "The World's Greatest Comic Magazine marches forward with a new great artist, Big John Buscema, and the same great man - Stan \"The Man,\" 'natch - in A fresh set of epic adventures as only mighty Marvel can make 'em! It all begins when Johnny Storm's ladylove, Crystal, must leave the polluted human world for the Inhumans' sanctuary, but within her lies the secret solution to freeing the Thing from his rocky prison. Then, as Benjamin Grimm emerges with the power to change into the Thing at will, Reed Richards must descend into the dark of the Negative Zone to face entropic Annihilus and the mysterious Janus, the Nega-Man. But what good is controlling your powers, when you're losing control of your mind? The Thing goes on a rampage and New York City better look out because it can only end in the biggest, the baddest, the best fist-pounding, building-toppling, earth-shaking slobbernocker in Marvel history! The ever-lovin', blue-eyed Thing goes toe-to-toe with the gamma-powered goliath, the Incredible Hulk, and only one will walk out alive. That's not all, though! Before the FF collect themselves, the all-powerful Over-Mind descends on the planet Earth - and you know it ain't gonna be good for real-estate values when the Watcher shows up, too. It's a menace so great that even the evil Doctor Doom joins forces with the FF, so reserve your copy today, True Believer - there's plenty more classics to come! Collecting FANTASTIC FOUR #105-116.\r<br>All Ages ...$54.99\r<br>ISBN: 978-0-7851-3046-8\r<br>", "X-Men: The Complete Onslaught Epic Book 3 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got underway! Professor X hasn't been himself lately - moody, inscrutable, but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, the Fantastic Four, the Avengers, but forgotten stars of the nineties like Green Goblin Phil Urich, Nate Grey the X-Man and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Hulk, the Pantheon, the Punisher, S.H.I.E.L.D. and others! Collecting HULK #445, IRON MAN #332, AVENGERS #402, PUNISHER #11, X-MAN #19, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, FANTASTIC FOUR #416 and WOLVERINE #105.\r<br>Rated T+ ...$29.99\r<br>", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 2 TPB (Trade Paperback)": "It's the past, it's the future, it's an alternate Earth - when it's down to fighting cyborg dictators and displaced dinosaurs, who has time to figure out where they are?! It's another Simonson odyssey for the Fantastic Four and company, plus personal crises for the Human Torch and Ms. Marvel (Sharon Ventura)! Guest-starring Spider-Man and Rusty Collins of X-Factor/New Mutants fame! Collecting FANTASTIC FOUR #342-346.\r<br>All Ages ...$14.99\r<br>", "FANTASTIC FOUR: LOST ADVENTURES BY STAN LEE PREMIERE HC (Hardcover)": "The comic-book equivalent of a lost Beatles track! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished - until now! Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott reunited to complete the work they started almost four decades ago! Plus: The legendary writer and Fantastic Four co-creator joins forces with artist John Romita Jr. to tell his final story of the team that started the Marvel Age! Collecting FANTASTIC FOUR: THE LOST ADVENTURE and THE LAST FANTASTIC FOUR STORY, plus rare Stan stories from FANTASTIC FOUR #296 and #543.\r<br>Rated A ...$24.99\r<br>ISBN: 978-0-7851-3097-0\r<br>", "Counter X Vol. 1 (Trade Paperback)": "Like all mutants, X-Force must face a callous and deadly world -- but now they've been trained for it by Peter Wisdom, one of the most callous and deadly mutants of all! The proactive paranormal platoon faces a city transformed by Cold War mad science and a mutant druglord terrorist, but will their deadliest enemies be Wisdom's long-lost allies? Featuring killer zombies, exploding buildings and the dynamic Domino! Collecting X-FORCE #102-109.\r<br>Rated T+ ...$19.99\r<br>ISBN: 978-0-7851-3304-9\r<br>", "New Avengers: Illuminati (Trade Paperback)": "The Illuminati. What are they? An elite group of the planet's most powerful guardians. When do they meet? Whenever the Earth faces its greatest threats. Who are they? Nobody knows ' and that's the way they want it! Join Iron Man, Professor X, Black Bolt, the Sub-Mariner and Mister Fantastic as they take on the threats no one else can handle ' and learn of secrets that will forever alter the way they (and you) look at the Marvel Universe! After years spent protecting Earth from harm, it is now when the planet is perhaps at its most endangered ' as the Illuminati find themselves at the head of the spear of a Skrull invasion. But can the Illuminati keep themselves from fracturing in the waking moments of this worldwide threat? Collecting NEW AVENGERS: ILLUMINATI #1-5.\r\nRated T  '$14.99\r\nISBN: 978-0-7851-2437-5", "Fantastic Four: The Lost Adventure (2008) #1": "IT'S THE COMIC BOOK EQUIVALENT OF A LOST BEATLES TRACK! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished-until now!  Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott have reunited, to complete the work they started almost four decades ago! Plus, this super-sized issue includes reproductions of Kirby's unlinked penciled pages, with border notes and analysis by John Morrow, and a complete reprint of FANTASTIC FOUR #108 by Stan Lee and John Buscema, which incorporated some of the material from the lost story as a flashback.\r<br>Rated A ...$4.99 \r<br>", "Fantastic Four (1998) #554": "MARK MILLAR! BRYAN HITCH! Need we say more? All right, we will! Who is Mrs. Fantastic? And how will her return into Reed's life rock comicdom's First Family? Also, get ready to meet the Invisible Woman's brand NEW super-team! This issue kicks off a year-long storyline that will make FANTASTIC FOUR \"The World's ULTIMATEST Comic Magazine!\" Promise!\r<br>Rated A...$2.99 \r<br>", "New Avengers: Illuminati Premiere (Hardcover)": "The Illuminati is a secret organization comprised of several of the world's most powerful heroes: Doctor Strange, Sorcerer Supreme; Black Bolt, king of the Inhumans; Charles Xavier, founder of the X-Men and mutant-rights activist; Reed Richards, founding member of the Fantastic Four; Namor the Sub-Mariner, king of Atlantis; and Iron Man (Tony Stark), founding member of the Avengers. These six men have worked together to mold and shape the status of the superhuman world and the world around it. How and what they have done together has remained a mystery...until now! Writers Brian Michael Bendis (NEW AVENGERS, ULTIMATE SPIDER-MAN) and Brian Reed (MS. MARVEL) have joined together with Jim Cheung (YOUNG AVENGERS) to reveal this untold story of the Marvel Universe and how the Illuminati's actions affect today! Collecting NEW AVENGERS: ILLUMINATI #1-5.\r<br>Rated T+ ...$19.99 \r<br>ISBN: 978-0-7851-2437-5\r<br>", "Fantastic Four: Isla De La Muerte! (2007) #1": "Ben Grimm has been keeping a secret from his teammates for years. But when Reed, Sue and Johnny investigate, the mystery brings them to the tropics, face-to-face with an old nemesis and a monstrous creature!", "Fantastic Four: Isla De La Muerte (Spanish Language Edition) (2008) #1": "Los Cuatro Fantásticos han viajado por todo el mundo, el universo y hasta otras dimensiones combatiendo amenazas inconcebibles, pero la amenaza más reciente a la que se enfrentan tiene su origen en la Isla del Encanto, Puerto Rico. En el número especial Fantastic Four: ¡Isla de la Muerte! One-Shot, escrito por el aclamado Tom Beland e ilustrado por el artista emergente Juan Doe, los Cuatro Fantásticos visitan la preciosa isla de Puerto Rico...¡donde se ha de revelar un secreto del pasado de la Cosa! Como si no bastara el resurgimiento de un antiguo enemigo, ahora los Cuatro Fantásticos deben enfrentarse al monstruo boricua al que se le conoce como...¡el chupacabras!\r<br>\r<br>¡Esta edición especial también estará disponible en español en la inaudita Los Cuatro Fantásticos: ¡Isla de la Muerte! Edición Boricua en Español! Ya sabe, fanático-¡puede leer esta historia repleta de acción en el idioma de Puerto Rico, y tomar parte en las aventuras de sus favoritos exploradores del desconocido como nunca antes!\r<br>\r<br>No se pierda esta edición especial de 38 páginas, en la que los Cuatro Fantásticos se enfrentan a uno de sus antagonistas más extraños-¡e intentan salir a salvo de la Isla de la Muerte!\r<br>\r<br>Rated A ...$3.99\r<br>", "Fantastic Five: The Final Doom (Trade Paperback)": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff - and cameos galore! Collecting FANTASTIC FIVE #1-5.\r<br>Rated A ...$13.99\r<br> \r<br>", "Marvel Adventures Fantastic Four (2005) #31": "Cleanup on Aisle Four!!!! MAN, the FF just CAN'T catch a break! Even when they're just going shopping, they gotta deal with evil geniuses that've created an entire STORE designed to destroy our heroes!\r<br>All Ages ...$2.99\r<br>", "X-Men: The Complete Onslaught Epic Vol. 1 TPB (Trade Paperback)": "It begins here! The saga that literally re-made the Marvel Universe of the 1990s is collected in chronological order across four volumes! The psionic force of nature known only as Onslaught sprang forth from the fractured psyche of mutant mentor Charles Xavier and the genetic terrorist called Magneto. Powered by his progenitors' rage, Onslaught laid siege to humanity -- touching off a cataclysmic conflict destined to deprive a world of its most revered icons! Collecting X-MEN #53-54, UNCANNY X-MEN #334-335, AVENGERS #400-401, ONSLAUGHT: X-MEN, X-MAN #18, X-FORCE #57, CABLE #34 and INCREDIBLE HULK #444.\r\n272 PGS./Rated T  '$29.99\r\nISBN: 978-0-7851-2823-6", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 8 TPB (Trade Paperback)": "John Byrne's FF endeavors end in era-transcending odysseys when the World's Greatest Super-Team ventures into the Negative Zone, a remade past and a future sculpted around the FF itself! Plus, the death, life and rebirth (not necessarily in that order) of Doctor Doom! Guest-starring Nick Fury, the Avengers and the Beyonder! Collecting FANTASTIC FOUR #287-295.\r<br>Rated A ...$24.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #30": "You've been bombarded with cosmic rays, granting you astounding abilities beyond the average human...do you use those powers to explore amazing new worlds and take on beings with near-limitless power, or do you take your skills to the streets and help the little man? \r<br>All Ages ...$2.99 \r<br>", "New Avengers: Illuminati (2006) #5": "The Illuminati convene to deal with both the New Avengers and the Mighty Avengers. But not everyone in the cabal is who they say they are? Betrayal and intrigue await you in this issue!", "Fantastic Four (1998) #551": "THE EPILOGUE CHAPTER 1 The Fantastic Four and Doctor Doom cross paths when Doom travels back in time to stop Richards from destroying the world. Could it be that Reed is a danger to all that he has sworn to protect? Is he capable of such villainy?", "Cable & Deadpool (2004) #46 (Zombie Variant)": "Since Deadpool is twice as much trouble as anyone in the Marvel Universe, the only logical people who could possibly rescue him and Bob, Agent of Hydra, from their temporal tantrum are... the FANTASTIC EIGHT? Twice the guest stars! Twice the fun! But not twice the price! How can you say no? 32 PGS./Rated T+ $2.99", "Marvel Adventures Fantastic Four (2005) #29": "Hmmmm...can't remember...Hulk Knit! No, that's not right. Hulk Bake Muffins! Nope, nope...Oh! I know...HULK SMASH!!!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #28": "The populace of Earth hates and fears the stranded SILVER SURFER. But he falls in with a TV self-help guru who encourages him to win the planet over to his side -- by solving all the world's problems! Wielding the Power Cosmic, the Silver Surfer single-handedly wipes out famine, poverty and war, becoming the most popular super hero ever -- as well as the greatest threat to Earth's continued existence! Why does the Fantastic Four have to stop the Surfer from...saving the world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (Trade Paperback)": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans. Collecting SILENT WAR #1-6\r<br>144 PGS./Rated T+ ...$14.99\r<br>ISBN: 978-0-7851-2425-2\r<br>", "Fantastic Five (2007) #5": "With the Earth already conquered and his teammates dying, Reed Richards faces his final battle with Doctor Doom--and only one will survive!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Spider-Man Family: Back in Black (Digest)": "The action begins with a feature-length tale starring Spider-Man's alien costume and guest-starring the Sandman! Peter Parker would love nothing more than to get a good night's sleep, but his sleek, symbiotic suit has plans of its own...and no one is gonna get in its way! Next, Venom is back in town, and he's on a rampage...but it has nothing to do with his vendetta against Spidey? What could be so important that Venom doesn't have the time to torture his nemesis? Peter Parker is determined to find out, but first he'll have to match journalistic wits with none other than Eddie Brock! And finally, remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say...knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler. Plus: backup stories featuring the Lizard and TWO Scorpions! Collecting SPIDER-MAN FAMILY #1-3\r<br>112 PGS./Rated A ...$8.99 \r<br>ISBN: 978-0-7851-2626-3 \r<br>", "Punisher War Journal Vol. 1: Civil War (Trade Paperback)": "Hey, there, Marvel Universe. He's back - with a vengeance. Taking no prisoners. Literally. With CIVIL WAR in full throttle mode, Frank Castle is feeling the heat. His safe houses have been raided and his munitions seized, and he's square in the crosshairs of a Marvel Universe big gun who always gets his man. Until now, this wasn't Frank's war. But when Spandex-clad baddies start carrying badges - well, let's just say that's something the Punisher can't abide. Brought to you by rising star Matt Fraction (The IMMORTAL IRON FIST), with eye-popping art by superstar Ariel Olivetti (LAST AVENGERS STORY). Collecting PUNISHER WAR JOURNAL #1-4, plus the black-and-white edition of issue #1.\r<br>144 PGS./Rated T+ ...$14.99 \r<br>ISBN: 978-0-7851-2315-6\r<br>", "The Last Fantastic Four Story (2007) #1": "Legendary writer and Fantastic Four co-creator Stan Lee unites with artist John Romita Jr. to tell his final story of the team that started the Marvel age!\r<br>64 PGS./Rated A ...$4.99\r<br>", "Fantastic Five (2007) #4": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #27": "And you thought meeting your girlfriend's parents was uncomfortable... The Human Torch invites his new heartthrob Crystal's family over to the Baxter Building for dinner with his family without realizing they're Black Bolt, Medusa, Gorgon, Triton, Karnak and Lockjaw ... The Inhumans! When agents of Maximus The Mad show up to capture them, you can be sure knowing which fork to use will be the least of the FF's problems...\r<br>32 PGS./All Ages ...$2.99 \r<br>", "PARADISE X VOL. 2 TPB (Trade Paperback)": "The epic, visionary EARTH X saga concludes.  Will the Heroes of Earth be able to solve the problems of the Paradise they helped create? Will their quest for a new Death entity succeed so the pain and suffering of the world's population ceases? Collecting PARADISE X #6-12,  RAGNAROK, DEVILS, A, X.\r<br>\r<br>352 PGS./Rated T+ ...$29.99 \r<br>\r<br>ISBN: 0-7851-2416-0 \r<br>\r<br>\r<br>", "Marvel Adventures Fantastic Four Vol. 6: Monsters & Mysteries (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits. Featuring the Mole Man, the Skrulls, Rama-Tut and the Sub-Mariner! Collecting \r<br>MARVEL ADVENTURES FANTASTIC FOUR #21-24.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "Fantastic Five (2007) #3": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>32 PGS./Rated A ...$2.99\r<br>", "New Avengers: Illuminati (2006) #4": "They have faced the Skrull empire, the Hulk, the Sentry, the Infinity Gems and the Beyonder, but now the secret society of Marvel is faced with the one thing too much for even them...", "Fantastic Four (1998) #548": "Fantastic Four vs. Frightful Four-'Nuff Said!", "Fantastic Five (2007) #2": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r<br>\r<br>32 PGS. /Rated A ...$2.99 \r<br>", "World War Hulk (2007) #2 (John Romita Jr.)": "The puny human \"heroes\" of Earth, including Reed Richards, Iron Man, Dr. Strange and Black Bolt, called the Hulk a monster and shot him into space. Now the Hulk has returned with a rage that knows no bounds-and he has a posse! Can the mightiest powerhouses of the Avengers stop the Hulk and his cadre of super-powered Warbound gladiators as they carve their path of mayhem through the concrete canyons of Manhattan? Can battling Ben Grimm and the rest of the Fantastic Four save Reed Richards from the Hulk's wrath? And what hope can She-Hulk have of calming her great green cousin's terrible rage?\r<br>40 PGS./Rated T+ ...$3.99\r<br>", "Marvel Adventures Fantastic Four (2005) #26": "A massive alien refugee fleet streams through our solar system, bearing the warning: \"Galactus is coming! Galactus is coming!\" And right behind them is the World-Devourer's herald, the SILVER SURFER -- headed straight for Earth! Reed Richards has only a few days to evacuate the planet before it's destroyed ... or, failing that, figure out a way to somehow stop the unstoppable!\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "World War Hulk (2007) #2": "The puny human \"heroes\" of Earth, including Reed Richards, Iron Man, Dr. Strange and Black Bolt, called the Hulk a monster and shot him into space. Now the Hulk has returned with a rage that knows no bounds-and he has a posse! Can the mightiest powerhouses of the Avengers stop the Hulk and his cadre of super-powered Warbound gladiators as they carve their path of mayhem through the concrete canyons of Manhattan? Can battling Ben Grimm and the rest of the Fantastic Four save Reed Richards from the Hulk's wrath? And what hope can She-Hulk have of calming her great green cousin's terrible rage?", "Paradise X Vol. 1 (Trade Paperback)": "In EARTH X, Captain America, the Fantastic Four, Thor, the Hulk and the X-Men discovered that their purpose - and the meaning of all super heroes and mutated people in the universe - was nothing more than to protect their host planet, in this case Earth, from outside invasion. They learned super heroes are merely biological antibodies to protect a growing embryo within the Earth. An embryo for the Celestial race: This is the way these Gods fought back - only to cause a terrible ecological imbalance, a rift at its core that in time would wipe out all life on the planet. In UNIVERSE X, Captain Marvel was reborn on Earth years after his death. But he also still claimed to walk in the realm of the unliving, where Earth's fallen champions still exist. Mar-Vell led a team of heroes in a quest for the greatest weapons of mass destruction on Earth, suggesting this would limit the destruction caused by the growing power struggle on the planet. But this was not the only reason. For his crusade on Earth only supported and armed a battle he fought in the realm of the fallen, a battle against Death herself. Those living champions who died in his collection of artifacts were added to the battle raging in this other realm. Mar-Vell led a charge against Death and killed her. But now that Death is dead, no one will ever die again. They may writhe in pain in hospitals because their bodies have been broken beyond repair, but they will not die. They will call out for an end to their suffering. They will cry out for peace but there will be no answer. Paradise will be denied them. Yes. Death is truly dead. Long live the living. Collecting PARADISE X #0-5, PARADISE X: XEN and HERALDS #1-3.\r<br>304 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2415-2\r<br>", "Fantastic Five (2007) #1": "\"The Final DOOM!\" Part 1 of 5\r\n<br>As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r\n<br>32 PGS./Rated A ...$2.99\r\n<br>", "Silent War (2007) #6": "Can Black Bolt hold it together as he suffers the unkindest cut of all? Betrayal, madness and a battle for the ages as the U.S.A. strikes back at Attilan.  Super-powered Kamikaze Marines go head-to-head with the Incomparable Inhumans in a battle for death ... or glory.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #25": "The Human Torch falls into a probability rift and finds himself flung across innumerable alternate realities, including: a world where a heroic Victor Von Doom, a.k.a. Doc Iron, battles against Mr. Devious, Monsterman, The Human Pyre, and The Unstoppable Woman ... a.k.a. The Frightful Four, a world where the Femmetastic Four defends a world completely depopulated of men (then Johnny shows up) and a world where Johnny's arch-nemesis runs the FF ... That's right, SPIDER-MAN! Can The Watcher help Torch get back to his timeline, or will he wander forever through \"The Worlds of What If?\" \r<br>And a warm welcome to new cover artist PAUL SMITH!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four Omnibus Vol. 2 (Hardcover)": "With all that Stan Lee and Jack Kirby accomplished in their first 30 issues of FANTASTIC FOUR, who would have thought they were just warming up? Well, True Believers, now it's time to jump into the fire because the second 30 are where they really start to turn up the heat!\r<br>Their achievements reflect the boundless energy of two creators at the top of their game with each issue, character and creation building upon and exceeding the scope of the last. It's a list of accomplishments unparalleled in the history of comics: the origin of Dr. Doom; the Frightful Four; the Wedding of Reed Richards and Sue Storm; the Inhumans; the first appearance of the Silver Surfer; the Galactus Saga; the debut of the world's first black super hero, the Black Panther; the cosmic clash between the FF, the Surfer and Dr. Doom; and, of course, \"This Man, This Monster!\" - the story widely regarded as the greatest FF tale of all! \r<br>Collecting the greatest stories from the World's Greatest Comics Magazine in one, massive collector's edition that has been painstakingly restored and recolored from the sharpest material in the Marvel Archives. With critical essays on the Lee/Kirby collaboration and bonus features a-plenty, this book is nothing short of a cornerstone to the Marvel Universe!\r<br>Collecting FANTASTIC FOUR #31-60 and ANNUAL #2-4.\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2403-9\r<br>Trim size: oversized\r<br>FANTASTIC FOUR OMNIBUS VOL. 2 HC - VARIANT EDITION\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2510-8\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 7 TPB (Trade Paperback)": "Marvel once again poses the question, \"What If...?\" In \"The Other,\" Peter Parker returned from the dead and embraced his \"inner spider.\"  But what if he had been completely consumed by his inner, bestial impulses and became more spider than man? \"Disassembled\" was the darkest day in Avengers history. But what if the greatest threat had gone undetected? Hydra made Wolverine an \"Enemy of the State.\" But what if the world's deadliest killing machine was never de-programmed? In \"Deadly Genesis,\" Professor X sent a secret squad of young mutants to the living island, Krakoa, in an ill-fated attempt to rescue the original X-Men before he formed the now-famous All-New, All-Different team. But what if this second team had survived? Attempting to slay Magneto Legion accidentally killed Professor X, giving rise to the \"Age of Apocalypse.\" But what if Legion killed both Magneto and Xavier, leaving no leader to create any incarnation of X-Men to resist the onslaught of Apocalypse? Collecting WHAT IF? AVENGERS DISASSEMBLED, SPIDER-MAN THE OTHER, WOLVERINE ENEMY OF THE STATE, X-MEN AGE OF APOCALYPSE and X-MEN DEADLY GENESIS.\r<br>176 PGS./Rated T+ ...$16.99 \r<br>ISBN: 0-7851-2183-8\r<br>", "Spider-Man Family (2007) #3": "Remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say..knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler...\r<br>Also! We've got a backup story featuring TWO Scorpions, Spider-Man J and classic Spidey archives !\r<br>104 PGS./Rated A ...$4.99\r<br>", "Fantastic Four/Inhumans (Trade Paperback)": "The incredible Inhumans have long been allies to the FF in defending the Earth, but what happens when they leave it? And what awaits them when they come back? See for yourself in a saga where treachery, intrigue and buried secrets reach from the depths of space to deep within Inhuman history! Guest-starring Ronan and Starlord of ANNIHILATION! Collecting INHUMANS (2000) #1-4 and FANTASTIC FOUR #51-54.\r<br>192 PGS./Rated T+ ...$19.99\r<br>ISBN: 0-7851-2703-8\r<br>", "New Avengers: Illuminati (2006) #3": "Years ago a mysterious creature called the Beyonder gathered the heroes and villains of the Marvel Universe for the Secret Wars. Now, finally, after decades of mystery, the true origin of this powerful creature is revealed...", "Fantastic Four: The End Premiere (Hardcover)": "Alan Davis writes and pencils the final story of Marvel's first family! Even the strongest family can be torn apart by tragedy - and in the futuristic world of tomorrow, the members of the once-Fantastic Four are divided and vulnerable to opponents from their past. What events could have caused the FF to go their separate ways, and how does their disbanding set the stage for a conflict that will send shockwaves across the galaxy and beyond? Collecting FANTASTIC FOUR: THE END #1-6\r<br>144 PGS./Rated T+ ...$19.99 \r<br>", "Silver Surfer: Requiem (2007) #1": "The latest offering from the Marvel Knights line. Guest-starring the Fantastic Four! \r<br>For untold years Norrin Radd has surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride is about to come to an end.  It starts with a small spot -- a blemish that will spread until he is no more.  Until then, the Silver Surfer would undertake his final voyage -- to the one destination that has always eluded him.  His journey starts where it began.\r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99 \r<br>", "Black Panther: Civil War (Trade Paperback)": "The Royal Couple, King T'Challa and Queen Ororo, embark on a diplomatic tour that will have them spanning the globe - and beyond! Stops include Latveria (Dr. Doom), the Moon (Black Bolt and the Inhumans), Atlantis (Namor the Sub-Mariner) and the CIVIL WAR-ravaged United States, for a meeting with none other than the point man for the U.S. government's implementation of the Super Human Registration Act: Tony Stark, T'Challa's former Avengers teammate. Will the Black Panther and Storm decide to get off the sidelines of the CIVIL WAR and get involved? Collecting BLACK PANTHER #19-25.\r<br>168 PGS./Rated T+ ...$17.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #24": "A trio of priceless tridents has been stolen from Atlantis, and the prime suspect is ... the Invisible Woman! Can Mr. Fantastic trade his scientist's hat for a detective's and uncover the real culprits before the SUB-MARINER declares war on the surface world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 1 TPB (Trade Paperback)": "After a string of successes with THOR, X-FACTOR and AVENGERS, it's sensational Simonson storytelling for Marvel's First Family - starting when the FF's Congressional hearing is disrupted by dozens of vengence-seeking villains! After the famous foursome - plus Ms. Marvel - deal with the Capitol chaos, a time anomaly sends them to find the future's fate! But while Kang and Nebula take up their time, will the universe fall to Galactus? Guest-starring Thor, Iron Man and Death's Head! Collecting FANTASTIC FOUR #334-341.\r<br>192 PGS./Rated A  ...$19.99 \r<br>", "Silent War (2007) #4": "The pressure builds on Black Bolt. The hawks in the Inhumans council are calling for all-out war and as he struggles to make his fateful decision, Black Bolt finds himself betrayed. As if that weren¹t enough, a terrible secret from his past is revealed. It's enough to make a man scream.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Marvel Adventures Fantastic Four Vol. 5: All 4 One, 4 for All (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits! Featuring the Absorbing Man, Arcade, Iceman of the X-Men...and Sue Storm, Secret Agent!? Collecting MARVEL ADVENTURES FANTASTIC FOUR #17-20.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #23": "RAMA-TUT, the Pharaoh from the Future, has reached through time to kidnap the Thing's girlfriend (who happens to be quite the sculptress) to design his pyramid for him, and only the Four can rescue her!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (2007) #3": "Luna is forced to make a heart-breaking choice that could cost her life as the Inhumans finally track Quicksilver to Mutant Town and we see just how far he has descended into madness. This is a man who has seen the future and if his prophecies come true, things are looking very bleak for the Inhumans. If that wasn't bad enough, when Madrox and Layla arrive, things really get messed up.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Spider-Man: Birth of Venom (Trade Paperback)": "The Beyonder's Battleworld might seem a strange place to get new threads, but it's Spider-Man who becomes unraveled when his shape-changing costume attempts to darken his life as well as his fashion sense! But ridding himself of his riotous raiment proves an even greater mistake when its alien enmity bonds with mortal madness to form our hero's most dedicated decimator! Plus: the first appearances of Puma and the Rose! Mary Jane Watson's startling secret! And the debut of the battling...Bag-Man!? Guest-starring the Black Cat, the Fantastic Four and more! Collecting SECRET WARS #8; AMAZING SPIDER-MAN #252-259, #298-300 and #315-317; FANTASTIC FOUR #274; and WEB OF SPIDER-MAN #1;  AMAZING SPIDER-MAN ANNUAL #10.\r\n344 PGS./Rated A ...$29.99", "Marvel Adventures Fantastic Four (2005) #22": "The Invisible Woman and Mr. Fantastic are on one final date to save their relationship, but with a strike team of sinister SKRULLS stalking them, their relationship isn't the only thing in jeopardy!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: The End (2006) #6": "One last chance to put the past behind them and unite as a family. One final test of their mettle as super heroes and human beings. Do the members of the Fantastic Four possess the fortitude to conquer this greatest of challenges to humanity and to their own happiness? \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Civil War (2006) #7": "It all ends here! The startling battle that will determine the future of the Marvel Universe!", "Civil War (2006) #7 (Turner Sketch Variant)": "It all ends here! The startling battle that will determine the future of the Marvel Universe!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Silent War (2007) #2": "Deep beneath the Pentagon the O*N*E is experimenting on the captured Inhumans with horrifying results. On Attilan, while pressure builds for all-out war on humankind, Quicksilver's young daughter Luna uses her developing powers of empathy to probe the dark corners inside the mind of Black Bolt's brother, Maximus the Mad. \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "New Avengers: Illuminati (2006) #2": "If the Infinity Gems ever fell into the wrong hands it would be catastrophic. So, when the Illuminati discover the gems are scattered across the cosmos, completely unguarded, the race is on to collect them before anyone else learns the truth!", "Civil War (2006) #7 (Turner Variant)": "It all ends here! The startling battle that will determine the future of the Marvel Universe!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #21": "The creatures of MONSTER ISLE have finally overthrown and exiled the MOLE MAN. And for their new leader they recruit the bravest, noblest monster they know ... the Thing!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Black Panther (2005) #24": "CIVIL WAR: BLACK PANTHER PART 6 The honeymoon is officially over. With the CIVIL WAR racing toward a senses-shattering conclusion, the Black Panther and Storm pledge their allegiance to the renegade Captain America.", "Marvel Adventures Fantastic Four (2005) #20": "THE HUMAN TORCH is really really hot. ICEMAN is really really cool. And they really really don't like one another. So we've stranded them together with a bunch of pretty girls and a super-villain! Let's see what happens!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (2007) #1": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Punisher War Journal (2006) #3": "Civil War tie in\r<br>The Punisher.  Captain America.  Uneasy allies in even the best of times, now two fugitives fighting a common enemy in CIVIL WAR.  Every war is won or lost based on one decisive battle-- this might be the endgame for CIVIL WAR.  A clash that's been building for thirty years comes to a ferocious head as The Punisher and Captain America finally collide, and the reverberations will be felt for months to come.  Cap made a deal with the devil -- what happens when the devil comes to collect?\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Visionaries: John Buscema (Hardcover)": "The Incredible Hulk, the devastating Dragon Man, the epic end of the gods themselves...none of it was too much for Big John! One of comicdom's most acclaimed creators takes center stage in this genre-spanning gathering of greats! Nick Fury vs. Hydra! Thor vs. the Silver Surfer! The origins of Wolverine and Dracula! The twilight of the Masters of Evil! Includes crime, horror, romance and western work from the pre-Marvel era! Plus: rare Silver Surfer stories unseen for decades! Collects CRIME FIGHTERS #4;  STRANGE TALES #22 & #150; TALES TO ASTONISH #85-87; AVENGERS #41-42, #75-76, #277 & ANNUAL #2; SILVER SURFER #4; MY LOVE #2; FANTASTIC FOUR #111-112; THOR #200; DRACULA LIVES #3; MARVEL SPOTLIGHT #30; WOLVERINE #10; and MARVEL SHADOWS & LIGHT #3.\r<br>368 PGS./Rated T+ ...$34.99  \r<br>", "Avengers Assemble Vol. 4 (Hardcover)": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>", "Fantastic Four: The End (2006) #4": "Their family scattered to the four corners of a solar system quarantined from the rest of the universe, besieged by a number of their most relentless enemies, including the Super-Skrull, the Mole Man, Diablo, the Mad Thinker and the Kree Sentry, can the members of the Fantastic Four survive-and triumph?\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Civil War (2006) #6 (Turner Variant)": "Captain America's depleted forces have determined the secret of File 42, setting them on a last-ditch collision \r<br>course with Iron Man and the Pro-Registration heroes! It's the beginning of the battle of the century-a conflict \r<br>in which virtually every superhuman on Earth will be forced to choose a side to fight on!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Civil War (2006) #6": "Captain America's depleted forces have determined the secret of File 42, setting them on a last-ditch collision course with Iron Man and the Pro-Registration heroes! It's the beginning f the battle of the century-a conflict in which virtually every superhuman on Earth will be forced to choose a side to fight on!", "New Avengers: Illuminati (2006) #1": "Doctor Strange, Black Bolt, Charles Xavier, Reed Richards, Namor the Sub-Mariner and Tony Stark. These six men have worked together to shape the super human world. How and what they have done together has remained a mystery...", "Fantastic Four: The End (2006) #3": "As Johnny Storm and Ben Grimm meet on Mars to compare notes, in the deepest portions of the ocean's depths Sue Richards makes a discovery that could change the future of their fractured family.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #19": "Ever have one of those days when it seems that someone's just out to get you? Well, MISTER FANTASTIC's having one of those days...because ARCADE's after him! Can the world's smartest hero survive a fun house of horrors without the rest of  his teammates?\r<br>(Psst! We ain't tellin'! Buy the book!)\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 4: Cosmic Threats (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on the powerful malevolent alien calling himself the Grant Master, the cosmic scavenger Terminus and the mad Titan known as Thanos - and have a close encounter with a world gone bonkers! Guest-starring Captain Marvel! Collects MARVEL ADVENTURES FANTASTIC FOUR #13-16.\r<br>96 PGS./ All Ages ... $6.99\r<br>", "Onslaught Reborn (2006) #1 (Turner Variant)": "Marvel's greatest heroes sacrificed themselves to save the world from the deadliest threat they had ever faced-Onslaught! The lives of the Fantastic Four and the Avengers were saved only when Franklin Richards created a parallel universe, where we found those heroes, reborn! But this world has long since merged back into our own, and the evil Onslaught-forged from the most vile parts of Magneto's and Professor X's psyches-has been presumed long dead... but now he, himself, is reborn-and he's bringing fragments of the other universe with him! Join comics superstars Jeph Loeb and Rob Liefeld in this no-holds-barred, all-out action extravaganza-celebrating the 10th Anniversary of the event that changed Marvel history-as Onslaught, the Marvel Universe, and the Heroes Reborn Universe collide in this massive crossover!  A significant portion of the proceeds from ONSLAUGHT REBORN #1-5 will be donated to The Sam Loeb College Scholarship Fund.\"\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Onslaught Reborn (2006) #1": "Marvel's greatest heroes sacrificed themselves to save the world from the deadliest threat they had ever faced-Onslaught! The lives of the Fantastic Four and the Avengers were saved only when Franklin Richards created a parallel universe, where we found those heroes, reborn! But this world has long since merged back into our own, and the evil Onslaught-forged from the most vile parts of Magneto's and Professor X's psyches-has been presumed long dead... but now he, himself, is reborn-and he's bringing fragments of the other universe with him! Join comics superstars Jeph Loeb and Rob Liefeld in this no-holds-barred, all-out action extravaganza-celebrating the 10th Anniversary of the event that changed Marvel history-as Onslaught, the Marvel Universe, and the Heroes Reborn Universe collide in this massive crossover!  A significant portion of the proceeds from ONSLAUGHT REBORN #1-5 will be donated to The Sam Loeb College Scholarship Fund.\"\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Heroes Reborn: Iron Man (Trade Paperback)": "Iron Man left two lives behind when he vanished, but can he avoid his former mistakes in his new one? The armored Avenger takes on Hydra, Heralds and the Hulk - and the eyes of the Marvel Universe are upon him in the form of Loki, the Watcher and Onslaught himself! Featuring Doc Samson and - or rather, AS - the Abomination! Plus: Rebel O'Reilly, later of THUNDERBOLTS fame! Collects IRON MAN (VOL. 2) #1-12.\r<br>336 PGS./Rated A ... $29.99\r<br>", "Marvel Adventures Fantastic Four (2005) #18": "Flying cars, covert missions and secret handshakes...by day, she is the Invisible Girl of the Fantastic Four, but by night, she is...SUE STORM, SECRET AGENT!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: First Family (Trade Paperback)": "For the first time, untold secrets of the Fantastic Four's earliest days are revealed! What happened the moment after Reed Richards' rocket crash-landed? What happened - to Sue Storm, to Ben Grimm, to Johnny Storm - in the days following that fateful event? An in-depth, action-packed, psychologically thrilling exploration of the FF's origin! Collects FANTASTIC FOUR: FIRST FAMILY #1-6.\r<br>144 PGS./Rated A... $15.99\r<br>", "Fantastic Four: The End (2006) #1": "Alan Davis writes and pencils the final story of Marvel's first family! Even the strongest family can be torn apart by tragedy-and in the futuristic world of tomorrow, the members of the once-Fantastic Four are divided and vulnerable to opponents from their past. What events could have caused the FF to go their separate ways, and how does their disbanding set the stage for a conflict that will send shockwaves across the galaxy and beyond?\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Heroes Reborn: Fantastic Four (Trade Paperback)": "The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #17": "Hey, what's blue-eyed, rocky orange and in love all over? BEN GRIMM, a.k.a. THE THING! Ol' Benjy's fallen for a girl, and the only thing that could break the spell is...THE ABSORBING MAN!?!?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #16": "When the Titan known as THANOS captures Captain Marvel and uses his cosmic powered Negabands to travel to planet earth, not even the combined powers of the Fantastic Four are enough to stop him! To save the earth they must first save Captain Marvel who is trapped light years away in deep space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 6 TPB (Trade Paperback)": "At last, the Thing returns from the Secret Wars - but he's been replaced in more than just the heart of the team! The FF learn the shocking secrets of their deadliest enemy, and it only costs them everything they hold dear! Plus: Franklin Richards vs. Mephisto! And the Psycho-Man gives the Invisible Girl a makeover neither will ever forget! Guest-starring Daredevil, Spider-Man, Iron Fist and Luke Cage! Collects FANTASTIC FOUR #276-284, THING #23 and SECRET WARS II #2.\r<br>264 PGS./Rated A ...$24.99\r<br>", "Marvel Adventures Fantastic Four (2005) #15": "The Fantastic Four travel to the South Pole to study a newly-discovered species, but find themselves on the front lines of a battle against TERMINUS, the cosmic scavenger! The clock is ticking down toward Armageddon as the FF make their stand against a superior force from outer space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 3: World's Greatest (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on Klaw, the Black Panther, the Molecule Man and Dr. Doom! Collects MARVEL ADVENTURES FANTASTIC FOUR #9-12.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Black Panther (2005) #18": "BRIDE OF THE PANTHER PART 5 The Black Panther and Storm are ready to tie the knot. Prepare for the wedding of the decade!", "Black Panther (2005) #18 (TURNER VARIANT)": "CIVIL WAR Tie-in\r\n\"BRIDE OF THE PANTHER\"\r\nSPECIAL DOUBLE-SIZED ISSUE! It's the Wedding of the Century as T'Challa and Storm finally make it to the altar -- and not since Reed and Sue tied the knot have so many of Marvel's super heroes assembled for such a happy occasion.  Can this gathering offer much-needed respite from the Civil War that's erupted in the U.S., or will it too be engulfed by the insanity that's currently rocking the Marvel Universe?  Don't miss this historic event -- and turning point in the CIVIL WAR.  Featuring backup features, including a look behind the scenes at the creation of Storm's wedding gown, and wraparound cover by Frank Cho!  Part 5 (of 5).\r\n48 PGS./Rated T  ...$3.99", "Civil War (2006) #1 (sketch variant)": "Go behind the lines of the Marvel Comics event starring Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon. This bonus edition reprints CIVIL WAR #1 - plus script, sketches, deleted scenes and more!\r\n64 PGS./ Rated T  ...$4.99", "New Avengers Vol. 2: Sentry (Trade Paperback)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? Collects NEW AVENGERS #7-10 and the NEW AVENGERS: MOST WANTED FILES handbook.\r<br>152 PGS./Rated A ...$14.99\r<br>", "Marvel Adventures Fantastic Four (2005) #14": "While attempting to communicate with extraterrestrials via deep space communication, the Fantastic Four unknowingly gaining the attention of a powerful malevolent alien calling himself the Grand Master. Now each member of the Fantastic Four must battle in individual competition as the fate of the world hangs in the balance.\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: First Family (2006) #5": "More secrets of the FF's earliest days revealed!  This issue: the Human Torch's first solo adventure (not a raging success)!  Mr. Fantastic's first solo adventure (also not a raging success)!  A team divided!  An enemy uncovered!  Plus, an army of cosmically-mutated monsters!  What more could you ask for?\r<br>32 PGS./Rated A ...$2.99\r<br>", "Last Planet Standing (2006) #5": "Is this the end of the MC-2 Universe? The sequel to last year's surprise hit concludes and it's all-out action in the merry Marvel manner as...\r<br>Determined to evolve, Galactus prepares to sacrifice the Earth and the entire universe! An army of Mainframes take on a horde of Punisher robots!  The Silver Surfer unleashes his full cosmic fury against his former master!  The last heroes standing make their final assault on the planet-eater!  And Spider-Girl and a few friends take a desperate, perhaps fatal, gamble to save their world and the universe entire!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four (1998) #538": "CIVIL WAR TIE-IN! One member of the FF lies hospitalized, a casualty of the CIVIL WAR that's fragmented the superhuman community! And another member of the team is secretly helping the opposition...even though the consequences will tear the first family of the Marvel Universe apart!", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Last Planet Standing (2006) #4": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #13": "The space-faring Fantastic Four discover an amazing new planet! One race of aliens rules another on the surface of this strange world, but in space, things are not always as they appear. High adventure, super hero action and science fiction collide in this tale of a world gone bonkers!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Last Planet Standing (2006) #3": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99", "Fantastic Four: First Family (2006) #4": "More untold secrets of the FF's earliest days revealed!  See Reed move the team into the newly-built Baxter Building -- and see the Thing's less than thrilled reaction!  Meanwhile, the FF's first villain -- unknown until now -- finally makes his move!  But will the fledgling team disintegrate before they get to confront him?  Of course not, but order the book anyway...!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Last Planet Standing (2006) #2": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Last Planet Standing (2006) #1": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #12": "Monster Garage has nothing on Johnny Storm when he rebuilds Reed's old college ride as the hottest rod on Earth! FF villains hate eating rubber, but fans love the car. Unfortunately, a European Repo Man takes the vehicle back to its original owner in LATVERIA...\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: First Family (2006) #3": "The untold tale of the FF's first adventure continues!  Ever wonder if any of the Mole Man's monsters followed the FF back to New York City after their first encounter with them?  Neither did the FF... and that mistake leads to a very public demonstration for the fledgling super hero team.  Plus, Ben Grimm's first visit back to Yancy Street (it ain't pretty!), and the FF's first headquarters (it wasn't the Baxter Building!).\r<br>32 PGS./Rated A ...$2.99\r<br>", "Civil War (2006) #1": "THE LANDSCAPE OF THE MARVEL U IS CHANGING AND IT'S TIME TO DECIDE: WHOSE SIDE ARE YOU ON? A conflict has been brewing in the Marvel Universe, threatening to pit friend against friend, brother against brother--and all it will take is a single misstep to cost thousands their lives and ignite the fuse!  As the war claims its first victims, no one is safe as teams, friendships, and families begin to fall apart. Starring Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon!", "Civil War (2006) #1 (Turner Variant)": "THE LANDSCAPE OF THE MARVEL U IS CHANGING AND IT'S TIME TO DECIDE: WHOSE SIDE ARE YOU ON?  \r\nA conflict has been brewing in the Marvel Universe for over a year, threatening to pit friend against friend, brother against brother--and all it will take is a single misstep to cost thousands their lives and ignite the fuse!  As the war claims its first victims, no one is safe as teams, friendships, and families begin to fall apart.  Civil War, a Marvel Comics event in seven parts, stars Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon!  Civil War - the cross-over that rewrites the rules - begins here in this double-sized first issue!\r\n48 PGS./Rated T  ...$3.99", "Fantastic Four: First Family (2006) #2": "More secrets are revealed in the early days of the Fantastic Four in this stunningly-illustrated series!  As the cosmically irradiated foursome answers their first call to action, Reed Richards ensures that he and his friends don't end up as government lab rats.  But will Sue, Johnny and Ben go along with his plans?  Plus, the secret of the FF's first adversary (hint: it wasn't the Mole Man!).\r<br>\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #11": "He's not so tough... he just has complete control of EVERYTHING  on an elemental level. Oh, and he can take over the body of anyone in the world without even being nearby. That's all. How in the world are the FF going to stop THE MOLECULE MAN???\r<br>\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 2: Fantastic Voyages (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they meet and defeat stampeding prehistoric creatures, the subterranean Mole Man and Namor, the Sub-Mariner - and embark on a journey through time and space! Collects MARVEL ADVENTURES FANTASTIC FOUR #5-8.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Marvel Adventures Fantastic Four (2005) #10": "War-drums are beating as four heroes work their way through the most mysterious jungle in Africa. An international misunderstanding has brought them here to be hunted by a shadowy figure who has uncanny skill and the technological might of the world's most advanced nation at his disposal. Will the Fantastic Four make it back from Wakanda, and will they be friends or prey for the man known in whispers as... THE BLACK PANTHER!?\r<br>32 PGS./All Ages ...$2.50\r<br>", "Fantastic Four: First Family (2006) #1": "For the first time, untold secrets of the FF's earliest days are revealed!  What happened the moment after Reed Richards' rocket crash landed?  What happened -- to Sue Storm, to Ben Grimm, to Johnny Storm -- in the days following that fateful event?  An in-depth, action-packed, psychologically thrilling exploration of the FF's origin begins here! \r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #9": "Can you hear him coming? It's KLAW, the Master of Sound! He's hit the Big Apple with a sound-proof plan to defeat the Fantastic Four: Divide and conquer, taking them on a one at a time! Can Ben, Reed, Johnny and Sue band together and mute Klaw's attacks...or will they fade into white noise?\r<br>\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "New Avengers Vol.2: Sentry (2006)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? \r\nCollects NEW AVENGERS #7-10, and the New Avengers Most Wanted Files.\r\n152 PGS./RATED A ...$19.99", "Marvel Adventures Fantastic Four (2005) #8": "Join Reed, Johnny, Sue and Ben on a journey through time and space! Lockjaw, everybody's favorite teleporting puppy, has the sniffles, and his malfunctioning powers take our Favorite Fighting Family up, down and around the universe, with no promise of returning to earth! Can Mr. Fantastic come up with a doggy cold medicine before they go careening into a black hole?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Knights 4 Vol. 4: Impossible Things Happen Every Day (Trade Paperback)": "Four tales of the Four! First, when two Inhuman children seek asylum with the Fantastic Four, old alliances are threatened and friends stand now as enemies! Next, when Reed forget their anniversary yet again, it's up to Sue's best girlfriends -- Alicia, Crystal and the Sensational She-Hulk -- to cheer her up with a night out on the town... Marvel style!  Then, on Yancy Street, someone -- or something -- is putting the hurt on the neighborhood's tough guys. Ben Urich, Jessica Jones and the Thing are on the case, but what exactly is the nature of the threat they're facing? And finally, one of the Marvel U's most powerful entities -- the reality-bending Impossible Man -- pops up to cause havoc in this offbeat tale that blurs the line between fact and fiction, men and myth! Collects MARVEL KNIGHTS 4 #19-24.\r<br>144 PGS./ Rated T+ SUGGESTED FOR TEENS AND UP ...$14.99\r<br>ISBN: 0-7851-1808-X\r<br>", "Marvel Adventures Fantastic Four (2005) #7": "The Fantastic Four have encountered big menaces, but the ego of the Submariner may be their hugest foe yet! The monarch of the seas seeks a bride, and has set his sights on the world's most Fantastic girl!\r<br>\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "Fantastic Four: The Wedding Special (2005) #1": "A true Collector's Item celebrating one of the greatest events in comics history - the marriage of Reed Richards and Sue Storm! Hard to believe they tied the knot 40 years ago... and it certainly doesn't seem that much time has passed to Reed and Sue themselves when a special evening out gives them a chance to look over their entire life together - past, present and future - in an all-new 30-page story by Karl Kesel and Drew Johnson. Also included as an added bonus: Reed and Sue's original 1965 wedding extravaganza, guest-starring the Avengers, X-Men, Spider-Man and a cast of thousands - an epic that could only be told by Stan Lee and Jack Kirby! So, like all great weddings, this Special mixes something old (The original Lee/Kirby FF Wedding Spectacular) with something new (\"The Life Fantastic\" by Kesel/Johnson) - even though there's nothing borrowed, and the only thing blue will be any fan who misses this once-in-a-lifetime opportunity!\r<br>64 PGS./T+ SUGGESTED FOR TEENS AND UP ...$4.99\r<br>", "Marvel Adventures Fantastic Four (2005) #6": "Underground action rules the day when the Fantastic Four go head-to-head with the Mole Man!  Strange tentacles and other weird stuff has been popping out of the New York City streets.  The FF want to get to the bottom of it-literally!  But when they tunnel to the Mole Man's subterranean territory, even more fantastic surprises are in store...  \r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Daredevil Vol. V: Out (Trade Paperback)": "A down-on-his-luck FBI agent has sold the hero's most guarded secret to a tabloid newspaper, exposing Daredevil's identity to the entire world. How far will the Man Without Fear go to reclaim his life?", "Marvel Adventures Fantastic Four (2005) #5": "The Human Torch is chasing a Pterodactyl around the Chrysler Building. A Brontosaurus is dragging The Thing down 5th Avenue. The Invisible Girl is trying to make a Tyrannosaurus stop chewing on her husband. Dinosaurs have come to New York, and they're not planning on going extinct this time! \r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #4": "The Fantastic Four don't feel so fantastic when their powers start failing-right when a Sentinel has decided to target them! It's not all bad though; at least Johnny has a cool new girlfriend. Or is all this connected somehow...?\r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #3": "A doctor is becoming famous for his seeming ability to cure patients of terrible diseases.  Nobody's sure how he does it, but everyone is fascinated by what seems to be a \"healing touch.\"  When the mysterious doc crosses paths with the scientific mind of Reed Richards, the FF are in for some surprises they never bargained for--and the adventures are just beginning!\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "Fantastic Four: Foes (Trade Paperback)": "The foes of the Fantastic Four take center stage! After years of continued defeat at the hands of the FF, why would a person still attempt something he has learned to be impossible? Get inside the heads of all your favorite FF foes as we watch their capers from start to finish from their perspective, their point of view, and at last learn...what were these guys thinking? Collects FANTASTIC FOUR: FOES #1-6.\r<br>144 PGS./Marvel T+ &#8230;$16.99\r<br>", "Marvel Adventures Fantastic Four (2005) #2": "When a rampaging alien from another dimension runs amok in New York City, there's only one thing to do-call in the Fantastic Four!  But what happens if they're the ones responsible?  Find out in this all-new FF adventure!\r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "4 (2004) #20": "INHUMANE\r<br>The conflict between the Family Fantastic and the Inhumans heats up with Black Bolt and Medusa's arrival on Earth. Sue is determined to keep the two Inhuman runaways safe no matter the cost, but with the rest of the FF wondering if they should even be involved in this dispute, what possible hope do she and the alien children have?   Part 2 [of 2]\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>", "Best of the Fantastic Four Vol. 1 (Hardcover)": "Follow the FF from their original adventure to the height of their success! Caught in a mental maelstrom of alien enemies! Trips into the Negative Zone, Subterranea and the soul of Ben Grimm! The triumph and tragedy of Mr. Fantastic! The Thing vs. the Thing! And who will be the last hero standing in the ultimate war...of practical jokes? Featuring Dr. Doom, Dr. Octopus, the Impossible Man, Daredevil and more! Collects FANTASTIC FOUR #1, #39-40, #51, #100, #116, #176, #236, and #267; FANTASTIC FOUR (Vol. 3) #56 and #60; MARVEL FANFARE #15; MARVEL TWO-IN-ONE #50; and MARVEL KNIGHTS 4 #4.\r<br>360 PGS./MARVEL PSR ...$29.99\r<br>", "Fantastic Four (1998) #527": "\"DISTANT MUSIC\" - A NEW ARC BEGINS HERE!\r<br>Just in time for movie season, new ongoing creative team J. Michael Straczynski (AMAZING SPIDER-MAN, SUPREME POWER) and Mike McKone (Teen Titans, EXILES) unite their talents to chart a new course for the world's greatest comic magazine! First up: an intriguing offer for a conflicted Reed, and a windfall for Ben!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: The Movie (2005) #1": "The comic adaptation of the blockbuster motion picture starring Ioan Gruffudd, Michael Chiklis, Jessica Alba, Chris Evans and Julian McMahon, this collection captures all the cinematic excitement of the new hit movie - plus a selection of the classic stories that inspired the film! Forty years ago, writer Stan Lee and artist Jack Kirby created a team of adventurers like no other that had come before. Unlike previous groups of stone-jawed super heroes who got along perfectly in their pursuit of liberty and justice, the Fantastic Four bickered, argued and fought among themselves - just like a real family. Their continued adventures around the world, into outer space and throughout uncharted dimensions have pushed the limits of the Marvel Universe, consistently challenging readers' perceptions of what a comic book could be!\r<br>120 PGS./T+ Suggested for Teens and Up ...$12.99\r<br>", "Essential Fantastic Four Vol. 4 (Trade Paperback)": "Relive more of the FF's classic exploits as they stand united against Dr. Doom, Annihilus and Galactus! Featuring the first appearances of the Kree and the microversal Psycho-Man! Guest-starring Spider-Man, Daredevil, Thor and the Warlock formerly known as Him! Lee and Kirby were the ones who started it all, and they kept it going in these cosmic tales! Collects FANTASTIC FOUR #64-83 and ANNUAL #5-6.\r\n536 PGS./All Ages ...$16..99", "4 (2004) #19": "\"Inhumane\" Part 1 (of 2)\r<br>The Inhumans live by their own rites and rituals, their own laws and governances. But when two Inhuman children seek asylum with the Fantastic Four, battle lines are drawn and an inter-species war threatens to erupt!  Old alliances are threatened and friends stand now as enemies!\r<br>32 PGS./T+ Suggested for Teens and Up ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #1": "All adventure, all action, for all ages!  Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits.  When the world-renowned heroes happen upon some children in distress, they naturally rush to the rescue!  But not everything is as it seems, and the Fantastic Four are in for much more than they bargained for. \r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "FANTASTIC FOUR VISIONARIES: GEORGE PEREZ VOL. 1 TPB (Trade Paperback)": "Before his cross-company fame for Disturbing Crises and Avenger Adventures, Perez put the World's Greatest Super-Team through its paces - and first up was a fight with a fabulous fifties favorite! The Thing gets replaced in the FF, but who's replacing Mr. Fantastic in...the Frightful Four? Also featuring the Incredible Hulk, Luke Cage, the High Evolutionary and costumed characters never seen before or since! Collects FANTASTIC FOUR #164-167, #170, #176-178, #184-186.\r<br>200 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>", "X-Men/Fantastic Four (Hardcover)": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding adventure! Can the two teams put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence? Even as the heroes trek into the stars, the real threat to their mission might just be among themselves! It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Collects X-MEN/FANTASTIC FOUR #1-5. \r<br>120 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>ISBN: 0-7851-1520-X\r<br>", "FANTASTIC FOUR/SPIDER-MAN CLASSIC TPB (Trade Paperback)": "Marvel movie stars past and present unite in a series of senses-shattering slugfests for the ages! At the dawn of the Marvel Age, Spider-Man meets the Fantastic Four as the Chameleon strikes! Also featuring a battle royal with the Frightful Four! The first appearance of the future New Mutant known as Karma! The villainy of Dr. Doom! A date with Invisible Girl! When comics' first family and everybody's friendly neighborhood wall-crawler get together, chaos is sure to ensue! Collects AMAZING SPIDER-MAN #1; SPECTACULAR SPIDER-MAN #42; FANTASTIC FOUR #218; MARVEL TEAM-UP #100, 132-133; and UNTOLD TALES OF SPIDER-MAN '96.\r<br>152 PGS./Marvel PSR ...$16.99\r<br>", "Marvel Adventures Fantastic Four (2005)": "Marvel Adventures launches it's new Fantastic Four series with an all new, action-packed premier issue!  New York City is throwing a parade in honor of their favorite first family, but it looks like rain is in the forecast in the form of Dr. Doom!  Will MR. FANTASTIC, THE INVISIBLE WOMAN, THE HUMAN TORCH and THE THING be able to save the day and keep Times Square as clean as an all ages comic?  Find out in this specially priced opening issue!\r<br>32 PGS./ ALL AGES ...$1.99\r<br>", "Fantastic Four (1998) #524": "This is it! The Waid/Wieringo team go out with a bang --but they have one last surprise up their sleeves as the foundation of the team is rocked one final time.  If you're hungry for one last jaw-dropping plot twist, here it is--and it's a doozy!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: Foes (2005) #4": "The Mole Man is BACK!  He's out to get revenge for all the times he's been defeated.  Now the Fantastic Four are face to face with one of the most deadly foes of their past, and it's all part of Reed's plan.\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Ultimate Fantastic Four (2003) #17": "N-ZONE PART 5 With Sue caring for the ailing Human Torch back on the Fantastic Four's spaceship, it's up to Reed and Ben to take out Annihilus!", "Avengers Assemble Vol. 2 (Hardcover)": "The European country of Slorenia is dead. Every man, woman and child, eliminated with the cold precision of a machine. And out of the flaming remnants of this tiny Baltic state comes a message from its murderer: Mankind's days are numbered...because Ultron has returned! He - or it - is one of the Avengers' oldest, most implacable foes, menacing humanity countless times. But never before has Ultron been this dangerous, this deadly. Now, he stands on the brink of committing global genocide, and rebuilding Earth in his own robotic image. Our only hope is a desperate U.N. strike on Slorenia, led by the Avengers themselves. But will it be in time? Will the strength and courage of Earth's Mightiest Heroes be enough in the face of such overwhelming evil? For the sake of the world, it will have to be! Plus: When you're an Avenger, you're one of Earth's Mightiest Heroes - the first line of defense against the dangers no conventional foe could halt, the threats no ordinary man could withstand. Threats including Dominex, Lord Templar, Pagan and the Thunderbolts! Collects AVENGERS #12-22, #0 and ANNUAL 1999\r<br>336 PGS./Marvel PSR ...$29.99\r<br>ISBN: 0-7851-1773-3\r<br>", "Fantastic Four Vol. 2 (Hardcover)": "It seemed like a simple enough idea at the time: Now that their arch-enemy, Doctor Doom, had seemingly perished, the Fantastic Four would journey into his nation of Latveria, disassemble its war machine and set its oppressed citizens free. But what appeared to be a black-and-white situation quickly turns a murky shade of gray, and Reed Richards and his family find themselves besieged on all sides - both by those they thought of as their allies, and by the very people they are trying to save. And in the awful aftermath of their authoritative action, three of the Four must contend with the defenses of the afterlife - and storm the gates of Heaven itself to rescue a fallen teammate. They've faced Galactus, the destroyer of everything. Now, they face the creator of everything, as the FF are reunited in the hereafter. Plus: The Fantastic Four have a lot to answer for - and when you're trying to regain the trust of cynical New Yorkers, is associating with a certain misunderstood wall-crawler really a wise move? Collects FANTASTIC FOUR #503-513.", "Marvel Age Fantastic Four Tales (2005) #1": "The Fantastic Four cross the globe to meet the BLACK PANTHER and help him battle his lifelong nemesis - Klaw! A modern retelling of a classic story by Stan Lee and Jack Kirby, great for all ages!", "4 Vol. 2: The Stuff of Nightmares (Trade Paperback)": "While New York freezes in the icy grip of winter, an old foe resurfaces with a grudge: Namor! And the crown prince is demanding Sue make good on an old promise - even if it's over Reed's dead body. Meanwhile, closer to home, Johnny may be the only person who can help a Washington Heights woman find her missing son. Plus: Something very, very strange is happening to New York's First Family of Super Heroes. Their deepest fears and doubts are spreading from their dreams - their unconscious minds - to the waking world. What's real and what's not? The FF's old villain Psycho-Man may hold the key, but he's...dying?! Collects MARVEL KNIGHTS 4 #8-12.", "Marvel Masterworks: The Fantastic Four Vol. 8 (Hardcover)": "Pony up, True Believer, the amazing eighth manic Masterworks featuring the First Family of Funnybooks is coming your way! Collecting an ironclad cadre of consecrated classics, this one's packed with more drama than you can shake a Skrull at! \r<br>Let's break it down: the Silver Surfer pursued by none other than the world-devouring Galactus; the FF vs. Spidey, DD and Thor in a barnstorming brouhaha; a fantastic voyage into the Microverse to battle the Psycho Man; the Thing-cured!; the first appearance of Annihilus; Crystal, the Inhuman, joins the FF, and one of comics' most historic moments, the birth of Franklin Richards-it just doesn't stop!\r<br>This one's a humdinger so chock-full of excitement it's ready to burst! And it's all brought to you by no less than the minds that made Marvel magnificent, Stan and Jack! 'Nuff Said!\r<br>Collecting FANTASTIC FOUR (VOL. 1) #72-81 and ANNUAL #6\r<br>272 PGS./All Ages ...$49.99\r<br>", "Fantastic Four Vol. 3 (Hardcover)": "This deluxe hardcover completes the collection of Waid and Ringo's run, re-presenting the stories from FANTASTIC FOUR VOL. 5: DISASSEMBLED and FANTASTIC FOUR VOL. 6: RISING STORM! In DISASSEMBLED, Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft -- and that's just the beginning! With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them -- but where to even start? And which member of the team will make a decision that will radically change the Fantastic Four for some time to come? Also: Witness the genesis of an all-new, all-twisted Frightful Four! And in RISING STORM, Galactus's worst Herald ever is running out of time! So far, Johnny Storm has been able to stall Galactus from sating his cosmic hunger -- but that luck won't hold forever. What planet will be chosen as Galactus's next victim? The reintroduction of a fan-favorite Marvel Universe hero into the battle may have caused more problems than it solved, because not even he can save the Fantastic Three from Johnny's newfound might! Who will live, who will die and how will Johnny ever be the same now that he's tasted the Power Cosmic? Collects FANTASTIC FOUR #514-524. \r<br>256 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Fantastic Four (1998) #520": "\"GALACTUS\" PART 1 (OF 6)\r<br>No answers here, intrepid fans - all we'll say is this: no matter what your guess, we promise you'll be surprised by the answer!\r<br>", "Fantastic Four Visionaries: John Byrne Vol. 3 (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues! Featuring a four-part epic deep within the Negative Zone -- and the death of...Reed Richards?! Plus: Galactus devours the Skrull homeworld, and the Fantastic Four say goodbye to the Baxter Building! Guest-starring the Avengers! Collects FANTASTIC FOUR #251-257 and ANNUAL #17, AVENGERS #233, and THING #2.", "X-Men/Fantastic Four (2004) #1": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding limited series! Can the X-Men and the Fantastic Four put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence?! Join megawatt creator Pat Lee and writer Akira Yoshida (THOR: SON OF ASGARD) for mutant meyham and fantastic fights!", "Fantastic Four (1998) #519": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" FINALE! PART 3 (OF 3) Galactus the World-Eater is coming to Earth to choose one of the Fantastic Four as his new herald -but which one?  The consequences of his choice will set the tone and scope of the series, a", "Ultimate Fantastic Four (2003) #13": "N-ZONE PART 1 The Fantastic Four must travel to the N-Zone to discover the secret of their phase-state transformations. If they can find what they're looking for, Reed might be able reverse the transformation process!", "4 (2004) #12": "\"THE STUFF OF DREAMS\" PART 3 (OF 3)\r\nEvery dream must come to an end-even the fear-induced nightmares that Psycho-Man is spreading across Manhattan!  It's the climax to the first year of Marvel Knights 4 and the final showdown between the FF and their reality-warping foe.  Hold onto your seats - especially you slight Marvelites - that wind blowing is a radical shift in the status quo of Marvel Comics' First Family of super heroes and adventurers!", "Fantastic Four (1998) #518": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 2 (OF 3) With public opinion of the FF at an all-time low and with all of Manhattan endangered by a mysterious alien overlord, which member of the team will make a decision that will radically change the Fan", "4 (2004) #11": "\"THE STUFF OF DREAMS\" PART 2 (OF 3) With a diseased Psycho-Man loose somewhere in the city, the very fabric of New York's reality is unraveling at a frightening rate. While Susan hunts their old foe, the rest of the Fantastic Four try to stem the tide of", "Fantastic Four (1998) #517": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 1 (OF 3) The FF goes \"widescreen\" in a tale of epic scope and proportion as Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft--and that's just the beginning!  With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them--but where to even start?", "4 (2004) #10": "\"THE STUFF OF DREAMS\" 1 (OF 3) Something very, very strange is happening to New York's First Family of Super Heroes. Their deepest fears and doubts are spreading from their dreams - their unconscious minds-to the waking world. What's real and what's not?", "Fantastic Four (1998) #516": "\"DYSFUNCTIONAL\" PART 3 (OF 3) The final showdown with the all-new, all-twisted Frightful Four -- and the shocking secret of their newest member could destroy both teams! ", "4 (2004) #9": "\"FROZEN\" PART 2 (OF 2) As the mercury continues to plummet, Reed and Namor's conflict escalates further, catching Sue in the crossfire. Will these longtime rivals be able to put aside their differences to help Johnny and a team of rescuers find a woman's lost son? Or will their city-spanning battle end in final checkmate?", "Marvel Masterworks: The Fantastic Four Vol. 7 (Hardcover)": "\"The First Family of Super Heroes ushers in a new era of Marvel Masterworks with the addition of Fantastic Four Vol. 7 to the Masterworks Library! Showcasing the unmatched team-up of Stan Lee and Jack Kirby, this edition is a must-have! Hold on to your seats, True Believers, as the F.F. battle Blastaar, the Living Bomb-Burst, the Sandman, Ronan the Accuser and more! Also featuring the Silver Surfer, the incomparable Inhumans and the first appearance of Him, the man later to be known as Adam Warlock! Collecting Fantastic Four (Vol. 1) #61-71 and Annual #5.\"", "Fantastic Four (1998) #515": "An alternate dimension version of the Fantastic Four may scuttle any chance the FF ever has of redeeming its reputation!", "4 Vol. 1: Wolf at the Door (Trade Paperback)": "Comics' first family face their most personal and unpredictable crisis yet in this edgy MARVEL KNIGHTS series. Writer Roberto Aguirre-Sacasa and rising-superstar artist Steve McNiven pit the Fantastic Four against a challenge the likes of which they've never faced, and to overcome it they'll need to call on the same humor, determination and family bonds that have delivered them from danger time and time again. This is the FF ... the 4 ... like you've never seen them before!", "Fantastic Four (1998) #514": "\"DYSFUNCTION\" PART 1 (OF 3) At an all-time low, the Fantastic Four are confronted by a cracked-mirror version of their own team -- one that may scuttle any chance the FF ever has of redeeming its reputation!", "4 (2004) #8": "\"FROZEN\" PART 1 (OF 2) While New York freezes in the icy grip of winter, an old foe resurfaces with a grudge: Namor!  And the crown prince is demanding Sue make good on a old promise--even if it's over Reed's dead body. Meanwhile, closer to home, Johnny may be the only person who can help a Washington Heights woman find her missing son.", "Avengers Assemble (Hardcover)": "\"The Avengers embark on one of their strongest eras ever! Kurt Busiek and George Pérez have renovated the comic-book field with such works as Astro City and New Teen Titans, respectively; now, see their take on Earth's Mightiest Heroes. Fresh from the Heroes Reborn fiasco, the Avengers find themselves thrown into yet another alternate reality, under the power of Morgan Le Fay! Meanwhile, on the home front, the Squadron Supreme challenges their very identities! Collects AVENGERS #1-11 and ANNUAL '98.\"", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 2 TPB (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues as the FF face off against two of their greatest foes: Galactus and Doctor Doom! Guest-starring the Black Panther, Thor, Spider-Man, Iron Man, Daredevil, Doctor Strange, the Inhumans, the X-Men and more! Collects FANTASTIC FOUR #241-250.", "Fantastic Four Vol. 1 (Hardcover)": "\"A team -- and a family -- of adventurers, explorers and imaginauts, the Fantastic Four live lives both ordinary...and extraordinary. Now, Reed Richards, Sue Richards, Benjamin Grimm and Johnny Storm blast into this fully loaded, oversized hardcover -- featuring an entire year's worth of the World's Greatest Comic Magazine and more than 30 pages of ever-lovin' extras! Finally, learn the truth behind Mister Fantastic's decision to cast his friends as the greatest squad of superhuman adventurers ever assembled; see the Fantastic Four face off against a sentient mathematical equation driven mad by love, an infestation of insects from another dimension, a cascading wave of molecular instability and a teammate on a homicidal rampage; and bear witness to history in the making as Doctor Doom does...the unthinkable. Collects FANTASTIC FOUR #60-70 and #500-502.\"", "4 (2004) #6": "\"THE PINE BARRENS\" PART 2 (OF 3) A family camping trip to the pristine Pine Barrens takes a terrifying twist when a group of extraterrestrial terrors turn their hungry eyes on the most powerful family on the planet!", "Fantastic Four (1998) #513": "\"SPIDER SENSE\" PART 2 (OF 2) It's a sad day to be the Human Torch, when your popularity has sunk so low even the web-slinger is more beloved by the people of New York City! Plus: Who is the woman from Reed Richards' past?", "4 (2004) #5": "pt. 4\r\nThe FF are still feeling the aftershocks of having had their world turned upside down - and Reed finds himself drawing strength from the memory of one of the greatest men he's ever known: his grandfather. \r\n32 PGS./MARVEL PSR...$2.99", "Fantastic Four (1998) #512": "pt. 1 (of 2)\r\nThe FF have a lot to answer for in the aftermath of AUTHORITATIVE ACTION ... and when you're trying to regain the trust of cynical New Yorkers, is allying with a certain misunderstood wall-crawler a wise move?\r\n32 PGS./MARVEL PSR...$2.25", "4 (2004) #4": "pt. 4\r<br>The FF are still feeling the aftershocks of having had their world turned upside down - and Reed finds himself drawing strength from the memory of one of the greatest men he's ever known: his grandfather. \r<br>32 PGS./MARVEL PSR...$2.99\r<br>", "Fantastic Four (1998) #511": "They've faced the destroyer of everything - Galactus. Now they face the CREATOR of everything, as the Fantastic Four are reunited - in the HEREAFTER!", "4 (2004) #3": "Metal-faced despots, intergalactic deities, and subterranean savages couldn't destroy the FF, but will Marvel's first family be torn apart by the most human threat it's ever faced?\r\nPlus: A classic knockdown, drag-'em-out brawl between The Thing and The Human Torch!", "Fantastic Four (1998) #510": "Having embarked on the ultimate journey, Reed Richards and the rest of the FANTASTIC THREE must contend with the defenses of the afterlife - and storm the gates of Heaven itself!\r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #509": "\"HEREAFTER\" pt 1 (of 3)\r\nNo, not a misprint! The regular creative team readers demanded is \"back\" for good as the Fantastic Three embark on their greatest adventure yet by storming a 'fantastic' realm brand new to even them. They've heard of it of course, but have never there before! \r\nAnd yes ... the FANTASTIC THREE!\r\n32 PGS./MARVEL PSR...$2.25", "4 (2004) #2": "Comics' first family face their most personal and unpredictable crisis yet in this debut of their new edgy MARVEL KNIGHTS ongoing series. Writer Roberto Aguirre-Sacasa and rising-superstar artist Steve McNiven pit the Fantastic Four against a challenge the likes of which they've never faced, and to overcome it they'll need to call on the same humor, determination and family bonds that have delivered them from danger time and time again.\r<br>This is the FF ... the 4 ... like you've never seen them before!\r<br>32 PGS.(each)/MARVEL PSR...$2.99", "4 (2004) #1": "Comics' first family face their most personal and unpredictable crisis yet in this debut of their new edgy MARVEL KNIGHTS ongoing series. Writer Roberto Aguirre-Sacasa and rising-superstar artist Steve McNiven pit the Fantastic Four against a challenge the likes of which they've never faced, and to overcome it they'll need to call on the same humor, determination and family bonds that have delivered them from danger time and time again.\r\nThis is the FF ... the 4 ... like you've never seen them before!\r\n32 PGS.(each)/MARVEL PSR...$2.99", "Fantastic Four (1998) #508": "\"AUTHORITATIVE ACTION\" CONCLUDES!\r\nIt's Armageddon from without and within as Nick Fury and S.H.I.E.L.D.'s peacekeeping forces besiege the FF and Latveria, and Marvel's First Family is simultaneously besieged by an evil at the heart of their own team! \r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #507": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Fantastic Four (1998) #506": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Fantastic Four (1998) #505": "\"AUTHORITATIVE ACTION\" pt. 3 (of 6)\r\nAs American forces mass on the border of Latveria, the Fantastic Four are named traitors to the United States!\r\n32 PGS. /MARVEL PSR...$2.25", "X-Men Legends Vol. III: Arthur Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.", "X-Men Legends Vol. 3: Art Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.\r\nCollects NEW MUTANTS SPECIAL EDITION #1; X-MEN ANNUALS #9-10, 12; FANTASTIC FOUR #347-349.", "Spider-Man’S Tangled Web Vol. 4 (Trade Paperback)": "What's it like to live in a world where Spider-Man swings overhead? Find out as some of the comic book industry's most unique creators explore various city-dwellers, both super-powered and not, whose lives are changed when the wall-crawler leaps into their lives.\r\nCollecting SPIDER-MAN's TANGLED WEB #18-22 & PETER PARKER: SPIDER-MAN #42-43", "Daredevil (1998) #34": "Now that the cat is out of the bag, will Matt Murdock continue to protect Hell's Kitchen?", "Fantastic Four: 1234 (2001) #4": "\"Prime Mover\" Learn the terrible history of Reed Richards and see Doom's plan revealed in all its horrible glory. Prepare for a game of robot annihilator chess on the planes of reality and the great metaphysical beyond!", "Fantastic Four: 1234 (2001) #3": "\"Darkness & The Mole Man\" Doom has crushed another member of the Four. Alicia is trapped in the subterranean caverns of the Mole Man, with only Johnny Storm to save her. But Namor has extinguished the Human Torch-can Storm still summon the flame?!", "Fantastic Four: 1234 (2001) #2": "\"Staring At The Fish Tank\" Ben Grimm has been transformed and badly wounded. It is rumored that Prince Namor is massing forces at the outskirts of American waters. And Johnny must engage a powerful foe. With Reed still in isolation, who can help?", "Fantastic Four: 1234 (2001) #1": "\"Once Upon a Time On Yancy Street\" When Reed Richards has the \"Deep In Thought\" sign up, the rest of the FF know not to bother him. But the heat is rising in Manhattan and a Doombot has just gone active. A sinister game is afoot!", "Fantastic Four (1998) #44": "The Negative Zone epic ends here!", "Marvel Knights (2000) #6": "Chang Chi battles his evil father's personal assasin.  And surprise guest stars - the Fantastic Four!", "Cable (1993) #79": "The \"Revolution\" event hits Cable! Demonic possessions are flaring up, and it's only a matter of time before all Hell breaks loose! Who are the Undying, and what sinister plan is beginning to unfold?", "Daredevil Vol. II: Parts of a Hole (Trade Paperback)": "Maya Lopez' deaf, but capable of assimilating an individual's fighting style on sight' has set her sights on Daredevil, who she believes to be responsible for her father's death.", "Daredevil Visionaries: Kevin Smith (Daredevil Vol. I: Guardian Devil) (Trade Paperback)": "Daredevil's notion of faith is tested when a mysterious baby winds up on his doorstep. Following the death of his longtime lover, Daredevil must find the strength to continue.", "Earth X (1999) #7": "Banner and Thor are betrayed as Ben Grimm is recruited for the war against the Red Skull!", "Earth X (1999) #3": "Spider-Man is out of shape and has no sense of responsibility.  Reed Richards has doned Doctor Doom's armor.  Who can save America from the teenage Red Skull?", "Daredevil (1998) #8": "Matt attends the funeral of Karen Page. Foggy's name is cleared and he's released from prison. And the fate of the mysterious child is revealed... Featuring, Spider-Man!", "Earth X (1999) #2": "Learn the final fate of the Fantastic Four in their final battle against Doctor Doom and Namor!", "Avengers (1998) #11": "Wanda has been captured by the Unliving Legion! Meanwhile, the Grim Reaper casts a magic force wall around Central Park and the Avengers. Can Wanda free herself in time to aid her teammates?", "Avengers (1998) #10": "Wanda delves into her past to learn how to fully resurrect Wonder Man. Meanwhile, at the Avengers Parade, the proceedings are interrupted by the Grim Reaper and the Legion of the Unliving.", "Avengers (1998) #1": "The Avengers are reunited! As the founding members come together to discuss the recent wave of attacks on former teammates, Thor interrupts the proceedings with grave news: Asgard is in ruins, the Twilight Sword has been taken...doom awaits Midgard!", "X-Men (1991) #71": "At the Xavier Institute, the X-Men begin a relatively quiet day!", "Fantastic Four (1996) #12": "It's The Fantastic Four versus Terrax, Firelord, and Plasma! And if that wasn't enough, Doctor Doom is waiting in the wings!\n", "Fantastic Four (1996) #11": "During a quiet afternoon in Central Park, The Fantastic Four are attacked by none other than Terrax! Plus, a new member is added to Marvel's Finest Family.\n", "Fantastic Four (1996) #10": "Though Galactus has eaten, he still hungers. Next stop: Earth! Plus, The Fantastic Four and The Inhumans versus Maximus!\n", "Fantastic Four (1996) #9": "The Fantastic Four are the prisoners of The Inhumans! And Galactus' herald makes their way towards Earth!\n", "Fantastic Four (1996) #8": "Get ready for the HEROES REBORN debut of The Inhumans!\n", "Fantastic Four (1996) #7": "Ben Grimm may be recuperating in the hospital, but The Fantastic Four are still on the job! Next stop: The Negative Zone! Featuring The X-Men!\n", "Fantastic Four (1996) #6": "While Alicia Masters waits for Ben Grimm to show up for their date, The Fantastic Four battles The Super-Skrull! Featuring, The Silver Sufer!", "Fantastic Four (1996) #5": "Doctor Doom has captured Ben, Sue, and Black Panther! Can Ben and Johnny rescue their teammates? And just who is Wyatt Wingfoot?\n", "Fantastic Four (1996) #4": "During a scientific mission in Wakanda, an entire group of scientists is wiped out by an unknown force. The Fantastic Four set out to investigate.\n", "Fantastic Four (1996) #3": "To stop Giganto's rampage in New York City, The Fantastic Four joins forces with The Avengers!\n", "Uncanny X-Men (1963) #335": "Apocalypse awakens and consults the Watcher. And Onslaught gathers his minions!", "Incredible Hulk Annual (1976) #20": "The Abomination tells a depressed woman the fairytale version of his life, as well as his unusual origin.", "Fantastic Four (1961) #379": "Ms. Marvel uncontrollably mutates into an even more grotesque version of She-Thing!", "Fantastic Four (1961) #349": "A Skrull stands revealed underneath Monster Island! But what has roped the new Fantastic Four and the entire Skrull army into a confrontation within the Mole Man's secret lair?", "Fantastic Four (1961) #348": "The new Fantastic Four's investigation has taken them all the way to Monster Island, home of the dreaded Mole Man.  Will they find out the truth about the slain FF...or another set of secrets entirely?", "Fantastic Four (1961) #347": "The Fantastic Four are dead!  Long live the new Fantastic Four - Spider-Man, Wolverine, Hulk, and Ghost Rider!? Can they get to the bottom of the FF's demise? And just what do the Skrulls want with this new team?", "Saga of the Sub-Mariner (1988) #12": "The Sub-Mariner tells his side of the story behind his team-up with Doctor Doom. Plus, the saga concludes with the untimely death of Marrina, Namor’s beloved.", "Alpha Flight (1983) #4": "Can Alpha Flight save Marrina from the clutches of the Master of the World, even with the help of the Sub-Mariner and Invisible Girl? And can Aurora be cured of her fractured personalities?\n", "Alpha Flight (1983) #3": "Alpha Flight has set off to find fellow teammate Marrina, but what will become of them when they find a nefarious foe who professes to be the Master of the World?\n", "Alpha Flight (1983) #1": "Introducing Canada's premiere superhero team, Alpha Flight, as they take on the dimensional beast Tundra!\n", "Fantastic Four (1961) #48": "\"The Coming of Galactus\" begins here! As the Fantastic Four struggle to understand what the Silver Surfer's appearance means, they must steel themselves for what's ahead--Galactus, the devourer of worlds!", "Fantastic Four (1961) #30": "Witness the debut of the adept alchemist Diablo. Is this mysterious new superhuman friend or foe? And can he succeed in curing the Thing where Reed failed?\n", "Fantastic Four (1961) #28": "The X-Men guest-star as they and the Fantastic Four face the combined menace of the Puppet Master, Mad Thinker, and the Awesome Android!\n", "Fantastic Four (1961) #27": "The Invisible Girl is kidnapped by Namor the Sub-Mariner, Prince of Atlantis! The remaining members of the Fantastic Four enlist the aid of Doctor Strange to expedite their rescues efforts!\n", "Fantastic Four (1961) #26": "The Hulk continues his rampage through New York City, but the Avengers have arrived to challenge their former member. Can the FF and Earth's Mightiest Heroes work together to stop the Jade Giant?", "Fantastic Four (1961) #25": "The battle you've been waiting for! The Incredible Hulk vs. the Ever Lovin' Blue-Eyed Thing! Nuff said!\n", "Fantastic Four (1961) #24": "A strange extra-terrestrial being is wreaking havoc on Earth! The FF must deal with a threat the likes of which they've never faced before: the Infant Terrible!\n", "Fantastic Four (1961) #23": "The diabolical Dr. Doom gathers a new super-villain group, the Terrible Trio! Can the Fantastic Four defeat their greatest nemesis when he's backed by his own team?\n", "Fantastic Four (1961) #22": "The Fantastic Four's first foe returns with a vengeance! The mighty Mole Man's plan is to sink the world's largest cities down to his level, and he already has a plan to deal with the FF!\n", "Fantastic Four (1961) #21": "The enigmatic Hate-Monger uses his hate ray to break up the Fantastic Four! Can Marvel's First Family overcome this mysterious enemy's strange ability? Guest-starring Nick Fury!\n", "Fantastic Four (1961) #15": "The Fantastic Four battle the Mad Thinker and his awesome Android! The Android...neither animal, nor vegetable, nor mineral...what is it?!", "Fantastic Four (1961) #14": "The Puppet Master has gained control over the Sub-Mariner and hatches a plan to finally ensnare and defeat the Fantastic Four.", "Fantastic Four (1961) #13": "More than two hundred thousand miles from Earth, the Fantastic Four face the menace of The Red Ghost!", "Fantastic Four (1961) #12": "General Ross tasks the Fantastic Four with finding and capturing the Hulk. But treachery is afoot and the Hulk sets out to find the real villain of the day...the Wrecker!", "Fantastic Four (1961) #11": "At last the Fantastic Four meet a foe whose power is even greater than theirs! Here is: The Impossible Man!", "Fantastic Four (1961) #10": "Dr. Doom impersonates Reed Richards so that he may use Richards' shrink ray to finally defeat the Fantastic Four!", "Fantastic Four (1961) #9": "When the Fantastic Four go bankrupt, they're invited to S.M. Studios to make the movie about their life in order to recoup their funding. Little do they know that S.M. Studios is owned by one of their greatest enemies!", "Fantastic Four (1961) #7": "The Fantastic Four journey across the cosmos to Planet X. This planet on the edges of spaces needs our heroes help to save it from utter destruction.", "Fantastic Four (1961) #1": "The Fantastic Four spring to action as a team for the first time. As they learn how to control their new found powers, will it be enough to stop the fury of the Mole Man?"}