{"Marvel 2-in-One (2017) #11": " THE FANTASTIC FOUR are BACK! But there’s fallout from their absence, both in the universe and in the family. The THING and MISTER FANTASTIC go on a voyage to rectify mistakes and heal wounds...but is it too late? ", "SILVER SURFER EPIC COLLECTION: THE INFINITY GAUNTLET TPB (Trade Paperback)": "To Infinity and beyond! Follow the sentinel of the spaceways into a Marvel Universe-spanning cosmic extravaganza against the Mad Titan Thanos - who wears the Infinity Gauntlet! Drax battles Firelord, the Surfer fights the Rhino and Thanos forces Norrin to get introspective! But is this dimension big enough for the ultimate duel between the Silver Surfer and the Mad Titan? When the dust settles on Earth, the Surfer heads back into space, only to face Midnight, the Inhumans and the Collector! But how will that lead to him coming face to face with...Captain Mar-Vell? Plus, the Surfer faces the undead, joins Mr. Fantastic on an emergency mission, and takes on the Guardians of the Galaxy in the 26th century! And Nova goes solo! Collecting Silver Surfer (1987) #51-66, Annual #4; material from Marvel Comics Presents (1988) #69, 93-97.", "INFINITY CRUSADE VOL. 1 TPB (Trade Paperback)": "She's come to stop crime across the globe and bring peace to the universe. Captain America and Spider-Man are on her side; Thanos and Mephisto stand against her. So how can she be the bad guy? Jim Starlin's 1990s cosmic collection culminates when the Fantastic Four, the X-Men, the Avengers, the Infinity Watch, the New Warriors and most other super-hero teams of the time are split by a universal crisis...of faith! Also featuring the Mole Man, the Absorbing Man and other classic characters! Collecting INFINITY CRUSADE #1-3, WARLOCK CHRONICLES #1-3 and WARLOCK AND THE INFINITY WATCH #18-19.\r<br>All Ages ...$29.99\r<br>", "Fantastic Four (2014) #7": "ORIGINAL SIN: THE FATEFUL FOUR PART II\nThe FANTASTIC FOUR are being torn apart at their very foundation!\nWill Ben be able to cope with the Original Sin he&#39;s learned about Johnny?\nWill Sue and Reed lose FRANKLIN and the rest of the FUTURE FOUNDATION?\nWill what&#39;s left of the team be able stop their headquarters from being shut down by&hellip;THE AVENGERS?", "Fantastic Four (2014) #6": "EVERYBODY HAS ONE...", "Fantastic Four (2014) #5": "\"THE FALL OF THE FANTASTIC FOUR\" PART 5 - Super-Sized issue!\n- The Baxter Building is quarantined and shut down!\n- The Fantastic Four held accountable for the destruction in Manhattan!\n- A major turning point for the team and a dire blow to the family!\n- The trial of the century featuring an all-star roster of guest artists!", "Fantastic Four (2014) #4": "\"THE FALL OF THE FANTASTIC FOUR\" PART 4\n- FLAME OFF!!! JOHNNY STORM has lost his powers! - The HUMAN TORCH is no more!!!\n- With one member down, a new threat emerges -- the WRECKING CREW...with powers mysteriously elevated to A-level destruction as they team-up with the WIZARD to be a new, devastating version of the FRIGHTFUL FOUR!\n- And as BEN and ALICIA'S romance rekindles, so looms the PUPPET MASTER with dark plans for both of them.\n- All this and the return of FF members ANT MAN, MS. THING and SHE-HULK.", "Fantastic Four (2014) #3": "\"THE FALL OF THE FANTASTIC FOUR\" PART 3\n- The FANTASTIC FOUR were victorious defending Manhattan from inter-dimensional invasion but at a terrible cost!!!\n- Is this \"Flame Off\" forever for the HUMAN TORCH?\n- Introducing a new stronger, deadlier version of the WRECKING CREW!!!", "New Avengers (2013) #15": "<ul><li>Meet the Mapmakers, cartographers of the Apocalypse.</li><li>Doctor Strange sells his soul.</li><li>Reed Richards and the Illuminati rekindle an old relationship.</li></ul>", "Fantastic Four (2014) #2": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 2\n\n\n\n\n\n<ul><li>Manhattan is under attack by a monstrous killer swarm from a corrupted pocket universe, and in order to defeat it the FANTASTIC FOUR will need all their courage, powers and skill...as well as those of every other hero in New York!</li><li>But to attain final victory one of the First Family will must make a TERRIBLE SACRIFICE!</li><li>And so the first strings are pulled and the first pieces are put in place...</li><li>...On the Fantastic Four&#39;s DOWNFALL!</li></ul>", "Fantastic Four (2014) #1": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 1\nThe world&#39;s greatest comics magazine begins anew with Marvel&#39;s First Family, the Fantastic Four! But as the brilliant MR. FANTASTIC, the compassionate INVISIBLE WOMAN, the ever lovin&#39; THING &amp; the hot-headed HUMAN TORCH embark on a strange mission, they aren&#39;t met with new beginnings, but an untimely end! As the family of cosmic explorers head towards their darkest hour, who could possibly be behind their downfall? And how is one of their oldest enemies, the sadistic dragon known as Fing-Fang-Foom involved? Prepare for the fantastic!", "New Avengers (2013) #14": "THE SECRET OF THE BLACK SWAN...", "New Avengers (2013) #13": "INHUMANITY TIE-IN! &ndash; &quot;THE OTHER SIDE&quot;\n\n\n\n\n<ul><li>With the consequences of Infinity fresh on their minds, tough decisions are made.</li><li>The gathering of a new Illuminati.</li><li>We learn more about the other beings related to the Incursions.</li></ul>", "New Avengers (2013) #12": "INFINITY TIE-IN &ndash; &quot;THE WORLD WE HAVE&quot;\nThe House of Black Bolt crumbles.\nNew friends, new enemies.", "New Avengers (2013) #11": "INFINITY TIE-IN &ndash; &quot;BUILDING WORLDS&quot;\r\n\r\n\r\n\r\n\r\n<ul><li>The Illuminati travel to another Earth during an incursion.</li><li>Thanos in Necropolis.</li><li>The Builders on Earth.</li></ul>", "New Avengers (2013) #10": "<ul><li>Inhuman secrets reveal the desires of Thanos.</li><li>The machinations of Maximus the Mad.</li><li>The battle for Earth continues&hellip;what an awful time for an incursion.</li></ul>", "New Avengers (2013) #8": "&quot;LORDS OF CHAOS&quot;\n\n\n\n\n<ul><li>As casualties pile up in the ongoing war between Wakanda and Atlantis, an Illuminati member is forced to make a hard choice.</li><li>An Inhuman learns of the Illuminati&#39;s plans.</li><li>Prelude to INFINITY: Everything falls apart.</li></ul>", "New Avengers (2013) #7": "&ldquo;WHY NOT WAR?&rdquo;\r\n\r\n\r\n\r\n\r\n<ul><li>The cold war between Atlantis and Wakanda heats up.</li><li>Who is the secret member of the Illuminati that many of the members do not know about?</li><li>How does Black Bolt lie?</li></ul>", "New Avengers (2013) #6": "<ul><li>Using the knowledge gained from the Black Swan, the Illuminati rework all their plans and cross the uncrossable line.</li><li>The first secret alliance is formed.</li><li>If an incursion is normally RED, what does a BLUE one mean?</li></ul>", "New Avengers (2013) #5": "&ldquo;BLACK SWAN&rdquo;\r\n\r\n\r\n\r\n<ul><li>Learn the history of the enigmatic Black Swan.</li><li>What answers can she provide the Illuminati?</li><li>And watch as the New Avengers do the unthinkable!</li></ul>", "New Avengers (2013) #4": "&ldquo;WORLD EATER&rdquo;\r\n\r\n\r\n\r\n<ul><li>The Illuminati have learned that Earth is the center point for the death of the Universe.</li><li>If this is true, doesn&rsquo;t that mean destroying it might save everything else?</li><li>Enter the world eater, Galactus.</li></ul>", "New Avengers (2013) #3": "<ul><li>The Illuminati experience their first incursion since reforming.</li><li>Can the loose brotherhood of end times trust each other enough to use the Infinity Gems in unison?</li><li>And a new member joins the Illuminati!</li></ul>", "New Avengers (2013) #2": "The Illuminati gather to plan for the death of everything. Infinity gems, old wounds, lies, agendas and universal incursions are all on the agenda!", "New Avengers (2013) #1": "To prevent the collision of our universe with another, the Illuminati, led by the Black Panther, must assemble NOW! It's the most powerful and brilliant team in the Marvel Universe--The Black Panther, Iron Man, Doctor Strange, Black Bolt, Mister Fantastic, Namor the Sub-Mariner and The Beast--against an infinite legion of parallel realities.", "Amazing Spider-Man: Ends of the Earth (2012) #1": "Spider-Man isn't the only hero fighting to free the globe from Doctor Octopus's treacherous tentacles...what heroes rise to the challenge?", "Fantastic Four (1998) #604": "The epic conclusion of Jonathan Hickman's three year Fantastic Four epic!", "Ff by Jonathan Hickman (Hardcover)": "The War of Four Cities escalates as Black Bolt returns, determined to reclaim his throne. And as the war expands\r\nto encompass the entire Marvel Universe, the Future Foundation is caught in the middle! What does it all mean for\r\nMarvel's First Family? Collecting FF #6-11.", "Fantastic Four (1998) #601": "\"Forever\" Part 2 Finally, It's Clobberin' Time.", "FF (2010) #11": "A galactic empire is born as the War of Four Cities comes to a close. What does it mean for Marvel's First Family?", "Fear Itself: The Fearless (2011) #1": "When Fear Itself is over, the hunt is on! Mystical hammers lay strewn across the entire Marvel Universe and it is Valkyrie's mission to find them, no matter what the cost, and no matter who stands in her way...even if it's Captain America & the Avengers!", "X-Men (2010) #19 (Mc 50th Anniversary Variant)": "\"Betrayal in the Bermuda Triangle\" GUEST-STARRING THE FF! Dr. Doom has betrayed our heroes and sold them out to the evil leaders of the Scorpius people. You know these villains are serious because they took down the X-Men and the FF! The only one who can save them all is... Magneto? The two greatest villains of the Marvel U face off in the climactic conclusion to the dimension spanning story! Part 4 (of 4)", "Fantastic Four: Season One (2012) #1": "In Manhattan's most famous skyscraper, the Baxter Building, scientific genius Reed Richards hatches a plan that will change the lives of those he loves most - and the very course of human history - in a way no one could have ever imagined. Revisit the story that irrevocably altered comics and pop culture in this all-new graphic novel, modernizing the journey of Reed Richards, Susan Storm, Johnny Storm and Ben Grimm as they travel to the stars - and return with fantastic, devastating results! Plus: Witness the FF's cataclysmic first battles with the Mole Man, Dr. Doom and Prince Namor, the mysterious Sub-Mariner, in a way you've never seen before. You only think you know the story! Also features FANTASTIC FOUR #570 by Jonathan Hickman and Dale Eaglesham.\n136 PGS./Rated T+ ...$24.99", "X-Men (2010) #19": "Dr. Doom has betrayed our heroes and sold them out to the evil leaders of the Scorpius people. The only one who can save them all is... Magneto? The two greatest villains of the Marvel U face off in the climactic conclusion to the dimension spanning story!", "FF (2010) #9": "The Future Foundation is caught in the middle of the War of Four Cities. Watch as the war expands to encompass the entire Marvel Universe!", "Marvel Universe Vs. Wolverine (2011) #4": "Even physically and emotionally devastated, Wolverine is determined to hold the line. As allies fall and the cannibal armies increase, who will stand with Logan for the final battle?", "Spider-Island: Spider-Woman (2011) #1": "Jessica Drew and the ever-lovin' Thing go toe-to-toe over the one thing that can cure SPIDER-ISLAND...Ben Grimm's old girlfriend, Alicia Masters?", "Amazing Spider-Man (1999) #669": "SPIDER-ISLAND PART THREE How can the heroes of NYC hope to contain millions of spider-powered New Yorkers?Â Also, a dangerous new role for Venom. And... is that a Six-armed Shocker?! All this plus: one of Spider-Island's biggest mysteries revealed!Â ", "Amazing Spider-Man (1999) #668": "SPIDER-ISLAND PART TWO Spider-powered New York citizens! Spider-powered criminals! And Peter Parker fighting alongside Manhattan biggest super heroes-as Peter Parker?", "Amazing Spider-Man (1999) #667": "THE SPIDER-MAN EVENT OF THE DECADE BEGINS! Start Webbing The News! New York City's Infestation is complete and eight million people are plagued! As someone near to Peter Parker's life reveals their spider-abilities, the brilliantly fearsome Jackal rises from the past and begins organizing an army of Spider-powered  soldiers. Spider-Man isn't the only hero affected as the threat goon grows bigger than any one Fantastically Friendly Neighborhood Avenger can handle. Best-selling Spidey creators Dan Slott and Humberto Ramos spin a Spider-epic that turns Peter Parker's BIG TIME into a BIG MESS.  Bad romance, death-defying violence and one man facing his FINAL fearsome destiny... this one's got it all! Simply put, pal....YOU NEED THIS!", "Amazing Spider-Man (1999) #666": "THE SPIDER-MAN STORY OF THE DECADE BEGINS WITH THS \"SPIDER-ISLAND: PRELUDE\"! Super-star writer Dan Slott and fan-favorite Spidey artist Stefano Caselli are back! New York has been INFESTED and the web grows as it gets ready to explode into SPIDER-ISLAND!  Normal people are getting Spider-Powers!  But not all of them realize that with great power must also come ....you know the rest. Okay, sure we often say Peter Parker's life will never be the same. But listen, pal, we've never been more serious. Heroes and villains are crawling all over Manahttan and no one knows why. This will change everything for Pete, for Spidey...and possibly for YOU! Look at it this way...If EVERYONE'S a Spider-Man then no one is.", "Fear Itself: FF (2011) #1": "FEAR ITSELF TIE-IN! XXXX XXXXX...one of the most beloved heroes in the Marvel Universe...is now the willing avatar of the Serpent's malice--an engine of discord cutting an unstoppable path of destruction through the heart of New York City! How did the Serpent's Hammer seduce him so easily? Can the rest of the XXXXXXX stop him before he levels the entire city in the name of his dark master?", "Amazing Spider-Man (1999) #665": "\"INFESTED\" ENDS WITH SPIDEY AT THE \"CROSSROADS\"! As Spider-Man, he's a member of the FF and TWO different Avengers teams.  As Peter Parker, he works all hours on his dream job at Horizon Labs.  That doesn't leave him with much time for anything or anyone else.  This is where he pays the price. In this landmark issue, one of Peter's greatest sins-- comes back to haunt him. And the life of someone dear to him hangs in the balance. Plus: With New York's Infestation complete, the run-up to Spider-Island is over. Prepare for hell to break loose.", "Amazing Spider-Man (1999) #665 (AMAZING SPIDER-MAN 665 I AM CAPTAIN AMERICA VARIANT)": "\"INFESTED\" ENDS WITH SPIDEY AT THE \"CROSSROADS\"! As Spider-Man, he's a member of the FF and TWO different Avengers teams.  As Peter Parker, he works all hours on his dream job at Horizon Labs.  That doesn't leave him with much time for anything or anyone else.  This is where he pays the price. In this landmark issue, one of Peter's greatest sins-- comes back to haunt him. And the life of someone dear to him hangs in the balance. Plus: With New York's Infestation complete, the run-up to Spider-Island is over. Prepare for hell to break loose.", "Amazing Spider-Man (1999) #659 (2nd Printing Variant)": "Spider-Man joins the Future Foundation for a fantastic new adventure!", "Amazing Spider-Man (1999) #663": "\"The Ghost of Jean DeWolff\" ANTI-VENOM returns to help SPIDER-MAN wage war against MISTER NEGATIVE and his criminal empire... whether Spidey wants him to or not. And when an all-new WRAITH enters the fray, will she prove to be a friend or foe?  Plus: From the pages of SECRET AVENGERS, a special guest appearance by SHANG-CHI, The Master of Kung Fu! PLUS: \"Infested\" continues in...the lead-in to SPIDER-ISLAND.", "Amazing Spider-Man (1999) #661 (X-Men Art Variant)": "GUEST STARRING AVENGERS ACADEMY! After his work with the new FF wraps for the week, what can the original teenaged superhero teach the worlds most at risk group of super-powered teens?  Find out when Spider-Man substitutes at the Avengers Academy!  But it's far from a normal day at school when a field trip is interrupted by a vengeful PSYCHO-MAN armed with hate, doubt and fear! Guest starring the FF, Giant-Man.... and the Malevolent Marvel Monster Mayhem of  MONSTEROSO! Plus a \"Day in the Life of Spider-Man\" by Paul Benjamin and Javier Pulido!", "Silver Surfer (2010) #4": "High Evolutionary's grand design is rewriting the world and Surfer can't save us on his own. The Future Foundation joins the fight as our penultimate issue builds to a cosmic climax that will be the Silver Surfer's greatest sacrifice ever!", "Amazing Spider-Man (1999) #661": "After his work with the new FF wraps for the week, what can the original teenaged super hero teach the world's most at-risk group of super-powered teens? Find out when Spider-Man substitutes at the Avengers Academy!", "Amazing Spider-Man (1999) #660": "It's the Sinister Six versus The Future Foundation! But what happens when the world's deadliest super-villains take on the entire FF, including the kids?", "Amazing Spider-Man (1999) #659": "To the end of the universe! To the future and back! Up and down the Microverse! And France! These are the varied destinations on the FF's itinerary. Can Spidey handle the harrowing, universe-spanning antics of the FF?", "SENSATIONAL SHE-HULK BY JOHN BYRNE VOL. 1 TPB (Trade Paperback)": "From SAVAGE to SENSATIONAL! With John Byrne at the helm, witness She-Hulk go where no super hero has gone before: right through the fourth wall! Vs. Spider-Man! Beheaded! Against the wrath of Dr. Bong! Alongside Santa Claus! On her own Star Truck! Hosting a Golden Age guest star! Featuring the Wasp, Mr. Fantastic and Razorback! Collecting SENSATIONAL SHE-HULK #1-8 and material from MARVEL COMICS PRESENTS (1988) #18.", "Amazing Spider-Man (1999) #658 (THOR HOLLYWOOD VARIANT)": "CLASSIFIED!", "Amazing Spider-Man (1999) #658": "Johnny Storm has fallen. Who shall take his place? Why, it's your Friendly Neighborhood Spider-Man! Prepare for the Future Foundation's first mission with the Wallcrawler on the team roster!", "Amazing Spider-Man (1999) #657": "FF: THREE TIE-IN Spider-Man visits the FF for a very private wake-just for family.", "Silver Surfer (2010) #2": "The High Evolutionary's plan to harness the power of Silver Surfer-Herald of Galactus-to further his enigmatic goals has been hatched! What can the Sentinel of the Spaceways do to save himself and the cosmos?", "Fantastic Four (1998) #587 (3rd Printing Variant)": "One of the four will fall!", "Thor: First Thunder (Trade Paperback)": "Revealed for a new generation: the origin ,à„à® and first year on Earth ,à„à® of the God of Thunder! Who is the enigmatic Dr. Donald Blake? What is the secret that drives him to travel the world, seeking its challenges, and how does it connect him to the banished Prince of Asgard? Why has Thor been exiled to walk among mankind ,à„à® and battle threats from beyond the stars? And before the entire saga is over, how will he react when confronted by the likes of Tony Stark, Reed Richards,à„¶and his devious brother, Loki? Witness the legend reborn with a modern touch by Harvey Award-winning writer Bryan J.L. Glass (The Mice Templar) and Eisner Award-winning artist Tan Eng Huat (SILVER SURFER: IN THY NAME)! Collecting THOR: FIRST THUNDER #1-5.", "Fantastic Four (1998) #587 (2ND PRINTING VARIANT)": "The conclusion to \"Three\"!", "Fantastic Four (1998) #588": "THREE PART 6 Following the death of Johnny Storm, see how the remaining members of the Fantastic Four, the extended family, other heroes, and prominent villains react to the loss of this legendary hero.", "Silver Surfer (2010) #1": "The sentinel of the spaceways walks the Earth once more, a stranger feared by many. Only the HIGH EVOLUTIONARY understands his true potential, but the Evolutionary's mysterious grand design may cost the Surfer everything and change the cosmic balance forever! He's traded blows with Thor and matched wits with Mephisto, but can the herald of Galactus survive the judgment of NORRIN RAND, the man within the Silver Surfer? It's a character-defining epic showing the Silver Surfer as you've never seen him before, brought to you by \"Planet Hulk\" writer Greg Pak and \"Dark Wolverine\" artist Stephen Segovia.", "Fantastic Four (1998) #587 (SPOILER VARIANT)": "One of the four will fall!", "Iron Man Legacy (2010) #11": "THE ILLUMINATI versus THE PRIDE as \"INDUSTRIAL REVOLUTION\" reaches its senses-shattering conclusion!...\n'NUFF SAID!", "Fantastic Four (1998) #587": "THREE PART 5 This is the penultimate chapter of THREE! Which member of the Fantastic Four will perish?", "Fantastic Four (1998) #583 (3RD PRINTING VARIANT)": "Now joined by artist Steve Epting (CAPTAIN AMERICa) , Jonathan Hickman's tenure on FANTASTIC FOUR hits critical mass with \"THREE\", running through FF #583-588. The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last! Change is in the air as the World's Greatest Comic Magazine lives up to its motto! While the Fantastic Four have to deal with an uprising in the Forever City of the High Evolutionary, back home in the Baxter Building Val finds her father's Bridge machine and learns the Cost of Solving Everything. It's the return of Doctor Doom and the debut of superstar artist Steve Epting in THREE, part 1: 'In Lateveria, the Flowers Bloom in Winter. Rated A ...$2.99", "Fantastic Four (1998) #584 (2ND PRINTING VARIANT)": "It's the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again. Join Jonathan Hickman and superstar artist Steve Epting in THREE, part 2: 'Congratulations, Mr. Grimm...You're Human Again.'' Rated A ...$2.99", "Fantastic Four (1998) #585 (2ND PRINTING VARIANT)": "FANTASTIC FOUR #585 Written by JONATHAN HICKMAN Penciled by STEVE EPTING Cover by ALAN DAVIS World's apart from each other, the Fantastic Four embark on their individual journeys with one destined to end in tragedy and change the face of Marvel's first family. It's THREE, part 3:'The Last Kings of Atlantis'! 32 PGS./Rated A ...$2.99", "Fantastic Four (1998) #586 (2ND PRINTING VARIANT)": "As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth amidst the chaos of Galactus devouring Nu-World. 32 PGS./Rated A ...$2.99", "Marvel Adventures Super Heroes (2010) #10": "Reed Richards's secret plan is revealed at last, and a full scale Avengers assault on the Baxter Building is the result! But for which team will Susan Storm fight? And why are there TWO Black Widows?", "Fantastic Four (1998) #586": "THREE PART 4 As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth!", "Fantastic Four (1998) #585": "THREE PART 3 Worlds apart from each other, the Fantastic Four embark on their individual journeys. One member won't make it back...", "Chaos War: Chaos King (2010) #1": "As darkness blankets the stars, only the gods of Zenn-La, homeworld of the Silver Surfer, remain to oppose the Chaos King before he begins his march on the final battleground: Earth!", "Fantastic Four (1998) #584": "THREE PART 2 In this issue: the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again.", "Fantastic Four (1998) #583": "THREE PART 1 The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last!", "Amazing Spider-Man (1999) #641": "ONE MOMENT IN TIME PART 4 Every question is answered, the past laid to rest, and Spider-Man swings into a new direction for the future!", "Fantastic Four (1998) #582": "At collapsed Chronopolis, after the death of the universe, Reed, Ben, Doom and Nathaniel Richards battle for both the past and the future.", "Captain America: Reborn (2009) #4": "Steve Rogers, the original Captain America - trapped in time! Bucky and Sharon Carter - in the hands of the enemy!\r\nAs Dr. Doom and the Red Skull make a terrifying pact that could destroy what Captain America means forever! \r\nEd Brubaker and Bryan Hitch bring you the penultimate issue of Marvel's event of the year!\r\nRated T  ...$3.99", "Dark Reign: Zodiac (2009) #3": "The explosive climax!  New York in flames!  Norman Osborn tearing out his bizarre-looking hair! The deepest, darkest secrets are finally revealed as Zodiac makes his big play.  But will a lone H.A.M.M.E.R. Agent expose him before he can fulfill his destiny?  You've never seen super-villainy like this!\r\nRated T  ...$3.99", "Incredible Hulks (2010) #602 (SHS VARIANT)": "X marks the spot as the most insane father and son duo in the Marvel Universe take on one of the Green Goliath's most formidable adversaries. That's right, it's the JUGGERNAUT, bi--bi--boys and girls!  What happens when an unstoppable force meets the Old Power and the gamma-fueled genes of the Strongest One There Is?  Massive destruction and emotional revelation, that's what!  Continuing the acclaimed writer Greg Pak's return to the \"Incredible Hulk, plus, in the \"Savage She-Hulk\" backup story written by Fred Van Lente, Lyra takes on the all-new Gamma Corps Black! Rated T $3.99", "Captain America: Reborn (2009) #3": "Dr. Doom and the Red Skull together again! And what is the fate of the original Captain America, Steve Rogers -- and how can he help save himself from the accidental trap he's found himself in? All this and more -- as the Avengers and the FF battle insane odds to save Marvel's Fallen Son!\r\nBy the astonishing team of Brubaker, Hitch, and Guice!", "The Mighty Avengers (2007) #29": "It's all out action at the Avengers new headquarters as Ronin and Vision face off against the Scarlet Witch! Also, on the outskirts of Tibet, Quicksilver and a longtime Avengers villain uncover The Unspoken's plan to dominate all life on Earth.", "Captain America: Reborn (2009) #2": "The race for Steve Rogers is on! On one side - BUCKY and the BLACK WIDOW and members of the AVENGERS and FANTASTIC FOUR! On the other - NORMAN OSBORN and HAMMER, THE RED SKULL and his evil hordes, with DR. DOOM waiting in the wings! And where... oh where, is the real CAPTAIN AMERICA?\r\nEd Brubaker, Bryan Hitch and Butch Guice bring you the biggest Marvel comic of the year!\r\nRated T  ...$3.99", "The Mighty Avengers (2007) #26": "In this issue: Mr. Fantastic and Hank Pym's battle of the brains! Hercules and The Thing's battle o' the brawn! Plus, an all-new HQ for the team!", "Adam: Legend of the Blue Marvel (Trade Paperback)": "An unstoppable super-villain attacks New York City - and the Mighty Avengers fall before him! Where did Anti-Man come from? And who can stop his overwhelming rampage?! Now Iron Man races to find the only man who's ever defeated Anti-Man - THE BLUE MARVEL! A hero the world hasn't seen since 1961! Will Tony Stark uncover the truth behind Blue Marvel's disappearance and will Blue Marvel ever recover from it? Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League) join forces to create Marvel's newest powerhouse super hero! Collecting ADAM: LEGEND OF THE BLUE MARVEL #1-5.\r\nRated T  ...$19.99 \r\nISBN: 978-0-7851-2409-2", "The Mighty Avengers (2007) #25": "Someone is planning on pulling a heist...something really big. But to pull it off, this someone would need a team. That someone is Hank Pym. His target is the Baxter Building. And his team...The Mighty Avengers.", "Wolverine: Weapon X (Trade Paperback)": "Wolverine's a lot of things to a lot of people, but to one infamous enclave he was nothing but a weapon. And weapons kill people. They found that out well enough. Find out for yourself in this prequel to recent revelations of the murderous mysteries that have mesmerized our favorite mutant! Collecting MARVEL COMICS PRESENTS #72-84.\r\nRated T  '$16.99\r\nISBN: 978-0-7851-3726-9", "X-Men: The Complete Onslaught Epic Book 4 (Trade Paperback)": "The final onslaught is ON! Mutantdom's mightiest telepaths are forced to turn on one of their own, because Professor X's evil side won't stand for any more repression! The world's greatest hero teams gird for battle against one of their deadliest enemies, and when the smoke clears, not only will some of them not still be standing, they won't be there at all! The X-Men are left to take the blame for over a dozen dynamic disappearances, leading the man called Bastion to lay the groundwork for their NEXT crisis! But even if Onslaught is purged from this world, can a reborn world say the same? Guest appearances galore, plus step-by-step details on where the turning point of the 1990s began and ended! Collecting FANTASTIC FOUR #416, X-MEN #56, ONSLAUGHT: MARVEL UNIVERSE, CABLE #36, UNCANNY X-MEN #337, X-MEN #57, ONSLAUGHT: EPILOGUE, IRON MAN #6 & X-MEN: ROAD TO ONSLAUGHT.\r<br>Rated T+ ...$29.99\r<br>", "Adam: Legend of the Blue Marvel (2008) #2": "In the wake of Anti-Man's devastating attack on New York City, the Mighty Avengers are neutralized, and Iron Man's on a quest for answers! Who was the Blue Marvel?\r\nWhy did he disappear over 40 years ago? And...what alarming secrets will Iron Man discover about the U.S. government and his own agency of S.H.I.E.L.D.? There are no easy answers in the story of Marvel's newest super hero...created by Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League)!\r\nRated T  ...$3.99", "AVENGERS: FIRST TO LAST PREMIERE HC (Hardcover)": "They are the last of the Earth's Mightiest Heroes: Hawkeye, the blinded archer; the Wasp, pint-sized dynamo cursed with an incurable shrinking disease; Cannonball, mutant X-Man and Avenger; and former Ant-Man, former Giant-Man, former super hero Hank Pym, the last man who would have volunteered to lead them. They're not the strongest, but they are the only hope in the final battle against the greatest enemies of mankind. They are the Last Avengers. United, they will fall. This is THE LAST AVENGERS STORY. Also featuring timeless tales shedding new light on the early days of Earth's Mightiest Heroes: the Hulk, Iron Man, Captain America and Thor! In these previously untold stories, the six founding members vie for chairmanship of the team, Bruce Banner fears the Hulk's rage may have gone too far, Iron Man unveils his latest suit of armor, Captain America adjusts to life in the modern world, a WWII veteran reminisces about an early meeting between Cap and Thor, and more! Plus: Marvel's founding father, Stan Lee, tells the \"real\" story of how the Avengers became a team! Collecting THE LAST AVENGERS STORY #1-2 and material from AVENGERS CLASSIC #1-12.\r<br>Rated T+ ...$34.99\r<br>ISBN: 978-0-7851-3652-1\r<br>", "Avengers: First to Last (Hardcover)": "They are the last of the Earth's Mightiest Heroes: Hawkeye, the blinded archer; the Wasp, pint-sized dynamo cursed with an incurable shrinking disease; Cannonball, mutant X-Man and Avenger; and former Ant-Man, former Giant-Man, former super hero Hank Pym, the last man who would have volunteered to lead them. They're not the strongest, but they are the only hope in the final battle against the greatest enemies of mankind. They are the Last Avengers. United, they will fall. This is THE LAST AVENGERS STORY. Also featuring timeless tales shedding new light on the early days of Earth's Mightiest Heroes: the Hulk, Iron Man, Captain America and Thor! In these previously untold stories, the six founding members vie for chairmanship of the team, Bruce Banner fears the Hulk's rage may have gone too far, Iron Man unveils his latest suit of armor, Captain America adjusts to life in the modern world, a WWII veteran reminisces about an early meeting between Cap and Thor, and more! Plus: Marvel's founding father, Stan Lee, tells the \"real\" story of how the Avengers became a team! Collecting THE LAST AVENGERS STORY #1-2 and material from AVENGERS CLASSIC #1-12.\r<br>Rated T+ ...$34.99\r<br>ISBN: 978-0-7851-3660-6\r<br>", "Marvels: Eye of the Camera (2008) #1": "News photographer Phil Sheldon's back, with the man-on-the-street's perspective on the big events of the Marvel Universe!", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 2 TPB (Trade Paperback)": "It's the past, it's the future, it's an alternate Earth - when it's down to fighting cyborg dictators and displaced dinosaurs, who has time to figure out where they are?! It's another Simonson odyssey for the Fantastic Four and company, plus personal crises for the Human Torch and Ms. Marvel (Sharon Ventura)! Guest-starring Spider-Man and Rusty Collins of X-Factor/New Mutants fame! Collecting FANTASTIC FOUR #342-346.\r<br>All Ages ...$14.99\r<br>", "Mighty Avengers Vol. 1: The Ultron Initiative (Trade Paperback)": "'THIS is the once and future Avengers.' ' Ain't It Cool News\r\nDoom looks like a lady! The super-hero Civil War is over, but Iron Man's work is just beginning. As the new head of S.H.I.E.L.D. and creator of the nationwide Initiative program, he's rebuilding the Avengers with a handpicked roster of Earth's mightiest heroes: Wasp, Black Widow, Wonder Man, Sentry, Ares and new team leader Ms. Marvel. A group this powerful should be ready for just about anything ' except, perhaps, the return of genocidal killing machine Ultron. The Avengers' insane robotic foe has rebuilt himself yet again, this time in the form of'a beautiful woman!? NEW AVENGERS writer Brian Bendis and Liberty Meadows creator Frank Cho launch an all-new Avengers series pitting the team against the ultimate femme fatale! Collecting MIGHTY AVENGERS #1-6.\r\nRated A '$14.99", "Invincible Iron Man (2008) #4": "Iron Man and Zeke Stane have been dancing around one another like pieces on a chessboard, and it's been all Tony Stark can do to hold on. After one of his closest allies is critically injured, Tony aims to put an end to the games with some serious upgrades. But while Iron Man readies himself, Zeke makes his most audacious assault yet, in an attack so stunning you have to see it to believe it. THE FIVE NIGHTMARES continues, and it only gets worse from here for THE INVINCIBLE IRON MAN.", "Counter X Vol. 1 (Trade Paperback)": "Like all mutants, X-Force must face a callous and deadly world -- but now they've been trained for it by Peter Wisdom, one of the most callous and deadly mutants of all! The proactive paranormal platoon faces a city transformed by Cold War mad science and a mutant druglord terrorist, but will their deadliest enemies be Wisdom's long-lost allies? Featuring killer zombies, exploding buildings and the dynamic Domino! Collecting X-FORCE #102-109.\r<br>Rated T+ ...$19.99\r<br>ISBN: 978-0-7851-3304-9\r<br>", "FANTASTIC FOUR: LOST ADVENTURES BY STAN LEE PREMIERE HC (Hardcover)": "The comic-book equivalent of a lost Beatles track! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished - until now! Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott reunited to complete the work they started almost four decades ago! Plus: The legendary writer and Fantastic Four co-creator joins forces with artist John Romita Jr. to tell his final story of the team that started the Marvel Age! Collecting FANTASTIC FOUR: THE LOST ADVENTURE and THE LAST FANTASTIC FOUR STORY, plus rare Stan stories from FANTASTIC FOUR #296 and #543.\r<br>Rated A ...$24.99\r<br>ISBN: 978-0-7851-3097-0\r<br>", "The Mighty Avengers (2007) #14": "SECRET INVASION TIE-IN! The Sentry is the most powerful being in the universe. If the Skrulls are to dominate the planet then they need to eliminate the man with the power of a thousand exploding suns. The only question is how?!", "New Avengers: Illuminati (Trade Paperback)": "The Illuminati. What are they? An elite group of the planet's most powerful guardians. When do they meet? Whenever the Earth faces its greatest threats. Who are they? Nobody knows ' and that's the way they want it! Join Iron Man, Professor X, Black Bolt, the Sub-Mariner and Mister Fantastic as they take on the threats no one else can handle ' and learn of secrets that will forever alter the way they (and you) look at the Marvel Universe! After years spent protecting Earth from harm, it is now when the planet is perhaps at its most endangered ' as the Illuminati find themselves at the head of the spear of a Skrull invasion. But can the Illuminati keep themselves from fracturing in the waking moments of this worldwide threat? Collecting NEW AVENGERS: ILLUMINATI #1-5.\r\nRated T  '$14.99\r\nISBN: 978-0-7851-2437-5", "The Mighty Avengers (2007) #11": "Get ready to see an Avengers/Doctor Doom knock-down drag-out! And we promise an ending you've never seen in the history of Doom!  All this and the Secret Invasion is upon us!", "Fantastic Four: The Lost Adventure (2008) #1": "IT'S THE COMIC BOOK EQUIVALENT OF A LOST BEATLES TRACK! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished-until now!  Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott have reunited, to complete the work they started almost four decades ago! Plus, this super-sized issue includes reproductions of Kirby's unlinked penciled pages, with border notes and analysis by John Morrow, and a complete reprint of FANTASTIC FOUR #108 by Stan Lee and John Buscema, which incorporated some of the material from the lost story as a flashback.\r<br>Rated A ...$4.99 \r<br>", "Fantastic Four (1998) #554": "MARK MILLAR! BRYAN HITCH! Need we say more? All right, we will! Who is Mrs. Fantastic? And how will her return into Reed's life rock comicdom's First Family? Also, get ready to meet the Invisible Woman's brand NEW super-team! This issue kicks off a year-long storyline that will make FANTASTIC FOUR \"The World's ULTIMATEST Comic Magazine!\" Promise!\r<br>Rated A...$2.99 \r<br>", "New Avengers: Illuminati Premiere (Hardcover)": "The Illuminati is a secret organization comprised of several of the world's most powerful heroes: Doctor Strange, Sorcerer Supreme; Black Bolt, king of the Inhumans; Charles Xavier, founder of the X-Men and mutant-rights activist; Reed Richards, founding member of the Fantastic Four; Namor the Sub-Mariner, king of Atlantis; and Iron Man (Tony Stark), founding member of the Avengers. These six men have worked together to mold and shape the status of the superhuman world and the world around it. How and what they have done together has remained a mystery...until now! Writers Brian Michael Bendis (NEW AVENGERS, ULTIMATE SPIDER-MAN) and Brian Reed (MS. MARVEL) have joined together with Jim Cheung (YOUNG AVENGERS) to reveal this untold story of the Marvel Universe and how the Illuminati's actions affect today! Collecting NEW AVENGERS: ILLUMINATI #1-5.\r<br>Rated T+ ...$19.99 \r<br>ISBN: 978-0-7851-2437-5\r<br>", "Fantastic Four: Isla De La Muerte! (2007) #1": "Ben Grimm has been keeping a secret from his teammates for years. But when Reed, Sue and Johnny investigate, the mystery brings them to the tropics, face-to-face with an old nemesis and a monstrous creature!", "Fantastic Four: Isla De La Muerte (Spanish Language Edition) (2008) #1": "Los Cuatro Fantásticos han viajado por todo el mundo, el universo y hasta otras dimensiones combatiendo amenazas inconcebibles, pero la amenaza más reciente a la que se enfrentan tiene su origen en la Isla del Encanto, Puerto Rico. En el número especial Fantastic Four: ¡Isla de la Muerte! One-Shot, escrito por el aclamado Tom Beland e ilustrado por el artista emergente Juan Doe, los Cuatro Fantásticos visitan la preciosa isla de Puerto Rico...¡donde se ha de revelar un secreto del pasado de la Cosa! Como si no bastara el resurgimiento de un antiguo enemigo, ahora los Cuatro Fantásticos deben enfrentarse al monstruo boricua al que se le conoce como...¡el chupacabras!\r<br>\r<br>¡Esta edición especial también estará disponible en español en la inaudita Los Cuatro Fantásticos: ¡Isla de la Muerte! Edición Boricua en Español! Ya sabe, fanático-¡puede leer esta historia repleta de acción en el idioma de Puerto Rico, y tomar parte en las aventuras de sus favoritos exploradores del desconocido como nunca antes!\r<br>\r<br>No se pierda esta edición especial de 38 páginas, en la que los Cuatro Fantásticos se enfrentan a uno de sus antagonistas más extraños-¡e intentan salir a salvo de la Isla de la Muerte!\r<br>\r<br>Rated A ...$3.99\r<br>", "Fantastic Five: The Final Doom (Trade Paperback)": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff - and cameos galore! Collecting FANTASTIC FIVE #1-5.\r<br>Rated A ...$13.99\r<br> \r<br>", "Marvel Adventures Fantastic Four (2005) #31": "Cleanup on Aisle Four!!!! MAN, the FF just CAN'T catch a break! Even when they're just going shopping, they gotta deal with evil geniuses that've created an entire STORE designed to destroy our heroes!\r<br>All Ages ...$2.99\r<br>", "The Mighty Avengers (2007) #6": "The shocking conclusion to the Ultron terror as the Avengers reassemble and go on the offensive. It's now or never for an Ultron butt-kicking. How on Earth will Tony Stark survive this??? And how does this connect to the startling Skrull infestation that may have taken over the Marvel Universe? The next big clue to the truth is HERE!!\r<br>32 PGS./Rated A ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 8 TPB (Trade Paperback)": "John Byrne's FF endeavors end in era-transcending odysseys when the World's Greatest Super-Team ventures into the Negative Zone, a remade past and a future sculpted around the FF itself! Plus, the death, life and rebirth (not necessarily in that order) of Doctor Doom! Guest-starring Nick Fury, the Avengers and the Beyonder! Collecting FANTASTIC FOUR #287-295.\r<br>Rated A ...$24.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #30": "You've been bombarded with cosmic rays, granting you astounding abilities beyond the average human...do you use those powers to explore amazing new worlds and take on beings with near-limitless power, or do you take your skills to the streets and help the little man? \r<br>All Ages ...$2.99 \r<br>", "Fantastic Four (1998) #551": "THE EPILOGUE CHAPTER 1 The Fantastic Four and Doctor Doom cross paths when Doom travels back in time to stop Richards from destroying the world. Could it be that Reed is a danger to all that he has sworn to protect? Is he capable of such villainy?", "New Avengers: Illuminati (2006) #5": "The Illuminati convene to deal with both the New Avengers and the Mighty Avengers. But not everyone in the cabal is who they say they are? Betrayal and intrigue await you in this issue!", "Cable & Deadpool (2004) #46 (Zombie Variant)": "Since Deadpool is twice as much trouble as anyone in the Marvel Universe, the only logical people who could possibly rescue him and Bob, Agent of Hydra, from their temporal tantrum are... the FANTASTIC EIGHT? Twice the guest stars! Twice the fun! But not twice the price! How can you say no? 32 PGS./Rated T+ $2.99", "Marvel Adventures Fantastic Four (2005) #29": "Hmmmm...can't remember...Hulk Knit! No, that's not right. Hulk Bake Muffins! Nope, nope...Oh! I know...HULK SMASH!!!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "World War Hulk (2007) #4": "Everyone GOES! TOO! FAR! in this penultimate chapter of the Mighty Marvel Monsterpiece which is World War Hulk. The Incredible Hulk and his Warbound companions? They go too far! Dr. Strange? He goes WAY too far! Iron Man and Mr. Fantastic? They learn the precise definition of \"too far\" as the Hulk delivers his final judgment from his stone throne in the Great Arena!", "Silent War (Trade Paperback)": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans. Collecting SILENT WAR #1-6\r<br>144 PGS./Rated T+ ...$14.99\r<br>ISBN: 978-0-7851-2425-2\r<br>", "World War Hulk (2007) #4 (Romita Variant)": "Everyone GOES! TOO! FAR! in this penultimate chapter of the Mighty Marvel Monsterpiece which is World War Hulk. The Incredible Hulk and his Warbound companions? They go too far! Dr. Strange? He goes WAY too far! Iron Man and Mr. Fantastic? They learn the precise definition of \"too far\" as the Hulk delivers his final judgment from his stone throne in the Great Arena!\r<br>48 PGS./Rated T+ ...$3.99\r<br>", "Marvel Adventures Fantastic Four (2005) #28": "The populace of Earth hates and fears the stranded SILVER SURFER. But he falls in with a TV self-help guru who encourages him to win the planet over to his side -- by solving all the world's problems! Wielding the Power Cosmic, the Silver Surfer single-handedly wipes out famine, poverty and war, becoming the most popular super hero ever -- as well as the greatest threat to Earth's continued existence! Why does the Fantastic Four have to stop the Surfer from...saving the world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Five (2007) #5": "With the Earth already conquered and his teammates dying, Reed Richards faces his final battle with Doctor Doom--and only one will survive!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Spider-Man Family: Back in Black (Digest)": "The action begins with a feature-length tale starring Spider-Man's alien costume and guest-starring the Sandman! Peter Parker would love nothing more than to get a good night's sleep, but his sleek, symbiotic suit has plans of its own...and no one is gonna get in its way! Next, Venom is back in town, and he's on a rampage...but it has nothing to do with his vendetta against Spidey? What could be so important that Venom doesn't have the time to torture his nemesis? Peter Parker is determined to find out, but first he'll have to match journalistic wits with none other than Eddie Brock! And finally, remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say...knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler. Plus: backup stories featuring the Lizard and TWO Scorpions! Collecting SPIDER-MAN FAMILY #1-3\r<br>112 PGS./Rated A ...$8.99 \r<br>ISBN: 978-0-7851-2626-3 \r<br>", "PARADISE X VOL. 2 TPB (Trade Paperback)": "The epic, visionary EARTH X saga concludes.  Will the Heroes of Earth be able to solve the problems of the Paradise they helped create? Will their quest for a new Death entity succeed so the pain and suffering of the world's population ceases? Collecting PARADISE X #6-12,  RAGNAROK, DEVILS, A, X.\r<br>\r<br>352 PGS./Rated T+ ...$29.99 \r<br>\r<br>ISBN: 0-7851-2416-0 \r<br>\r<br>\r<br>", "Marvel Adventures Fantastic Four (2005) #27": "And you thought meeting your girlfriend's parents was uncomfortable... The Human Torch invites his new heartthrob Crystal's family over to the Baxter Building for dinner with his family without realizing they're Black Bolt, Medusa, Gorgon, Triton, Karnak and Lockjaw ... The Inhumans! When agents of Maximus The Mad show up to capture them, you can be sure knowing which fork to use will be the least of the FF's problems...\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Fantastic Five (2007) #4": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>\r<br>32 PGS./Rated A ...$2.99\r<br>", "Fantastic Five (2007) #3": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 6: Monsters & Mysteries (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits. Featuring the Mole Man, the Skrulls, Rama-Tut and the Sub-Mariner! Collecting \r<br>MARVEL ADVENTURES FANTASTIC FOUR #21-24.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "New Avengers: Illuminati (2006) #4": "They have faced the Skrull empire, the Hulk, the Sentry, the Infinity Gems and the Beyonder, but now the secret society of Marvel is faced with the one thing too much for even them...", "Fantastic Four (1998) #548": "Fantastic Four vs. Frightful Four-'Nuff Said!", "Fantastic Five (2007) #2": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r<br>\r<br>32 PGS. /Rated A ...$2.99 \r<br>", "Paradise X Vol. 1 (Trade Paperback)": "In EARTH X, Captain America, the Fantastic Four, Thor, the Hulk and the X-Men discovered that their purpose - and the meaning of all super heroes and mutated people in the universe - was nothing more than to protect their host planet, in this case Earth, from outside invasion. They learned super heroes are merely biological antibodies to protect a growing embryo within the Earth. An embryo for the Celestial race: This is the way these Gods fought back - only to cause a terrible ecological imbalance, a rift at its core that in time would wipe out all life on the planet. In UNIVERSE X, Captain Marvel was reborn on Earth years after his death. But he also still claimed to walk in the realm of the unliving, where Earth's fallen champions still exist. Mar-Vell led a team of heroes in a quest for the greatest weapons of mass destruction on Earth, suggesting this would limit the destruction caused by the growing power struggle on the planet. But this was not the only reason. For his crusade on Earth only supported and armed a battle he fought in the realm of the fallen, a battle against Death herself. Those living champions who died in his collection of artifacts were added to the battle raging in this other realm. Mar-Vell led a charge against Death and killed her. But now that Death is dead, no one will ever die again. They may writhe in pain in hospitals because their bodies have been broken beyond repair, but they will not die. They will call out for an end to their suffering. They will cry out for peace but there will be no answer. Paradise will be denied them. Yes. Death is truly dead. Long live the living. Collecting PARADISE X #0-5, PARADISE X: XEN and HERALDS #1-3.\r<br>304 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2415-2\r<br>", "Marvel Adventures Fantastic Four (2005) #26": "A massive alien refugee fleet streams through our solar system, bearing the warning: \"Galactus is coming! Galactus is coming!\" And right behind them is the World-Devourer's herald, the SILVER SURFER -- headed straight for Earth! Reed Richards has only a few days to evacuate the planet before it's destroyed ... or, failing that, figure out a way to somehow stop the unstoppable!\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Five (2007) #1": "\"The Final DOOM!\" Part 1 of 5\r\n<br>As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r\n<br>32 PGS./Rated A ...$2.99\r\n<br>", "Silent War (2007) #6": "Can Black Bolt hold it together as he suffers the unkindest cut of all? Betrayal, madness and a battle for the ages as the U.S.A. strikes back at Attilan.  Super-powered Kamikaze Marines go head-to-head with the Incomparable Inhumans in a battle for death ... or glory.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #25": "The Human Torch falls into a probability rift and finds himself flung across innumerable alternate realities, including: a world where a heroic Victor Von Doom, a.k.a. Doc Iron, battles against Mr. Devious, Monsterman, The Human Pyre, and The Unstoppable Woman ... a.k.a. The Frightful Four, a world where the Femmetastic Four defends a world completely depopulated of men (then Johnny shows up) and a world where Johnny's arch-nemesis runs the FF ... That's right, SPIDER-MAN! Can The Watcher help Torch get back to his timeline, or will he wander forever through \"The Worlds of What If?\" \r<br>And a warm welcome to new cover artist PAUL SMITH!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four Omnibus Vol. 2 (Hardcover)": "With all that Stan Lee and Jack Kirby accomplished in their first 30 issues of FANTASTIC FOUR, who would have thought they were just warming up? Well, True Believers, now it's time to jump into the fire because the second 30 are where they really start to turn up the heat!\r<br>Their achievements reflect the boundless energy of two creators at the top of their game with each issue, character and creation building upon and exceeding the scope of the last. It's a list of accomplishments unparalleled in the history of comics: the origin of Dr. Doom; the Frightful Four; the Wedding of Reed Richards and Sue Storm; the Inhumans; the first appearance of the Silver Surfer; the Galactus Saga; the debut of the world's first black super hero, the Black Panther; the cosmic clash between the FF, the Surfer and Dr. Doom; and, of course, \"This Man, This Monster!\" - the story widely regarded as the greatest FF tale of all! \r<br>Collecting the greatest stories from the World's Greatest Comics Magazine in one, massive collector's edition that has been painstakingly restored and recolored from the sharpest material in the Marvel Archives. With critical essays on the Lee/Kirby collaboration and bonus features a-plenty, this book is nothing short of a cornerstone to the Marvel Universe!\r<br>Collecting FANTASTIC FOUR #31-60 and ANNUAL #2-4.\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2403-9\r<br>Trim size: oversized\r<br>FANTASTIC FOUR OMNIBUS VOL. 2 HC - VARIANT EDITION\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2510-8\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 7 TPB (Trade Paperback)": "Marvel once again poses the question, \"What If...?\" In \"The Other,\" Peter Parker returned from the dead and embraced his \"inner spider.\"  But what if he had been completely consumed by his inner, bestial impulses and became more spider than man? \"Disassembled\" was the darkest day in Avengers history. But what if the greatest threat had gone undetected? Hydra made Wolverine an \"Enemy of the State.\" But what if the world's deadliest killing machine was never de-programmed? In \"Deadly Genesis,\" Professor X sent a secret squad of young mutants to the living island, Krakoa, in an ill-fated attempt to rescue the original X-Men before he formed the now-famous All-New, All-Different team. But what if this second team had survived? Attempting to slay Magneto Legion accidentally killed Professor X, giving rise to the \"Age of Apocalypse.\" But what if Legion killed both Magneto and Xavier, leaving no leader to create any incarnation of X-Men to resist the onslaught of Apocalypse? Collecting WHAT IF? AVENGERS DISASSEMBLED, SPIDER-MAN THE OTHER, WOLVERINE ENEMY OF THE STATE, X-MEN AGE OF APOCALYPSE and X-MEN DEADLY GENESIS.\r<br>176 PGS./Rated T+ ...$16.99 \r<br>ISBN: 0-7851-2183-8\r<br>", "Spider-Man Family (2007) #3": "Remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say..knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler...\r<br>Also! We've got a backup story featuring TWO Scorpions, Spider-Man J and classic Spidey archives !\r<br>104 PGS./Rated A ...$4.99\r<br>", "Fantastic Four/Inhumans (Trade Paperback)": "The incredible Inhumans have long been allies to the FF in defending the Earth, but what happens when they leave it? And what awaits them when they come back? See for yourself in a saga where treachery, intrigue and buried secrets reach from the depths of space to deep within Inhuman history! Guest-starring Ronan and Starlord of ANNIHILATION! Collecting INHUMANS (2000) #1-4 and FANTASTIC FOUR #51-54.\r<br>192 PGS./Rated T+ ...$19.99\r<br>ISBN: 0-7851-2703-8\r<br>", "Silver Surfer: Requiem (2007) #1": "The latest offering from the Marvel Knights line. Guest-starring the Fantastic Four! \r<br>For untold years Norrin Radd has surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride is about to come to an end.  It starts with a small spot -- a blemish that will spread until he is no more.  Until then, the Silver Surfer would undertake his final voyage -- to the one destination that has always eluded him.  His journey starts where it began.\r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99 \r<br>", "New Avengers: Illuminati (2006) #3": "Years ago a mysterious creature called the Beyonder gathered the heroes and villains of the Marvel Universe for the Secret Wars. Now, finally, after decades of mystery, the true origin of this powerful creature is revealed...", "Marvel 1602: Fantastick Four (Trade Paperback)": "Doom returns! The Four from the Fantastik's greatest enemy has an insidious plan that takes them to the ends of the Earth! Peter David (FRIENDLY NEIGHBORHOOD SPIDER-MAN, X-FACTOR) takes the reins with superstar artist-to-be Pascal Alixe (Superman, The Legion) for the eagerly awaited spin-off from Neil Gaiman's 1602. What does Doom want? Why doesn't Invisible Woman want to fight him? And what does Shakespeare have to do with it? Collecting MARVEL 1602: FANTASTICK FOUR #1-5.\r<br>120 PGS./Rated T+ ...$14.99\r<br>", "Marvel Masterworks: The Incredible Hulk Vol. 4 (Hardcover)": "It's time for more Masterworks mayhem from the house-shakin' Hulk! \r<br>Now headlining his very own title again for the first time in six years, the Green Goliath has twice the space to shake the Earth with his mighty rage, and you can bet Mighty Marvel is going to take advantage of every square inch of that space!See the beginnings of the Hulk's first outer-space adventure versus the Space Parasite! Place your bets for the strongest man-monster in the Marvel U.-ol' Greenskin or the Rhino!\r<br>Then it's road-trip time! The mighty Hulk travels continents far and wide, and believe it or not, he doesn't make too many friends along the way! It's a travelogue of destruction that's going to leave the Mandarin, the Inhumans, and the entire Savage Land rubbing a sore jaw in the wake of a freight train named \"Banner.\"\r<br>Guest-starring Nick Fury and Ka-Zar, this baby's guaranteed to give your greenback's worth!\r<br>Collecting INCREDIBLE HULK (Vol. 2) #103-110 and ANNUAL #1.\r<br>240 PGS./All Ages ...$54.99\r<br>", "Marvel Adventures Fantastic Four (2005) #24": "A trio of priceless tridents has been stolen from Atlantis, and the prime suspect is ... the Invisible Woman! Can Mr. Fantastic trade his scientist's hat for a detective's and uncover the real culprits before the SUB-MARINER declares war on the surface world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 1 TPB (Trade Paperback)": "After a string of successes with THOR, X-FACTOR and AVENGERS, it's sensational Simonson storytelling for Marvel's First Family - starting when the FF's Congressional hearing is disrupted by dozens of vengence-seeking villains! After the famous foursome - plus Ms. Marvel - deal with the Capitol chaos, a time anomaly sends them to find the future's fate! But while Kang and Nebula take up their time, will the universe fall to Galactus? Guest-starring Thor, Iron Man and Death's Head! Collecting FANTASTIC FOUR #334-341.\r<br>192 PGS./Rated A  ...$19.99 \r<br>", "Silent War (2007) #4": "The pressure builds on Black Bolt. The hawks in the Inhumans council are calling for all-out war and as he struggles to make his fateful decision, Black Bolt finds himself betrayed. As if that weren¹t enough, a terrible secret from his past is revealed. It's enough to make a man scream.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #23": "RAMA-TUT, the Pharaoh from the Future, has reached through time to kidnap the Thing's girlfriend (who happens to be quite the sculptress) to design his pyramid for him, and only the Four can rescue her!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 5: All 4 One, 4 for All (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits! Featuring the Absorbing Man, Arcade, Iceman of the X-Men...and Sue Storm, Secret Agent!? Collecting MARVEL ADVENTURES FANTASTIC FOUR #17-20.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "Silent War (2007) #3": "Luna is forced to make a heart-breaking choice that could cost her life as the Inhumans finally track Quicksilver to Mutant Town and we see just how far he has descended into madness. This is a man who has seen the future and if his prophecies come true, things are looking very bleak for the Inhumans. If that wasn't bad enough, when Madrox and Layla arrive, things really get messed up.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Wolverine: Weapon X Premiere (Hardcover)": "Wolverine's a lot of things to a lot of people, but to one infamous enclave he was nothing but a weapon. And weapons kill people. They found that out well enough. Find out for yourself in this prequel to recent revelations of the murderous mysteries that have mesmerized our favorite mutant! Collecting MARVEL COMICS PRESENTS #72-84.\r<br>136 PGS./Rated T+ ...$19.99 \r<br>", "Spider-Man: Birth of Venom (Trade Paperback)": "The Beyonder's Battleworld might seem a strange place to get new threads, but it's Spider-Man who becomes unraveled when his shape-changing costume attempts to darken his life as well as his fashion sense! But ridding himself of his riotous raiment proves an even greater mistake when its alien enmity bonds with mortal madness to form our hero's most dedicated decimator! Plus: the first appearances of Puma and the Rose! Mary Jane Watson's startling secret! And the debut of the battling...Bag-Man!? Guest-starring the Black Cat, the Fantastic Four and more! Collecting SECRET WARS #8; AMAZING SPIDER-MAN #252-259, #298-300 and #315-317; FANTASTIC FOUR #274; and WEB OF SPIDER-MAN #1;  AMAZING SPIDER-MAN ANNUAL #10.\r\n344 PGS./Rated A ...$29.99", "Marvel Adventures Fantastic Four (2005) #22": "The Invisible Woman and Mr. Fantastic are on one final date to save their relationship, but with a strike team of sinister SKRULLS stalking them, their relationship isn't the only thing in jeopardy!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Civil War (2006) #7 (Turner Variant)": "It all ends here! The startling battle that will determine the future of the Marvel Universe!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "New Avengers: Illuminati (2006) #2": "If the Infinity Gems ever fell into the wrong hands it would be catastrophic. So, when the Illuminati discover the gems are scattered across the cosmos, completely unguarded, the race is on to collect them before anyone else learns the truth!", "Civil War (2006) #7": "It all ends here! The startling battle that will determine the future of the Marvel Universe!", "Silent War (2007) #2": "Deep beneath the Pentagon the O*N*E is experimenting on the captured Inhumans with horrifying results. On Attilan, while pressure builds for all-out war on humankind, Quicksilver's young daughter Luna uses her developing powers of empathy to probe the dark corners inside the mind of Black Bolt's brother, Maximus the Mad. \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Civil War (2006) #7 (Turner Sketch Variant)": "It all ends here! The startling battle that will determine the future of the Marvel Universe!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #21": "The creatures of MONSTER ISLE have finally overthrown and exiled the MOLE MAN. And for their new leader they recruit the bravest, noblest monster they know ... the Thing!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: The End (2006) #5": "The Mole Man! Ronan the Accuser! Diablo! The Mad Thinker! Annihilus! As the four members of the fractured family are drawn back together by a web of intrigue,  these villains and more will stand against them-with the future of humanity itself at stake!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #20": "THE HUMAN TORCH is really really hot. ICEMAN is really really cool. And they really really don't like one another. So we've stranded them together with a bunch of pretty girls and a super-villain! Let's see what happens!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (2007) #1": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Avengers Assemble Vol. 4 (Hardcover)": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>", "New Avengers: Illuminati (2006) #1": "Doctor Strange, Black Bolt, Charles Xavier, Reed Richards, Namor the Sub-Mariner and Tony Stark. These six men have worked together to shape the super human world. How and what they have done together has remained a mystery...", "Heroes Reborn: Avengers (Trade Paperback)": "Cap, Thor, the Vision, Hawkeye, Hellcat, Mantis and more: The Avengers lineup is both new AND classic on an Earth that hits them with villains as fast as they can assemble! Revised versions of Ultron, the Radioactive Man, the Grim Reaper and many more prove their mastery of evil against Reborn Earth's mightiest heroes! Plus, the Heroes Reborn Universe only got a piece of the Hulk - but, darn it, it may still be more than it can handle! Guest-starring Nick Fury and the \r<br>Fantastic Four! Collects AVENGERS (VOL. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99  \r<br>", "Marvel Adventures Fantastic Four (2005) #19": "Ever have one of those days when it seems that someone's just out to get you? Well, MISTER FANTASTIC's having one of those days...because ARCADE's after him! Can the world's smartest hero survive a fun house of horrors without the rest of  his teammates?\r<br>(Psst! We ain't tellin'! Buy the book!)\r<br>32 PGS./All Ages ...$2.99\r<br>", "What If? Classic Vol. 3 (Trade Paperback)": "It's alternate-Earth anarchy as Doctor Strange, Captain Marvel, Ghost Rider, Spider-Woman, Nova and Shang-Chi are turned against humanity when fate is tossed a twist by that infamous question mark! Plus: The Howling Commandos fight for Earth, and Spider-Man fights for...ratings!? Featuring the Fantastic Four, Daredevil and Hellstorm! Collects WHAT IF? #14-15 and #17-20.\r<br>216  PGS./All Ages ...$24.99\r<br>", "Marvel Adventures Fantastic Four Vol. 4: Cosmic Threats (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on the powerful malevolent alien calling himself the Grant Master, the cosmic scavenger Terminus and the mad Titan known as Thanos - and have a close encounter with a world gone bonkers! Guest-starring Captain Marvel! Collects MARVEL ADVENTURES FANTASTIC FOUR #13-16.\r<br>96 PGS./ All Ages ... $6.99\r<br>", "Marvel Adventures Fantastic Four (2005) #18": "Flying cars, covert missions and secret handshakes...by day, she is the Invisible Girl of the Fantastic Four, but by night, she is...SUE STORM, SECRET AGENT!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Heroes Reborn: Iron Man (Trade Paperback)": "Iron Man left two lives behind when he vanished, but can he avoid his former mistakes in his new one? The armored Avenger takes on Hydra, Heralds and the Hulk - and the eyes of the Marvel Universe are upon him in the form of Loki, the Watcher and Onslaught himself! Featuring Doc Samson and - or rather, AS - the Abomination! Plus: Rebel O'Reilly, later of THUNDERBOLTS fame! Collects IRON MAN (VOL. 2) #1-12.\r<br>336 PGS./Rated A ... $29.99\r<br>", "Fantastic Four: First Family (Trade Paperback)": "For the first time, untold secrets of the Fantastic Four's earliest days are revealed! What happened the moment after Reed Richards' rocket crash-landed? What happened - to Sue Storm, to Ben Grimm, to Johnny Storm - in the days following that fateful event? An in-depth, action-packed, psychologically thrilling exploration of the FF's origin! Collects FANTASTIC FOUR: FIRST FAMILY #1-6.\r<br>144 PGS./Rated A... $15.99\r<br>", "Marvel Adventures Fantastic Four (2005) #17": "Hey, what's blue-eyed, rocky orange and in love all over? BEN GRIMM, a.k.a. THE THING! Ol' Benjy's fallen for a girl, and the only thing that could break the spell is...THE ABSORBING MAN!?!?\r<br>32 PGS./All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 6 TPB (Trade Paperback)": "At last, the Thing returns from the Secret Wars - but he's been replaced in more than just the heart of the team! The FF learn the shocking secrets of their deadliest enemy, and it only costs them everything they hold dear! Plus: Franklin Richards vs. Mephisto! And the Psycho-Man gives the Invisible Girl a makeover neither will ever forget! Guest-starring Daredevil, Spider-Man, Iron Fist and Luke Cage! Collects FANTASTIC FOUR #276-284, THING #23 and SECRET WARS II #2.\r<br>264 PGS./Rated A ...$24.99\r<br>", "Marvel Adventures Fantastic Four (2005) #16": "When the Titan known as THANOS captures Captain Marvel and uses his cosmic powered Negabands to travel to planet earth, not even the combined powers of the Fantastic Four are enough to stop him! To save the earth they must first save Captain Marvel who is trapped light years away in deep space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel 1602: Fantastick Four (2006) #1": "The race to the end of the world speed's up as the Four from the Fantastick battle the Four Who Are Frightful and Count Otto von Doom!", "Marvel Adventures Fantastic Four (2005) #15": "The Fantastic Four travel to the South Pole to study a newly-discovered species, but find themselves on the front lines of a battle against TERMINUS, the cosmic scavenger! The clock is ticking down toward Armageddon as the FF make their stand against a superior force from outer space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 3: World's Greatest (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on Klaw, the Black Panther, the Molecule Man and Dr. Doom! Collects MARVEL ADVENTURES FANTASTIC FOUR #9-12.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Black Panther (2005) #18 (TURNER VARIANT)": "CIVIL WAR Tie-in\r\n\"BRIDE OF THE PANTHER\"\r\nSPECIAL DOUBLE-SIZED ISSUE! It's the Wedding of the Century as T'Challa and Storm finally make it to the altar -- and not since Reed and Sue tied the knot have so many of Marvel's super heroes assembled for such a happy occasion.  Can this gathering offer much-needed respite from the Civil War that's erupted in the U.S., or will it too be engulfed by the insanity that's currently rocking the Marvel Universe?  Don't miss this historic event -- and turning point in the CIVIL WAR.  Featuring backup features, including a look behind the scenes at the creation of Storm's wedding gown, and wraparound cover by Frank Cho!  Part 5 (of 5).\r\n48 PGS./Rated T  ...$3.99", "Black Panther (2005) #18": "BRIDE OF THE PANTHER PART 5 The Black Panther and Storm are ready to tie the knot. Prepare for the wedding of the decade!", "Civil War (2006) #1 (sketch variant)": "Go behind the lines of the Marvel Comics event starring Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon. This bonus edition reprints CIVIL WAR #1 - plus script, sketches, deleted scenes and more!\r\n64 PGS./ Rated T  ...$4.99", "Marvel Adventures Fantastic Four (2005) #14": "While attempting to communicate with extraterrestrials via deep space communication, the Fantastic Four unknowingly gaining the attention of a powerful malevolent alien calling himself the Grand Master. Now each member of the Fantastic Four must battle in individual competition as the fate of the world hangs in the balance.\r<br>32 PGS./All Ages ...$2.99\r<br>", "New Avengers Vol. 2: Sentry (Trade Paperback)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? Collects NEW AVENGERS #7-10 and the NEW AVENGERS: MOST WANTED FILES handbook.\r<br>152 PGS./Rated A ...$14.99\r<br>", "Last Planet Standing (2006) #5": "Is this the end of the MC-2 Universe? The sequel to last year's surprise hit concludes and it's all-out action in the merry Marvel manner as...\r<br>Determined to evolve, Galactus prepares to sacrifice the Earth and the entire universe! An army of Mainframes take on a horde of Punisher robots!  The Silver Surfer unleashes his full cosmic fury against his former master!  The last heroes standing make their final assault on the planet-eater!  And Spider-Girl and a few friends take a desperate, perhaps fatal, gamble to save their world and the universe entire!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Fantastic Four (1998) #538": "CIVIL WAR TIE-IN! One member of the FF lies hospitalized, a casualty of the CIVIL WAR that's fragmented the superhuman community! And another member of the team is secretly helping the opposition...even though the consequences will tear the first family of the Marvel Universe apart!", "Last Planet Standing (2006) #4": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #13": "The space-faring Fantastic Four discover an amazing new planet! One race of aliens rules another on the surface of this strange world, but in space, things are not always as they appear. High adventure, super hero action and science fiction collide in this tale of a world gone bonkers!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Last Planet Standing (2006) #3": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99", "Fantastic Four: First Family (2006) #4": "More untold secrets of the FF's earliest days revealed!  See Reed move the team into the newly-built Baxter Building -- and see the Thing's less than thrilled reaction!  Meanwhile, the FF's first villain -- unknown until now -- finally makes his move!  But will the fledgling team disintegrate before they get to confront him?  Of course not, but order the book anyway...!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Last Planet Standing (2006) #2": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Last Planet Standing (2006) #1": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #12": "Monster Garage has nothing on Johnny Storm when he rebuilds Reed's old college ride as the hottest rod on Earth! FF villains hate eating rubber, but fans love the car. Unfortunately, a European Repo Man takes the vehicle back to its original owner in LATVERIA...\r<br>32 PGS./All Ages ...$2.99\r<br>", "Civil War (2006) #1 (Turner Variant)": "THE LANDSCAPE OF THE MARVEL U IS CHANGING AND IT'S TIME TO DECIDE: WHOSE SIDE ARE YOU ON?  \r\nA conflict has been brewing in the Marvel Universe for over a year, threatening to pit friend against friend, brother against brother--and all it will take is a single misstep to cost thousands their lives and ignite the fuse!  As the war claims its first victims, no one is safe as teams, friendships, and families begin to fall apart.  Civil War, a Marvel Comics event in seven parts, stars Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon!  Civil War - the cross-over that rewrites the rules - begins here in this double-sized first issue!\r\n48 PGS./Rated T  ...$3.99", "Uncanny X-Men Omnibus Vol. 1 (Hardcover)": "When a young writer named Chris Claremont took over X-Men in 1976, few fans could predict the incredible impact he would have on the Marvel Comics series. With a flair for realistic dialogue, heartfelt storylines and hard-hitting action, Claremont's writing breathed life into the characters. In collaboration with artists Dave Cockrum and John Byrne, Claremont crafted a run still heralded as a definitive era on the book. UNCANNY X-MEN became more than just another super-hero title: this diverse cast of mutants fighting against prejudice and intolerance has resonated in the hearts of millions of devoted readers. Now, the first five years of their landmark run on UNCANNY X-MEN are collected in one oversized volume. This keepsake edition also includes all original letters pages, newly remastered coloring and other uncanny extras! Collects UNCANNY X-MEN #94-131 and ANNUAL #3, and GIANT-SIZE X-MEN #1.\r<br>848 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$99.99\r<br>", "Civil War (2006) #1": "THE LANDSCAPE OF THE MARVEL U IS CHANGING AND IT'S TIME TO DECIDE: WHOSE SIDE ARE YOU ON? A conflict has been brewing in the Marvel Universe, threatening to pit friend against friend, brother against brother--and all it will take is a single misstep to cost thousands their lives and ignite the fuse!  As the war claims its first victims, no one is safe as teams, friendships, and families begin to fall apart. Starring Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon!", "Marvel Adventures Fantastic Four (2005) #11": "He's not so tough... he just has complete control of EVERYTHING  on an elemental level. Oh, and he can take over the body of anyone in the world without even being nearby. That's all. How in the world are the FF going to stop THE MOLECULE MAN???\r<br>\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 2: Fantastic Voyages (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they meet and defeat stampeding prehistoric creatures, the subterranean Mole Man and Namor, the Sub-Mariner - and embark on a journey through time and space! Collects MARVEL ADVENTURES FANTASTIC FOUR #5-8.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Marvel Adventures Fantastic Four (2005) #10": "War-drums are beating as four heroes work their way through the most mysterious jungle in Africa. An international misunderstanding has brought them here to be hunted by a shadowy figure who has uncanny skill and the technological might of the world's most advanced nation at his disposal. Will the Fantastic Four make it back from Wakanda, and will they be friends or prey for the man known in whispers as... THE BLACK PANTHER!?\r<br>32 PGS./All Ages ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #9": "Can you hear him coming? It's KLAW, the Master of Sound! He's hit the Big Apple with a sound-proof plan to defeat the Fantastic Four: Divide and conquer, taking them on a one at a time! Can Ben, Reed, Johnny and Sue band together and mute Klaw's attacks...or will they fade into white noise?\r<br>\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "New Avengers Vol.2: Sentry (2006)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? \r\nCollects NEW AVENGERS #7-10, and the New Avengers Most Wanted Files.\r\n152 PGS./RATED A ...$19.99", "Friendly Neighborhood Spider-Man (2005) #4": "Peter has been pushed farther than he ever has been before. Farther than anyone should. So what changes are in store for him and, indeed, those he loves most? Can he go back to who he was? Does he want to?\n", "Marvel Adventures Fantastic Four (2005) #8": "Join Reed, Johnny, Sue and Ben on a journey through time and space! Lockjaw, everybody's favorite teleporting puppy, has the sniffles, and his malfunctioning powers take our Favorite Fighting Family up, down and around the universe, with no promise of returning to earth! Can Mr. Fantastic come up with a doggy cold medicine before they go careening into a black hole?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Knights 4 Vol. 4: Impossible Things Happen Every Day (Trade Paperback)": "Four tales of the Four! First, when two Inhuman children seek asylum with the Fantastic Four, old alliances are threatened and friends stand now as enemies! Next, when Reed forget their anniversary yet again, it's up to Sue's best girlfriends -- Alicia, Crystal and the Sensational She-Hulk -- to cheer her up with a night out on the town... Marvel style!  Then, on Yancy Street, someone -- or something -- is putting the hurt on the neighborhood's tough guys. Ben Urich, Jessica Jones and the Thing are on the case, but what exactly is the nature of the threat they're facing? And finally, one of the Marvel U's most powerful entities -- the reality-bending Impossible Man -- pops up to cause havoc in this offbeat tale that blurs the line between fact and fiction, men and myth! Collects MARVEL KNIGHTS 4 #19-24.\r<br>144 PGS./ Rated T+ SUGGESTED FOR TEENS AND UP ...$14.99\r<br>ISBN: 0-7851-1808-X\r<br>", "Marvel Adventures Fantastic Four (2005) #7": "The Fantastic Four have encountered big menaces, but the ego of the Submariner may be their hugest foe yet! The monarch of the seas seeks a bride, and has set his sights on the world's most Fantastic girl!\r<br>\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "SECRET WARS TPB (Trade Paperback)": "The classic 12-issue limited series is back in print! The first mega-crossover of its kind, SECRET WARS still stands as a milestone in the comic-book industry. The fate of the entire Marvel Universe hangs in the balance as all of Earth's greatest super heroes face their deadliest foes on the mysterious planet known as Battleworld! \r<br>336 pages./ T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Daredevil Vol. V: Out (Trade Paperback)": "A down-on-his-luck FBI agent has sold the hero's most guarded secret to a tabloid newspaper, exposing Daredevil's identity to the entire world. How far will the Man Without Fear go to reclaim his life?", "Friendly Neighborhood Spider-Man (2005) #2": "Spidey faces his biggest threat yet - a foe so insidious that he can't hope to handle it alone. With friends like Reed Richards, Dr. Strange and Hank Pym, he won't have to. But can even the world's greatest minds change the course of fate?", "Marvel Adventures Fantastic Four (2005) #6": "Underground action rules the day when the Fantastic Four go head-to-head with the Mole Man!  Strange tentacles and other weird stuff has been popping out of the New York City streets.  The FF want to get to the bottom of it-literally!  But when they tunnel to the Mole Man's subterranean territory, even more fantastic surprises are in store...  \r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #5": "The Human Torch is chasing a Pterodactyl around the Chrysler Building. A Brontosaurus is dragging The Thing down 5th Avenue. The Invisible Girl is trying to make a Tyrannosaurus stop chewing on her husband. Dinosaurs have come to New York, and they're not planning on going extinct this time! \r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #4": "The Fantastic Four don't feel so fantastic when their powers start failing-right when a Sentinel has decided to target them! It's not all bad though; at least Johnny has a cool new girlfriend. Or is all this connected somehow...?\r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "New Avengers (2004) #9": "\"THE SENTRY\"\r<br>The mystery of the Sentry revealed! What has kept the Sentry a secret from the world, and how will the world react to his re-emerging. Featuring guest stars galore, and the setup for the blistering new Sentry series by Sentry creator Paul Jenkins. Part 3 (of 3).\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #3": "A doctor is becoming famous for his seeming ability to cure patients of terrible diseases.  Nobody's sure how he does it, but everyone is fascinated by what seems to be a \"healing touch.\"  When the mysterious doc crosses paths with the scientific mind of Reed Richards, the FF are in for some surprises they never bargained for--and the adventures are just beginning!\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "Fantastic Four: Foes (Trade Paperback)": "The foes of the Fantastic Four take center stage! After years of continued defeat at the hands of the FF, why would a person still attempt something he has learned to be impossible? Get inside the heads of all your favorite FF foes as we watch their capers from start to finish from their perspective, their point of view, and at last learn...what were these guys thinking? Collects FANTASTIC FOUR: FOES #1-6.\r<br>144 PGS./Marvel T+ &#8230;$16.99\r<br>", "New Avengers (2004) #8": "GUEST STORY ARC ARTIST YOUNG GUN STEVE MCNIVEN!! THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from!  But will this knowledge destroy the man they are trying to help?\r<br>PLUS! A very special SENTRY sequence illustrated by Marvel legend SAL BUSCEMA!\r<br>32 PGS./T+ Suggested for Teens and Up ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #2": "When a rampaging alien from another dimension runs amok in New York City, there's only one thing to do-call in the Fantastic Four!  But what happens if they're the ones responsible?  Find out in this all-new FF adventure!\r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "4 (2004) #20": "INHUMANE\r<br>The conflict between the Family Fantastic and the Inhumans heats up with Black Bolt and Medusa's arrival on Earth. Sue is determined to keep the two Inhuman runaways safe no matter the cost, but with the rest of the FF wondering if they should even be involved in this dispute, what possible hope do she and the alien children have?   Part 2 [of 2]\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>", "Best of the Fantastic Four Vol. 1 (Hardcover)": "Follow the FF from their original adventure to the height of their success! Caught in a mental maelstrom of alien enemies! Trips into the Negative Zone, Subterranea and the soul of Ben Grimm! The triumph and tragedy of Mr. Fantastic! The Thing vs. the Thing! And who will be the last hero standing in the ultimate war...of practical jokes? Featuring Dr. Doom, Dr. Octopus, the Impossible Man, Daredevil and more! Collects FANTASTIC FOUR #1, #39-40, #51, #100, #116, #176, #236, and #267; FANTASTIC FOUR (Vol. 3) #56 and #60; MARVEL FANFARE #15; MARVEL TWO-IN-ONE #50; and MARVEL KNIGHTS 4 #4.\r<br>360 PGS./MARVEL PSR ...$29.99\r<br>", "Fantastic Four (1998) #527": "\"DISTANT MUSIC\" - A NEW ARC BEGINS HERE!\r<br>Just in time for movie season, new ongoing creative team J. Michael Straczynski (AMAZING SPIDER-MAN, SUPREME POWER) and Mike McKone (Teen Titans, EXILES) unite their talents to chart a new course for the world's greatest comic magazine! First up: an intriguing offer for a conflicted Reed, and a windfall for Ben!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: The Movie (2005) #1": "The comic adaptation of the blockbuster motion picture starring Ioan Gruffudd, Michael Chiklis, Jessica Alba, Chris Evans and Julian McMahon, this collection captures all the cinematic excitement of the new hit movie - plus a selection of the classic stories that inspired the film! Forty years ago, writer Stan Lee and artist Jack Kirby created a team of adventurers like no other that had come before. Unlike previous groups of stone-jawed super heroes who got along perfectly in their pursuit of liberty and justice, the Fantastic Four bickered, argued and fought among themselves - just like a real family. Their continued adventures around the world, into outer space and throughout uncharted dimensions have pushed the limits of the Marvel Universe, consistently challenging readers' perceptions of what a comic book could be!\r<br>120 PGS./T+ Suggested for Teens and Up ...$12.99\r<br>", "Essential Fantastic Four Vol. 4 (Trade Paperback)": "Relive more of the FF's classic exploits as they stand united against Dr. Doom, Annihilus and Galactus! Featuring the first appearances of the Kree and the microversal Psycho-Man! Guest-starring Spider-Man, Daredevil, Thor and the Warlock formerly known as Him! Lee and Kirby were the ones who started it all, and they kept it going in these cosmic tales! Collects FANTASTIC FOUR #64-83 and ANNUAL #5-6.\r\n536 PGS./All Ages ...$16..99", "Marvel Adventures Fantastic Four (2005) #1": "All adventure, all action, for all ages!  Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits.  When the world-renowned heroes happen upon some children in distress, they naturally rush to the rescue!  But not everything is as it seems, and the Fantastic Four are in for much more than they bargained for. \r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "X-Men/Fantastic Four (Hardcover)": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding adventure! Can the two teams put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence? Even as the heroes trek into the stars, the real threat to their mission might just be among themselves! It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Collects X-MEN/FANTASTIC FOUR #1-5. \r<br>120 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>ISBN: 0-7851-1520-X\r<br>", "FANTASTIC FOUR VISIONARIES: GEORGE PEREZ VOL. 1 TPB (Trade Paperback)": "Before his cross-company fame for Disturbing Crises and Avenger Adventures, Perez put the World's Greatest Super-Team through its paces - and first up was a fight with a fabulous fifties favorite! The Thing gets replaced in the FF, but who's replacing Mr. Fantastic in...the Frightful Four? Also featuring the Incredible Hulk, Luke Cage, the High Evolutionary and costumed characters never seen before or since! Collects FANTASTIC FOUR #164-167, #170, #176-178, #184-186.\r<br>200 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>", "Marvel Adventures Fantastic Four (2005)": "Marvel Adventures launches it's new Fantastic Four series with an all new, action-packed premier issue!  New York City is throwing a parade in honor of their favorite first family, but it looks like rain is in the forecast in the form of Dr. Doom!  Will MR. FANTASTIC, THE INVISIBLE WOMAN, THE HUMAN TORCH and THE THING be able to save the day and keep Times Square as clean as an all ages comic?  Find out in this specially priced opening issue!\r<br>32 PGS./ ALL AGES ...$1.99\r<br>", "G.L.a. (2005) #2": "Part 2 of 4!\r<br>\"DIS-MEMBERSHIP DRIVE\"\r<br>With the life-expectancy of hamsters, and an ever-thinning lineup, the GLA is in desperate need of new blood.  But what self-respecting super-type would sign up for THIS!? Guest stars galore, including Brother Voodoo,  El Aguila, and Captain Ultra.  Plus Spider-Man, Wolverine, Daredevil, and all the other spotlight-hogs you can't get enough of! Oh, and don't forget, in this issue ANOTHER GLAer DIES!  Well... besides Mr. Immortal.\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four (1998) #524": "This is it! The Waid/Wieringo team go out with a bang --but they have one last surprise up their sleeves as the foundation of the team is rocked one final time.  If you're hungry for one last jaw-dropping plot twist, here it is--and it's a doozy!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: Foes (2005) #4": "The Mole Man is BACK!  He's out to get revenge for all the times he's been defeated.  Now the Fantastic Four are face to face with one of the most deadly foes of their past, and it's all part of Reed's plan.\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four Vol. 2 (Hardcover)": "It seemed like a simple enough idea at the time: Now that their arch-enemy, Doctor Doom, had seemingly perished, the Fantastic Four would journey into his nation of Latveria, disassemble its war machine and set its oppressed citizens free. But what appeared to be a black-and-white situation quickly turns a murky shade of gray, and Reed Richards and his family find themselves besieged on all sides - both by those they thought of as their allies, and by the very people they are trying to save. And in the awful aftermath of their authoritative action, three of the Four must contend with the defenses of the afterlife - and storm the gates of Heaven itself to rescue a fallen teammate. They've faced Galactus, the destroyer of everything. Now, they face the creator of everything, as the FF are reunited in the hereafter. Plus: The Fantastic Four have a lot to answer for - and when you're trying to regain the trust of cynical New Yorkers, is associating with a certain misunderstood wall-crawler really a wise move? Collects FANTASTIC FOUR #503-513.", "Marvel Age Fantastic Four Tales (2005) #1": "The Fantastic Four cross the globe to meet the BLACK PANTHER and help him battle his lifelong nemesis - Klaw! A modern retelling of a classic story by Stan Lee and Jack Kirby, great for all ages!", "X-Men/Fantastic Four (2004) #3": "It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Part 3 (of 5).", "4 Vol. 2: The Stuff of Nightmares (Trade Paperback)": "While New York freezes in the icy grip of winter, an old foe resurfaces with a grudge: Namor! And the crown prince is demanding Sue make good on an old promise - even if it's over Reed's dead body. Meanwhile, closer to home, Johnny may be the only person who can help a Washington Heights woman find her missing son. Plus: Something very, very strange is happening to New York's First Family of Super Heroes. Their deepest fears and doubts are spreading from their dreams - their unconscious minds - to the waking world. What's real and what's not? The FF's old villain Psycho-Man may hold the key, but he's...dying?! Collects MARVEL KNIGHTS 4 #8-12.", "Marvel Masterworks: The Uncanny X-Men Vol. 5 (Hardcover)": "In celebration of the 25th anniversary and presented here for the first time in full-archival color, including pages straight from the Byrne/Austin originals, the Dark Phoenix Saga! \r<br>Gathered together by Professor Charles Xavier to protect a world that fears and hates them, the X-Men had fought many battles, been on adventures that spanned galaxies, grappled enemies of limitless might, but none of this could prepare them for the most shocking struggle they would ever face. One of their own members, Jean Grey, has gained power beyond all comprehension, and that power has corrupted her absolutely!\r<br>Now they must decide if the life of the woman they cherish is worth the existence of the entire universe!\r<br>Collecting X-Men #132-140, Annual #4 with special bonus features including the original X-Men #137 story where Jean Grey lived \"Phoenix: The Untold Story\" and the Claremont/Buscema Phoenix classic from Bizarre Adventures #27! And if that wasn't enough, brace yourself for a brouhaha with Wendigo and the seminal story of that furry blue elf Nightcrawler in \"Nightcrawler's Inferno.\"\r<br>", "Fantastic Four Vol. 3 (Hardcover)": "This deluxe hardcover completes the collection of Waid and Ringo's run, re-presenting the stories from FANTASTIC FOUR VOL. 5: DISASSEMBLED and FANTASTIC FOUR VOL. 6: RISING STORM! In DISASSEMBLED, Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft -- and that's just the beginning! With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them -- but where to even start? And which member of the team will make a decision that will radically change the Fantastic Four for some time to come? Also: Witness the genesis of an all-new, all-twisted Frightful Four! And in RISING STORM, Galactus's worst Herald ever is running out of time! So far, Johnny Storm has been able to stall Galactus from sating his cosmic hunger -- but that luck won't hold forever. What planet will be chosen as Galactus's next victim? The reintroduction of a fan-favorite Marvel Universe hero into the battle may have caused more problems than it solved, because not even he can save the Fantastic Three from Johnny's newfound might! Who will live, who will die and how will Johnny ever be the same now that he's tasted the Power Cosmic? Collects FANTASTIC FOUR #514-524. \r<br>256 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Fantastic Four (1998) #520": "\"GALACTUS\" PART 1 (OF 6)\r<br>No answers here, intrepid fans - all we'll say is this: no matter what your guess, we promise you'll be surprised by the answer!\r<br>", "Marvel Masterworks: The Fantastic Four Vol. 8 (Hardcover)": "Pony up, True Believer, the amazing eighth manic Masterworks featuring the First Family of Funnybooks is coming your way! Collecting an ironclad cadre of consecrated classics, this one's packed with more drama than you can shake a Skrull at! \r<br>Let's break it down: the Silver Surfer pursued by none other than the world-devouring Galactus; the FF vs. Spidey, DD and Thor in a barnstorming brouhaha; a fantastic voyage into the Microverse to battle the Psycho Man; the Thing-cured!; the first appearance of Annihilus; Crystal, the Inhuman, joins the FF, and one of comics' most historic moments, the birth of Franklin Richards-it just doesn't stop!\r<br>This one's a humdinger so chock-full of excitement it's ready to burst! And it's all brought to you by no less than the minds that made Marvel magnificent, Stan and Jack! 'Nuff Said!\r<br>Collecting FANTASTIC FOUR (VOL. 1) #72-81 and ANNUAL #6\r<br>272 PGS./All Ages ...$49.99\r<br>", "Fantastic Four Visionaries: John Byrne Vol. 3 (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues! Featuring a four-part epic deep within the Negative Zone -- and the death of...Reed Richards?! Plus: Galactus devours the Skrull homeworld, and the Fantastic Four say goodbye to the Baxter Building! Guest-starring the Avengers! Collects FANTASTIC FOUR #251-257 and ANNUAL #17, AVENGERS #233, and THING #2.", "X-Men/Fantastic Four (2004) #1": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding limited series! Can the X-Men and the Fantastic Four put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence?! Join megawatt creator Pat Lee and writer Akira Yoshida (THOR: SON OF ASGARD) for mutant meyham and fantastic fights!", "Fantastic Four (1998) #519": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" FINALE! PART 3 (OF 3) Galactus the World-Eater is coming to Earth to choose one of the Fantastic Four as his new herald -but which one?  The consequences of his choice will set the tone and scope of the series, a", "4 (2004) #12": "\"THE STUFF OF DREAMS\" PART 3 (OF 3)\r\nEvery dream must come to an end-even the fear-induced nightmares that Psycho-Man is spreading across Manhattan!  It's the climax to the first year of Marvel Knights 4 and the final showdown between the FF and their reality-warping foe.  Hold onto your seats - especially you slight Marvelites - that wind blowing is a radical shift in the status quo of Marvel Comics' First Family of super heroes and adventurers!", "Fantastic Four (1998) #518": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 2 (OF 3) With public opinion of the FF at an all-time low and with all of Manhattan endangered by a mysterious alien overlord, which member of the team will make a decision that will radically change the Fan", "4 (2004) #11": "\"THE STUFF OF DREAMS\" PART 2 (OF 3) With a diseased Psycho-Man loose somewhere in the city, the very fabric of New York's reality is unraveling at a frightening rate. While Susan hunts their old foe, the rest of the Fantastic Four try to stem the tide of", "Fantastic Four (1998) #517": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 1 (OF 3) The FF goes \"widescreen\" in a tale of epic scope and proportion as Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft--and that's just the beginning!  With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them--but where to even start?", "Fantastic Four (1998) #516": "\"DYSFUNCTIONAL\" PART 3 (OF 3) The final showdown with the all-new, all-twisted Frightful Four -- and the shocking secret of their newest member could destroy both teams! ", "Marvel Masterworks: The Fantastic Four Vol. 7 (Hardcover)": "\"The First Family of Super Heroes ushers in a new era of Marvel Masterworks with the addition of Fantastic Four Vol. 7 to the Masterworks Library! Showcasing the unmatched team-up of Stan Lee and Jack Kirby, this edition is a must-have! Hold on to your seats, True Believers, as the F.F. battle Blastaar, the Living Bomb-Burst, the Sandman, Ronan the Accuser and more! Also featuring the Silver Surfer, the incomparable Inhumans and the first appearance of Him, the man later to be known as Adam Warlock! Collecting Fantastic Four (Vol. 1) #61-71 and Annual #5.\"", "Fantastic Four (1998) #515": "An alternate dimension version of the Fantastic Four may scuttle any chance the FF ever has of redeeming its reputation!", "Fantastic Four (1998) #514": "\"DYSFUNCTION\" PART 1 (OF 3) At an all-time low, the Fantastic Four are confronted by a cracked-mirror version of their own team -- one that may scuttle any chance the FF ever has of redeeming its reputation!", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 2 TPB (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues as the FF face off against two of their greatest foes: Galactus and Doctor Doom! Guest-starring the Black Panther, Thor, Spider-Man, Iron Man, Daredevil, Doctor Strange, the Inhumans, the X-Men and more! Collects FANTASTIC FOUR #241-250.", "Fantastic Four Vol. 1 (Hardcover)": "\"A team -- and a family -- of adventurers, explorers and imaginauts, the Fantastic Four live lives both ordinary...and extraordinary. Now, Reed Richards, Sue Richards, Benjamin Grimm and Johnny Storm blast into this fully loaded, oversized hardcover -- featuring an entire year's worth of the World's Greatest Comic Magazine and more than 30 pages of ever-lovin' extras! Finally, learn the truth behind Mister Fantastic's decision to cast his friends as the greatest squad of superhuman adventurers ever assembled; see the Fantastic Four face off against a sentient mathematical equation driven mad by love, an infestation of insects from another dimension, a cascading wave of molecular instability and a teammate on a homicidal rampage; and bear witness to history in the making as Doctor Doom does...the unthinkable. Collects FANTASTIC FOUR #60-70 and #500-502.\"", "Fantastic Four (1998) #513": "\"SPIDER SENSE\" PART 2 (OF 2) It's a sad day to be the Human Torch, when your popularity has sunk so low even the web-slinger is more beloved by the people of New York City! Plus: Who is the woman from Reed Richards' past?", "Fantastic Four (1998) #512": "pt. 1 (of 2)\r\nThe FF have a lot to answer for in the aftermath of AUTHORITATIVE ACTION ... and when you're trying to regain the trust of cynical New Yorkers, is allying with a certain misunderstood wall-crawler a wise move?\r\n32 PGS./MARVEL PSR...$2.25", "Amazing Spider-Man Vol. 6 (Trade Paperback)": "Peter spends his birthday as Spidey fighting an inter-dimensional threat that's descended on Manhattan. Alongside a who's who of Marvel Universe guest-stars - including the FF, Thor, Iron Man, the X-Men's Cyclops and Dr. Strange, the battle culminates in a trip through time, where Peter/Spider-Man meets ALL of his greatest adversaries like Doctor Octopus and the Green Goblin, and one very special and unexpected reunion!\r\nCollects AMAZING SPIDER-MAN #57-58, the landmark #500, 501-502!", "Fantastic Four (1998) #511": "They've faced the destroyer of everything - Galactus. Now they face the CREATOR of everything, as the Fantastic Four are reunited - in the HEREAFTER!", "Fantastic Four (1998) #510": "Having embarked on the ultimate journey, Reed Richards and the rest of the FANTASTIC THREE must contend with the defenses of the afterlife - and storm the gates of Heaven itself!\r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #509": "\"HEREAFTER\" pt 1 (of 3)\r\nNo, not a misprint! The regular creative team readers demanded is \"back\" for good as the Fantastic Three embark on their greatest adventure yet by storming a 'fantastic' realm brand new to even them. They've heard of it of course, but have never there before! \r\nAnd yes ... the FANTASTIC THREE!\r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #508": "\"AUTHORITATIVE ACTION\" CONCLUDES!\r\nIt's Armageddon from without and within as Nick Fury and S.H.I.E.L.D.'s peacekeeping forces besiege the FF and Latveria, and Marvel's First Family is simultaneously besieged by an evil at the heart of their own team! \r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #507": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Fantastic Four (1998) #506": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Fantastic Four (1998) #505": "\"AUTHORITATIVE ACTION\" pt. 3 (of 6)\r\nAs American forces mass on the border of Latveria, the Fantastic Four are named traitors to the United States!\r\n32 PGS. /MARVEL PSR...$2.25", "Amazing Spider-Man (1999) #500": "Two generations of the greatest Spider-Man artists of all time mark a milestone!\r\nIt's Peter Parker's birthday ... but how do you throw a surprise party for someone with a Spider-sense? Someone figures out how and Spidey spends his special day looking back at his career and EVERY villain he's faced over those years ... against his will!\r\nA special story for Spidey fans new & old! \r\n48 PGS./MARVEL PSR...$3.50 (note price & page count)", "X-Men Legends Vol. III: Arthur Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.", "Thor Legends Vol. 2: Walt Simonson Book II (Trade Paperback)": "Few people have ever left their mark on one character quite the way Walter Simonson has. His work on the MIGHTY THOR swept the Norse God of Thunder to heights never before seen and rarely achieved since. Spanning epic tales of heroism and treachery, love and war, Simonson's work is often considered the definitive Thor. From the majesty and mystery of Asgard to the gritty streets of New York City, Thor was never the same. That is the mark of a true visionary. \r\nThis volume continues the collection of Simonson's epic run, reprinting THOR #349-355 and #357-359.", "X-Men Legends Vol. 3: Art Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.\r\nCollects NEW MUTANTS SPECIAL EDITION #1; X-MEN ANNUALS #9-10, 12; FANTASTIC FOUR #347-349.", "Exiles (2001) #10": "Galactus has come! Though the denizens of this Earth have spent years learning the art of combat, they are no match for the Eater of Worlds. It is up to the Exiles to save the planet!", "Exiles (2001) #9": "It is Mimic's turn to fight in the arena. His opponent: The Captain! If he is to best the Skrull-favored opponent, then he must use his secret weapon...", "Exiles (2001) #8": "The Exiles are on a Skrull-occupied Earth. Now they must fight in the arena for the amusement of their alien oppressors!", "Fantastic Four: 1234 (2001) #4": "\"Prime Mover\" Learn the terrible history of Reed Richards and see Doom's plan revealed in all its horrible glory. Prepare for a game of robot annihilator chess on the planes of reality and the great metaphysical beyond!", "Fantastic Four: World's Greatest Comics Magazine (2001) #12": "Stan \"The Man\" Lee scripts the fantabulous FANTASTIC FOUR from the days of yore in his own often imitated, but never duplicated fashion! Everyone from the Fearless Front Facers to the Quite 'Nuff Sayers will be here, so don't be square and miss out on the conclusion of our 12-issue retro run! It's Dr. Doom vs. Galactus and the FF vs. Dr. Doom, with the fate of the world, nay, the universe, in the balance!", "Fantastic Four: 1234 (2001) #3": "\"Darkness & The Mole Man\" Doom has crushed another member of the Four. Alicia is trapped in the subterranean caverns of the Mole Man, with only Johnny Storm to save her. But Namor has extinguished the Human Torch-can Storm still summon the flame?!", "Fantastic Four: World's Greatest Comics Magazine (2001) #11": "The FF's fortieth-anniversary special rockets towards its conclusion! Did the Fantastic Four survive last issue's bout with the Asgardians? Is this the World's Greatest Funeral Magazine? No way! Gearing up for the big finale we bring you Planet Doom -- and the return of the Cosmic Cube-wielding dictator of Latveria!", "Fantastic Four: 1234 (2001) #2": "\"Staring At The Fish Tank\" Ben Grimm has been transformed and badly wounded. It is rumored that Prince Namor is massing forces at the outskirts of American waters. And Johnny must engage a powerful foe. With Reed still in isolation, who can help?", "Fantastic Four: World's Greatest Comics Magazine (2001) #10": "Asgard...trashed by the Cosmic Cube! How does a journey to the home of the Norse gods fit into the FF's mission to save reality from the clutches of a Cosmic Cube-powered Dr. Doom?", "Hulk (1999) #32": "In order to save him, why must Ant-Man take a fantastic voyage inside the gamma-powered behemoth known as the Hulk? And will his cure prove worse than the certain death awaiting Bruce Banner?", "Fantastic Four: 1234 (2001) #1": "\"Once Upon a Time On Yancy Street\" When Reed Richards has the \"Deep In Thought\" sign up, the rest of the FF know not to bother him. But the heat is rising in Manhattan and a Doombot has just gone active. A sinister game is afoot!", "Hulk (1999) #30": "Paul Jenkins' final story begins! The ravaged body of Bruce Banner quits, leaving the Hulk no other option but to turn to his greatest nemesis!", "Fantastic Four: World's Greatest Comics Magazine (2001) #7": "Dr. Doom continues his quest for power! But what is his ultimate goal? And exactly how will the Inhumans play a part in helping him attain it?", "Fantastic Four: World's Greatest Comics Magazine (2001) #6": "Everyone from the Black Panther to Nick Fury to the Silver Surfer guest stars as Mr. Fantastic races against time to unravel the master plan of Dr. Doom!", "Fantastic Four: World's Greatest Comics Magazine (2001) #3": "Who is the evil genius behind the recent attacks on the FF? If Namor and the Kree Sentry weren't enough, now our fab foursome must contend with the X-Men, Spider-Man, Doctor Strange and the mutant-hunting Sentinels!", "Fantastic Four: World's Greatest Comics Magazine (2001) #2": "If you're a fan of the FF (and who isn't), this is the issue for you: Dr. Doom! Crystal! The Sub-Mariner! The Kree Sentry! The Fantasti-Car! An all-star cast of creators delivers all-out action in the Mighty Marvel Manner!", "Fantastic Four: World's Greatest Comics Magazine (2001) #1": "In 1961, a quartet of intrepid explorers rocketed into space, were bathed in mysterious Cosmic Rays, and were transformed into the fabulous Fantastic Four! Mr. Fantastic, brilliant inventor with an elastic body! Invisible Woman, master of force fields! Human Torch, flaming hotshot! The Thing, monstrous man of might! In the years that have followed, this dynamic nuclear family has challenged the unknown, saving our world multiple times from the threat of alien invaders, scientists gone mad, and other-dimensional despots! Now writer/artist Erik Larsen and a host of terrific talents ask \"What if Stan Lee and Jack Kirby concluded their historic run on FF with one last wild adventure?\" The answer begins at the world famous Baxter Building, home of our famous foursome, which is pillaged and looted by none other than the team's arch-nemesis, Dr. Doom! What is the man in the iron mask looking for? And what does the Mad Thinker have to do with all this?", "Cable (1993) #79": "The \"Revolution\" event hits Cable! Demonic possessions are flaring up, and it's only a matter of time before all Hell breaks loose! Who are the Undying, and what sinister plan is beginning to unfold?", "Earth X (1999) #12": "The new Galactus has arrived...to save Earth X?", "Earth X (1999) #11": "Black Bolt has failed to prevent Earth X's destruction...or has he?  Who is the final hope for the doomed planet?", "Earth X (1999) #10": "Black Bolt is Earth X's only hope as Cap's final battle with the Red Skull begins!", "Earth X (1999) #9": "A terrifying truth behind the genesis of Earth X is revealed as its end nears.  Who can stop its destruction?", "Exiles Vol. II: A World Apart (Trade Paperback)": "Deep in the Canadian outback lurks the gamma-spawned behemoth known as the Incredible Hulk, but can the Exiles and  Alpha Flight save an entire nation from the green goliath's rampage?", "Daredevil Vol. II: Parts of a Hole (Trade Paperback)": "Maya Lopez' deaf, but capable of assimilating an individual's fighting style on sight' has set her sights on Daredevil, who she believes to be responsible for her father's death.", "Earth X (1999) #8": "Red Skull confronts President Osborn as Colossus joins Cap's crew.", "Earth X (1999) #7": "Banner and Thor are betrayed as Ben Grimm is recruited for the war against the Red Skull!", "Earth X (1999) #6": "What has become of Professor Xavier's dream and how does Scott Summers press on?", "Earth X (1999) #5": "Daredevil comes to Cap's aid as Loki's cruel trick on Thor is revealed.", "Earth X (1999) #4": "The Red Skull's army grows and Cap has been defeated, physically and spirtually.  But there is a hope for Earth X...", "Earth X (1999) #3": "Spider-Man is out of shape and has no sense of responsibility.  Reed Richards has doned Doctor Doom's armor.  Who can save America from the teenage Red Skull?", "Earth X (1999) #2": "Learn the final fate of the Fantastic Four in their final battle against Doctor Doom and Namor!", "Uncanny X-Men (1963) #335": "Apocalypse awakens and consults the Watcher. And Onslaught gathers his minions!", "Sensational She-Hulk (1989) #48": "Reed Richard's plan to switch Jen and Weezi back into their own bodies fails!", "Fantastic Four Annual (1963) #25": "CITIZEN KANG PART 3 Time and space converge across the continuum, as the Fantastic Four joins the fray against Kang! What is Timely Industries? Plus, a special featurette highlighting the top ten villains of the Fantastic Four!", "Nick Fury, Agent of S.H.I.E.L.D. (1989) #26": "The Avengers and Fantastic Four guest-star, helping Nick Fury pick up the pieces after Hydra’s attack. Baron Strucker makes a startling revelation about S.H.I.E.L.D.’s early history. Wolverine sharpens his claws for war!", "Doctor Strange, Sorcerer Supreme (1988) #32": "Silver Dagger comes for what is rightfully his…something in the possession of none other than Doctor Strange!\n", "Marvel Comics Presents (1988) #80": "Note: this issue contains only the Weapon X story by Barry Windsor-Smith.", "Nick Fury, Agent of S.H.I.E.L.D. (1989) #24": "It's the return of the super hero poker game as Nick Fury, the Thing, Mr. Fantastic and Captain America play for high stakes against the Mandarin. ", "Fantastic Four (1961) #349": "A Skrull stands revealed underneath Monster Island! But what has roped the new Fantastic Four and the entire Skrull army into a confrontation within the Mole Man's secret lair?", "Fantastic Four (1961) #348": "The new Fantastic Four's investigation has taken them all the way to Monster Island, home of the dreaded Mole Man.  Will they find out the truth about the slain FF...or another set of secrets entirely?", "Fantastic Four (1961) #347": "The Fantastic Four are dead!  Long live the new Fantastic Four - Spider-Man, Wolverine, Hulk, and Ghost Rider!? Can they get to the bottom of the FF's demise? And just what do the Skrulls want with this new team?", "Nick Fury, Agent of S.H.I.E.L.D. (1989) #18": "Apogee of Disaster Part 4.  Fury's adventures in space continue as the deadly Lohan the Satellite Monster stands in his way. Can Reed Richards and the Fantastic Four help Fury defeat Lohan?", "Peter Parker, the Spectacular Spider-Man (1976) #162": "A villain team-up for the ages! The Hobgoblin is back, and he busts Carrion out of prison for a single goal -- to kill Spider-Man!\n", "Secret Wars (1984) #12": "NOTHING TO FEAR The heroes have defeated their enemies--all save one. Now, with the stolen power of The Beyonder himself, Doctor Doom strikes! Who can stop him now?", "Secret Wars (1984) #11": "...AND DUST TO DUST The penultimate chapter of SECRET WARS is here! The face of Doom is revealed!", "Secret Wars (1984) #10": "DEATH TO THE BEYONDER Though the heroes have successfully driven Galactus away, they find that their seeming victory has only sealed their fate.", "Thor (1966) #352": "Surtur versus Odin for the fate of Asgard! With the help of Mr. Fantastic and The Human Torch, can the Asgardians win the day? Or will the Shining City be enshrouded in endless winter?", "Thor (1966) #351": "The forces of Asgard battle Surtur and his minions! But if Surtur can best the Asgardian continent who will stand to oppose him in Asgard itself? Will it be Thor? Odin?", "Secret Wars (1984) #9": "ASSAULT ON GALACTUS As the heroes make their last ditch effort against Galactus, Doctor Doom seizes the opportunity to grind them all under his heel.", "Secret Wars (1984) #8": "INVASION As the battle-weary heroes recuperate and repair their gear, Spider-Man makes make a discovery that will change his life and his costume!", "Secret Wars (1984) #7": "BERSERKER The death of an Avenger! The X-Men's greatest battle! And, introducing the all-new Spider-Woman!", "Secret Wars (1984) #6": "A LITTLE DEATH Galactus prepares to destroy both the heroes and the villians! Now, as both sides of the engagement plan their next move, two MIA soldiers make their return!", "Secret Wars (1984) #5": "THE BATTLE OF THE FOUR ARMIES The villains have the upper hand! As they plan their final strike, Galactus' mysterious vigil comes to a surprising end...", "Secret Wars (1984) #4": "SITUATION: HOPELESS The heroes' HQ has been destroyed! Thor has been captured by Enchantress and taken straight to the villains! Doctor Doom scores his first kill!", "Secret Wars (1984) #3": "TEMPEST WITHOUT, CRISIS WITHIN Doctor Doom creates two new villains Called Volcana and Titania to take the heroes down! Meanwhile, Spider-Man battles the X-Men!", "Secret Wars (1984) #2": "PRISONERS OF WAR Doctor Doom brings Ultron back online to battle the champions of Earth! Meanwhile, Magneto takes the lone-wolf route!", "Secret Wars (1984) #1": "THE WAR BEGINS Earth's heroes have been whisked away to a mysterious construct in space, but they are not alone. Earth's villains have also appeared. Who is to blame for this meeting of good and evil?", "Alpha Flight (1983) #1": "Introducing Canada's premiere superhero team, Alpha Flight, as they take on the dimensional beast Tundra!\n", "X-Men Annual (1970) #5": "The X-Men versus the hordes of the Badoon! When a galactic threat looms over the merry mutants, the team calls in the aid of experts- the Fantastic Four! Meanwhile, Storm can’t shake her feelings for Arkon, and her need to end the battles in his home world. Can the X-Men and the Fantastic Four usher in an age of peace between two warring alien races?", "Uncanny X-Men (1963) #135": "DARK PHOENIX! Jean Grey has become the Dark Phoenix, a corruption of the cosmic entity bonded to Jean. Now the Dark Phoenix seeks to destroy everything in its path! What can the X-Men do to defeat it? Must they kill Jean Grey?", "Marvel Two-in-One (1974) #36": "The Thing, alongside Skull the Slayer, attempts to salvage a fallen plane. But with T-Rex and Brontosauruses hot on their trail, will these lost men, and woman, ever escape from the age of dinosaurs? Even more of a complication? Skull and his crew are under the thumb of the Jaguar Priest, savage king of this prehistoric world!", "Super-Villain Team-Up (1975) #1": "Will Doctor Doom and Sub-Mariner continue to be partners in crime? Their recent heists have fizzled in failure, and the two baddies have an ugly falling out. But will their alliance be renewed when Sub-Mariner falls into trouble and requires Doom's aid?", "Marvel Two-in-One (1974) #8": "On Christmas Eve, Mr. Fantastic discovers a new star above Arizona and the Thing investigates. Miracle Man reenacts Biblical Bethlehem to become a god!", "Daredevil (1964) #2": "Daredevil vs. Electro! What chance does a blind man have against the master of electricity? Plus, an appearance by the Fantastic Four's The Thing!", "Fantastic Four (1961) #6": "Doctor Doom and the Sub-Mariner have joined forces to stop the Fantastic Four once and for all. But can the Sub-Mariner's hatred of all humans be tamed by the beauty of Sue Storm?", "Fantastic Four (1961) #4": "The Sub-Mariner has returned!  Calling upon his mighty sea creature army, he will have his revenge on the human race. It's up to the Fantastic Four to stop him.", "Fantastic Four (1961) #3": "The Fantastic Four has now become world heroes! See the super family get their costumes for the first time.", "Fantastic Four (1961) #1": "The Fantastic Four spring to action as a team for the first time. As they learn how to control their new found powers, will it be enough to stop the fury of the Mole Man?"}