{"Age of X-Man: The Amazing Nightcrawler (2019) #4": "THE MOST FORBIDDEN LOVE! Role model and idol to millions Kurt Wagner (better known as Nightcrawler) may have had a lapse in judgment a few years ago...and only Mystique can lead him to the fruit of his loins! ", "Uncanny X-Men (2018) #18": " First-the X-Men lose one of their own. Then-the new Black King of the Hellfire Club makes a move ", "X-Men Black (Trade Paperback)": "Collects X-Men Black – Magneto, X-Men Black – Mojo, X-Men Black – Mystique, X-Men Black – Juggernaut And X-Men Black – Emma Frost. Magneto. Mojo. Mystique. Juggernaut. Emma Frost. Apocalypse. The X-Men have gone head-to-head with all of them countless times over the years – but now the villains are the stars! From the cold vacuum of space to the jungles of the Savage Land, from dominating a secret society’s inner sanctum to crashing through all walls in their way, these titanic tales show what makes the X-Men’s opponents the most formidable in the universe. Chris Claremont sets Magneto on a new path! Mojo finds…love? Mystique delivers revenge-fueled chills, seductive thrills and brutal kills! Emma Frost sets her sights on the Hellfire Club! Nothing can stop the Juggernaut…until now! And a transformative tale of Apocalypse that must be seen to be believed!", "Weapon X (2017) #27": "WEAPONS OF SELF-DESTRUCTION! Two roads diverged in a blood-soaked wood. For a time, Sabretooth took the one less traveled. In this issue, he pays for it. Everything changes here.", "X-Men: Marauders (Trade Paperback)": "Collects X-Men (1991) #188-199 and #200-204 (A stories) and X-Men Annual (2007) #1. Mike Carey reinvigorates the X-Men! A shaken Sabretooth arrives at the X-Men’s doorstep — asking for asylum! But what could possibly strike terror into the heart of Victor Creed? The Children of the Vault have risen…and they spell doom for the X-Men! Rogue must assemble a dangerous new squad — including Mystique, Cable, Lady Mastermind and Sabretooth — but when a terrifying alien threat emerges, can Rogue hold on to her sanity? Meanwhile, the deadliest foes in the X-Men’s history, the Marauders, return — and Gambit is front and center among their ranks! Why are the Marauders eliminating specific mutants? And what prize do they plan to rip from the X-Men’s hands? It’s an exciting new direction for the X-Men that sets up the status quo for the “Messiah Complex” event!", "Weapon X (2017) #26": " The devilish lothario called Azazel takes Weapon X-Force to hell! He can...but will he? It’ll take every trick in Mystique’s book to make him see the light! ", "Weapon X (2017) #25": " Weapon X-Force needs to go to hell! But the only one who can take them there! ", "X-Men: Black - Mystique (2018) #1": " THAT’S SO RAVEN! What’s a day in the life for Raven Darkholme, A.K.A. Mystique? Brutal kills, revenge-fueled chills, seductive thrills...and that’s all before breakfast! Award-winning author Seanan McGuire (X-MEN GOLD ANNUAL #2) and rising star Marco Failla take Marvel’s multifaceted mutant murderess for a spin! PLUS: Part 3 of X-MEN BLACK: APOCALYPSE! ", "Weapon X (2017) #24": " A SHALLOW GRAVE FOR WEAPON X-FORCE! The head of the satanic cult raising hell for mutants is revealed! Just in time to give Sabretooth and his crew their last rites… ", "Astonishing X-Men (2017) #12": "THE FINAL SHOWDOWN FOR…A MAN CALLED X! It’s XAVIER and PSYLOCKE versus PROTEUS! In a battle for reality itself, which of these super-powered psychics will win? And when the dust settles, what’s next for the Astonishing X-men?", "Death of Wolverine: The Complete Collection (Trade Paperback)": " The man called Logan is no stranger to death. Now, at the end of a long and violent life, he faces his own date with the reaper — but you can be sure Wolverine will go out fighting! The impact of his demise will be felt far and wide as X-23, Daken, Sabretooth, Mystique and Lady Deathstrike continue to shape Logan’s legacy. But who are the latest subjects of the revamped Weapon X program, and what is their connection to Wolverine? Plus: The X-Men struggle to cope with Wolverine’s death, while Deadpool and Captain America fight to protect his memory! Collecting DEATH OF WOLVERINE #1-4, DEATH OF WOLVERINE: THE WEAPON X PROGRAM #1-5, DEATH OF WOLVERINE: THE LOGAN LEGACY #1-7, DEATH OF WOLVERINE: DEADPOOL & CAPTAIN AMERICA #1 and DEATH OF WOLVERINE: LIFE AFTER LOGAN #1. ", "X-Men: Legionquest (Hardcover)": "Collects Uncanny X-Men (1981) #318-321, X-Men (1991) #38-41, X-Men Unlimited (1993) #4-7, X-Men Annual (1992) #3, X-Factor (1986) #107-109, Cable (1993) #20. The epic story that ushered in the Age of Apocalypse! Legion’s once-shattered psyche is finally united, with a singular purpose: to make up for all the misery he has visited on his father, Charles Xavier. And to do it, he plans to make Xavier’s dream a reality — by traveling back in time to kill its greatest obstacle, Magneto! The X-Men scramble to stop him from altering history — but, lost in the past, can they thwart Legion’s misguided mission before the entire Marvel Universe is wiped away? Plus: Mystique seeks revenge against Legion, even as her shocking connection to Nightcrawler is revealed! And Storm returns to Cairo to face her past, but will she join the all-new Hellfire Club?", "Astonishing X-Men (2017) #9": "NUKE-CLEAR WAR Part 3! As a reality storm batters London and its inhabitants, PSYLOCKE must choose between trusting the mysterious MAN CALLED X and letting her beloved city fall into ruin. The SHADOW KING freed a brand-new threat with his dying throes, but who is this new threat? And how can the X-Men hope to stand against an emery that can warp reality itself?", "Astonishing X-Men (2017) #8": "One of the most terrifying adversaries the X-MEN have ever faced has returned. CHARLES XAVIER may have made the greatest mistake of his life. Still reeling from their narrow escape from the SHADOW KING and the loss of a crucial ally, how will the mutant heroes face an enemy with the power to remake the world?", "Astonishing X-Men by Charles Soule Vol. 1: Life of X (Trade Paperback)": "Collects Astonishing X-Men (2017) #1-6. Charles Soule and a stellar roster of superstar artists unite to put the Astonishing back in the X-Men! An ancient evil is attacking the world's most powerful minds. It will have them by the time you finish this sentence, and a moment later, it will have us all. A band of X-Men discovers the truth behind the threat, but is there any time left for Psylocke, Old Man Logan, Bishop, Archangel, Fantomex, Rogue and Gambit? In an action-packed X-epic, they must head to the astral plane in pursuit of...the Shadow King! But in this brain-bending mindscape, not everything is as it seems, and reality is a relative concept. Will this impromptu squad of X-Men be able to contain the chaos from spilling out into the world?", "Astonishing X-Men (2017) #6": "LIFE OF X CONCLUSION! We are trapped in the SHADOW KING’s web. All strands have led here. We have seen sacrifice, battle, manipulation, lies and the darkest truths. Now, at last, CHARLES XAVIER and his X-Men will save one world and lose another.", "Astonishing X-Men (2017) #5": "THE LIFE OF X CONTINUES! The SHADOW KING and CHARLES XAVIER continue their twisted game in the ASTRAL PLANE, competing for the very lives of GAMBIT, ROGUE, OLD MAN LOGAN, FANTOMEX and MYSTIQUE. And back in the real world, this game is leaving lasting repercussions as PSYLOCKE, BISHOP and ANGEL attempt to defend LONDON from Shadow King’s psychic attacks. With two of their allies fallen, can Xavier rally his X-Men for one final push against their foe?", "Astonishing X-Men (2017) #4": "A MONSTER IS LOOSE IN LONDON. HIS NAME IS LOGAN. Psylocke, Bishop and Angel are all that stand between a mind-poisoned Logan and a mountain of corpses. Rogue and Gambit consider their options. Fantomex and Mystique get the party started. And somewhere, the Shadow King laughs and laughs…", "Uncanny X-Men (2016) #15": "Psylocke and Magneto don’t see eye to eye. Whereas Magneto is willing to do anything it takes to ensure the future of mutantkind, Psylocke believes there are some lines that shouldn’t be crossed. And when she stands in Magneto’s way, he may just decide that in the quest to safeguard his race, Psylocke is an acceptable sacrifice to make!", "X-Men: Worst X-Man Ever (2016) #2": "Bailey may be the worst X-Man ever...but Mystique sees something in him! Meanwhile...he tries to fit into every part of the X-Universe! The new X-Mini by Say Anything frontman Max Bemis continues here!", "Magneto (2014) #11": "AXIS TIE-IN!\n- The Red Skull is sending the world into a spiral of destruction...and Magneto is one of a handful of heroes with the means to stop him!\n- But will the Master of Magnetism also crumple before the maniac who's using the formidable telepathic powers of his deceased best friend to usher in his new, terrifying Reich Eternal?\n- With the grudge personal on MANY levels, Magneto is amply motivated to be the one to take down the Skull once and for all!", "Wolverine (2013) #13": "IT ALL ENDS HERE! THE FINAL CHAPTER OF KILLABLE! Logan&#39;s last stand against Sabretooth. The Microverse virus offers Logan a trade: his healing factor for his help in evading S.H.I.E.L.D. &ndash; can he afford to say no?", "Wolverine (2013) #12": "<ul><li>The penultimate chapter of KILLABLE, the storyline that will change Wolverine as we know him forever!</li><li>Wolverine is confronted with the mastermind behind the bounty on his head.</li><li>Meanwhile, the virus is in its final stages of a hostile takeover of the human race!</li></ul>", "Uncanny X-Men (2013) #11": "<ul><li>See what life&#39;s like at the new Xavier School.</li><li>But what are they being trained for?</li></ul>", "Astonishing X-Men (2004) #65": "- As the world shivers beneath a heavy blanket of snow, it's time for the final showdown -\nIceman vs. Iceman!\n- When all is said and done, who is Bobby Drake? What kind of man will he be? And how can he reconcile the things that he's done?", "Uncanny X-Men (2013) #9": "<ul><li>One mutant learns that once you leave the X-Men, the real world can be a punishing place.</li><li>Another new mutant learns just what it means to be an X-Man.</li><li>And Magneto isn&#39;t the only mutant working with SHIELD. What mystery mutant has taken up with the espionage agency keeping tabs on the X-Men?</li></ul>", "Astonishing X-Men (2004) #64": "<ul><li>The apocalypse has arrived...and it&#39;s made of ice.</li><li>A catastrophic storm has buried much of the northern hemisphere under the deadly weight of snow, creating a kingdom where only one man rules: Bobby Drake.</li><li>But Bobby&#39;s mind has become fragmented and lost. Who will stop his reign of terror?</li></ul>", "Astonishing X-Men (2004) #62": "<ul><li>Iceman is changed after his multi-dimensional ordeal. What aftershocks will this have in his life?</li><li>What is left of the Astonishing X-Men, The X-Treme X-Men and the Age of Apocalypse?</li></ul>", "All-New X-Men (2012) #10": "<ul><li>The Uncanny X-Men come to the Jean Grey School to recruit.</li><li>Who will join Cyclops and his revolutionary crew? The answer will shock you!</li><li>Mystique and Sabretooth continue to hatch their master plan and it doesn&rsquo;t bode well for the All-New X-Men.</li></ul>", "All-New X-Men (2012) #9": "<ul><li>The Original Five X-Men get new costumes!</li><li>Series main-artist Stuart Immonen returns!</li><li>Mystique makes her big move.</li></ul>", "Uncanny X-Force (2010) #30": "It's all built to this: FINAL EXECUTION enters its last act! The new Brotherhood of Evil Mutants makes their move! Fantomex's deceptions come back to haunt the team!", "Uncanny X-Force (2010) #27": "<ul><li> X-Force land themselves somewhere you&#39;ve never seen them.\n</li><li> A new member joins the team!\n</li><li> Rising star Julian Totino Tedesco (VENOM: CIRCLE OF FOUR, JOHN CARTER GODS OF MARS covers) joins the best creative team in comics for two issues!</li></ul>", "Uncanny X-Force (2010) #26": "X-FORCE is put to the test when a powered group named the OMEGAS battle some of the team's strongest members! Meanwhile, Psylocke goes to the Jean Grey School for Higher Learning to visit an old friend, but what she finds may shock her to the core!", "X-Men: Regenesis (2011) #1": "After SCHISM, who will the mutants follow - Cyclops or Wolverine? Setting the stage for WOLVERINE & THE X-MEN #1 and UNCANNY X-MEN #1 and the rest of the X-Men Universe!", "Mystique by Sean Mckeever Ultimate Collection (Trade Paperback)": "When everyone's favorite shape-shifting secret agent - now in the employ of Professor X - is sent to Europe to investigate a biotech company rumored to be using mutants as guinea pigs, she discovers a mystery far greater than anything she'd imagined! As Mystique and Shortpack get closer to their objective, they must confront a new revelation: Someone is selling transient mutants as guinea pigs, slaves and worse! Then, Mystique sets out to find Shortpack, who's mysteriously vanished. But she's got enough on her mind already: She has to figure out how to assassinate Professor Charles Xavier! Collecting MYSTIQUE #14-24.", "Wolverine (2010) #9 (X-Men Art Variant)": "Logan needs answers about the mysterious villains who sent him to hell, and he knows exactly where to go to get them: Mystique. But Mystique has troubles of her own, namely the unstoppable new assassin, Lord Deathstrike.", "Mystique by Brian K. Vaughan Ultimate Collection (Trade Paperback)": "Born with the ability to look and sound like anyone, the shapeshifting Mystique is a former pro-mutant terrorist wanted by nearly every government in the world for alleged crimes against humanity. She's used her morphing powers to stand against the X-Men in their battle for mutant-human coexistence for years - but in this increasingly complicated world, Mystique begins to find the battle lines are no longer so clear. In exchange for protection from her countless enemies, Mystique reluctantly agrees to go to work for Professor Charles Xavier, telepathic leader of the X-Men. But instead of being invited to join the team, Mystique is asked to participate in politically sensitive operations as one of Xavier's secret agents, operatives who can't be traced back to Xavier in the event of their capture or death. Can this former mutant-rights terrorist, who can disguise herself as anyone on the planet, be trusted? Collecting MYSTIQUE #1-13.", "Wolverine (2010) #9": "Logan needs answers about the mysterious villains who sent him to hell, and he knows exactly where to go to get them: Mystique. But Mystique has troubles of her own, namely the unstoppable new assassin, Lord Deathstrike.", "X-Men: Earth's Mutant Heroes (2010) #1": "All things mutants take center stage in this all-new collection of Handbook-style profiles! Featuring X-Men members (Madison Jeffries/Box, Paulie Provenzano, Wraith/Hector Rendoza), trainees (Onyxx, Ink/Eric Gitter), allies (Fred Duncan, Tom Corsi, Candy Southern, Shortpack), the evil (Cortex, X-Cutioner, Amelia Voght, Zaladane, Black Womb) and the lesser-known (Litterbug, Jazz, Arize, Jack in the Box, Crule), and updates for the big guns (Professor X, Magneto, Emma Frost, Beast, Mystique). And because you demanded it: Joseph gets a profile at last! Plus: brand-new Gus Vazquez art for the majority of profiles!", "Age of X: Universe (2011) #2": "The Avengers have been ordered to find Magneto and his army of fugitive mutants. But when the team is given a license to kill, not every member is up to the task. Who will kill and who will be killed?", "Wolverine (2010) #6": "A mindless Wolverine is raging out control, a danger to everyone around him. Cyclops always feared this day would come, and he's ready and willing to do whatever it takes to end Wolverine's rampage once and for all.", "Age of X: Alpha (2010) #1": "Mutantkind's final war starts here. If you don't know which side you're on, check  your DNA.", "Wolverine (2010) #5": "WOLVERINE GOES TO HELL CONCLUSION There's a riot going on down below! As hell explodes around him, Logan confronts the last person in the world he ever thought he'd have to face again. Plus Sabretooth! And Ghost Riders!", "Wolverine (2010) #4": "WOLVERINE GOES TO HELL PART 4 Demonically-possessed Wolverine vs. Colossus!", "Daken: Dark Wolverine (2010) #3": "EMPIRE: ACT I, Part 3 (of 3) Daken has shown in the past that he's willing to do\r\nabsolutely anything to accomplish his goals, but DYING? That seems a bit extreme. However, impossible as it may seem, there are things in life that you can only accomplish after death. Just ask Wolverine' Parental Advisory '$2.99", "Wolverine (2010) #3": "WOLVERINE GOES TO HELL PART 3 Wolverine's body is running around on Earth, looking to slaughter everyone Logan has ever cared about. Who could possibly help sort all this out? Maybe a certain flaming-skulled biker and his buddy, the Son of Satan?", "Uncanny X-Men (1963) #529": "THE FIVE LIGHTS PART 4 If Light #4 registered in Kiev, Ukraine, then why the heck isn't he there? The X-Men race to find the latest of the new mutant activations while things come to a head between Emma Frost and her prisoner Sebastian Shaw!", "Wolverine (2010) #2": "WOLVERINE GOES TO HELL PART 2 It's Logan versus the legion of the damned, including some very familiar faces. And with Logan's demonically-possessed body still running amuck on earth, the body count can only grow.", "Wolverine (2010) #1": "WOLVERINE GOES TO HELL PART 1 Someone's out to destroy Wolverine-permanently-and they may have succeeded. But if Wolverine's soul is in hell, how is his body terrorizing those closest to him?", "Uncanny X-Men (1963) #527": "THE FIVE LIGHTS PART 2 Gabriel Cohuelo finds his life irrevocably changed one day when he begins moving at superhuman speed. Could he be a new mutant?", "X-Men Forever 2 (2010) #4": "Still reeling from the explosive events of Issue #1, the world is now contemplating what life without the X-Men will be like. Some mourn, others rejoice, and still others continue to search for answers. But answers can come from the unlikeliest places... including one of New York City's biggest super heroes. DON'T MISS A MOMENT OF THIS GROUNDBREAKING SERIES FROM X-MEN ICON CHRIS CLAREMONT! WITH ART BY ORIGINAL SERIES ARTIST TOM GRUMMETT! \r\nRated A ...$3.99", "Dark X-Men (2009) #3": "Nate Grey, a.k.a., X-Man is back and he is not happy with the state of affairs in the Marvel Universe.  So he goes straight to the man responsible-Norman Osborn-and it's not for a nice chat.  It's X-Man vs. the Dark Avengers and Dark X-Men.  Can this Omega class mutant survive this matchup?  Find out here!\r\nRated T  ...$3.99", "Mystic Comics 70th Anniversary Special (2009) #1 (MARTIN VARIANT)": "\"I am the destroyer of evil,\" the haunting stranger intoned; \"I've crossed the great cold into your world!\" So speaks the original Vision! From a dimension beyond, comes an otherworldly force of retribution. His steely touch turns killers to ice, shattering them. His staggering gaze drives the guilty mad with terror. His unstoppable power never fails to punish the wicked! It is said only those approaching death can see him in his true form as...the Vision!\r\nOne-Shot/New & Reprint/Rated A ...$3.99", "Uncanny X-Men (1963) #513": "UTOPIA PART 2 Norman Osborn stunned the super hero community when he assembled the Dark Avengers. Now, he has his very own Dark X-Men! Is there anything Osborn won't corrupt? Will the X-Men be able to bring him down? Find out here.", "Ms. Marvel Vol. 6: Ascension (Trade Paperback)": "Delve into the history of one of the Marvel Universe's greatest heroines! Carol Danvers has played many roles in her life: daughter, sister, Air Force intelligence agent and Avenger. Convinced she has not lived up to her potential, she is determined to become the best of the best. Though she has made great strides, Danvers knows she can be better. But before she can embrace her future as the world's greatest super hero, she must confront her past. Collecting MS. MARVEL #31-34, MS. MARVEL STORYTELLER and MS. MARVEL 2008 ANNUAL.\r\nRated T  ...$14.99\r\nISBN: 978-0-7851-3178-6", "X-Men Legacy (2008) #224": "SALVAGE PART 5 The future of Rogue and Gambit starts here in the conclusion of SALVAGE. Plus, Professor X versus Danger!", "X-Men Legacy (2008) #223": "SALVAGE PART 4 Professor X kept a sentient being in digital bondage and now that she is free of her shackles, Danger will take her revenge.", "X-Men Legacy (2008) #222": "SALVAGE PART 3 Rogue's past comes back to haunt not only her, but Professor X and Gambit as well!", "X-Men Legacy (2008) #221": "SALVAGE PART 2 The desert ghost-town that was once the X-Men's HQ has been reborn as a city of the damned with only one inhabitant: Rogue. Professor X and Gambit attempt to reach out to her...", "X-Men: The Complete Onslaught Epic Book 2 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got under way! Professor X hasn't been himself lately - moody, inscrutable - but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, X-Factor and X-Force, but also forgotten stars of the nineties like Phil Urich, the Green Goblin; Nate Grey, the X-Man; and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Punisher, S.H.I.E.L.D. and others! Collecting EXCALIBUR #100, WOLVERINE #104, X-FACTOR #125-126, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, PUNISHER #11, X-MAN #18 and X-FORCE #57.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2824-3\r<br>", "Wolverine (2003) #65": "GET MYSTIQUE PART 4 The quest for Mystique is over, and now the no-holds-barred face-off between her and Logan begins. Only one will walk away, but both will pay a price.", "Wolverine (2003) #64": "GET MYSTIQUE PART 3 Wolverine's mission has put him on the trail of the shapeshifter Mystique. In an effort to evade Logan, Mystique has chosen to hide among a group of American soldiers. Is Wolverine willing to cut them down to get to his prey?", "Wolverine (2003) #63": "GET MYSTIQUE PART 2 Wolverine's quest for vengeance continues, taking him from Afghanistan to the war-torn streets of Baghdad. With many innocent lives in the balance, can Wolverine justify the amount of collateral damage he may cause?", "Wolverine (2003) #62": "GET MYSTIQUE PART 1 In the wake of Messiah Complex, Wolverine is on a mission of vengeance! But who is the focus of his rage, and what dark secret does he share with them? And how far over the edge is Wolverine willing to go to get what he wants?", "X-Men: Messiah Complex (2007) #1": "MESSIAH COMPLEX PART 1 Just when it looked like there was no possibility of a future for mutants, hope arrives. But the X-Men aren't there to meet it-The Marauders and Purifiers beat them to it. Now the race is on to get the first new mutant since the mutants became an endangered species.", "X-Men (2004) #203": "As the Xavier Academy reels from Exodus's attack and the Marauders' true goals emerge, the X-Men finally find themselves in a position to take the offensive.  But only if Iceman and Cannonball deliberately walk into an ambush from which they may not emerge alive.", "X-Men: Supernovas (Hardcover)": "Mike Carey (Ultimate Fantastic Four) and Chris Bachalo (Uncanny X-Men) take over X-Men, or at least what's left of them! As old threats are still having their effects, new, more deadly threats emerge from the unlikeliest of places. Threats that spell doom for the X-Men. Plus: What could possibly strike terror into the heart of...Sabretooth?! And who are the Children of the Vault? This is the book you've been waiting for! A perfect starting point for any new reader! Collecting X-MEN #188-199 and ANNUAL #1.\r<br>328 PGS./Rated A ...$34.99 \r<br>", "X-Men (2004) #200 (Humberto Ramos Wraparound Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "X-Men (2004) #200": "The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history!", "X-Men (2004) #200 (David Finch Gatefold Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "X-Men Annual (2007) #1": "Rogue and her team have unfinished business on board the S.H.I.E.L.D. Helicarrier - business that concerns the twins, Northstar and Aurora, and a last-ditch attempt to restore them to their right minds.  But a powerful enemy from the X-Men's past has a different agenda - and his plans to hijack the Helicarrier for his own uses lead to a terrible revelation.\r<br>48 PGS./Rated T+ ...$3.99 \r<br>", "X-Men Fairy Tales (Trade Paperback)": "In the tradition of the X-Men classic, \"Kitty's Fairy Tale,\" comes a series of new legends, reimagining the greatest X-Men stories through folktales, myths and fables from across the globe. Collects X-MEN FAIRY TALES #1-4.\r<br>96 PGS./Rated A ...$10.99\r<br>", "X-Men: The Complete Age of Apocalypse Epic Book 4 (Trade Paperback)": "Learn who lives and who dies in either reality as the apocalyptic arc ends in treachery and tragedy! While certain heroic humans prove their mettle without armor or magic hammers, it's a race to see who the X-Men will destroy first: Apocalypse or themselves! But even with the crisis concluded, new allies and enemies emerge, guaranteeing that reality will still never be the same! Featuring the dawn of Gene Nation and a turning point for the Legacy Virus! Collects GENERATION NEXT #4, X-CALIBRE #4, X-MAN #4 and #53-54, FACTOR X #4, GAMBIT AND THE X-TERNALS #4, AMAZING X-MEN #4, WEAPON X #4, X-UNIVERSE #2, X-MEN: OMEGA, BLINK #4, and X-MEN: PRIME.\r<br>368 PGS./Rated T+ ...$29.99\r<br>", "X-Men (2004) #191": "The X-Men discover the truth behind their mysterious new enemies! It's time to take the fight to this new and dangerous threat...but are their enemies closer than the X-Men think?", "X-Men (2004) #190": "Northstar and Aurora are back! Awoken by a mysterious new threat, the twins have been let loose in the Xavier Mansion, leaving a path way of destruction and death. Their mission: Kill Sabretooth! Part 3 (of 6)!", "X-Men Fairy Tales (2006) #3": "Our storytellers turn their attention to the American South this month and tap the terrifying traditions of New Orleans in a retelling of the romance of Rogue and Gambit. When a voodoo priestess named Mystique meets a young girl who can speak with the spirits of the recently deceased, she tries to bend the girl's will and use her abilities for evil. They soon learn it's unwise to upset the ghosts and ghouls of the South, and it's up to a mysterious Cajun stranger to set things right!\r<br>32 PGS./Rated A ...$2.99\r<br>", "X-Men: Blood of Apocalypse (Trade Paperback)": "When his people need him the most, he shall return! Lord Apocalypse is here to lead mutantkind into the future of the earth and only the strongest can survive! And just wait until you see his new Horsemen! Even we were surprised! Plus: Cable sees the signs--omens and portents -- characters gathering, moving across the board like chess pieces...can Apocalypse be resurrected? Can Cable and Deadpool stop it in time? And most surprising of all... what if one of them doesn't want it to be stopped? Collects X-MEN #182-186 and CABLE/DEADPOOL #26-27.\r<br>216 PGS./Rated T+ ...$17.99\r<br>", "X-Men (2004) #187": "In the aftermath of \"Blood of Apocalypse\", the X-Men are left to pick up the pieces of the world that En Sabah Nur has shattered. Plus, the mystery of Apocalypse's fate deepens while one of his Horsemen makes a life-or-death decision.", "Decimation: X-Men the Day After (Trade Paperback)": "It was the worst day in X-Men history. Now it's the day after. The House of M is over, but the effects will be felt for the rest of their lives. How do the X-Men pick up the pieces in a world that has completely changed? Plus: Something's amiss at the House of Xavier! A sneak attack forces the X-Men to re-evaluate just who their friends are, and to align themselves with former enemies!\r<br>Collects DECIMATION: HOUSE OF M - THE DAY AFTER and X-MEN #177-181\r<br>168 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$17.99\r<br>", "X-Men (2004) #185": "Whew boy! Apocalypse has never hurt the X-Men like this before! The team is shattered, losing members to Apocalypse's grasp. Can they pull themselves up and stop Apocalypse before he kills 90% of the world's human population!?", "X-Men: Mutant Genesis (Trade Paperback)": "The best-selling storyline is back in print! The mutant terrorist Magneto again threatens the world, and only the X-Men can stop him! And should they survive this confrontation, the villainous Omega Red is waiting in the wings! Collects X-MEN #1-7.\r<br>176 PGS./ T+ SUGGESTED FOR TEENS AND UP ...$19.99\r<br>ISBN: 0-7851-2212-5\r<br>", "X-Men (2004) #184": "Apocalypse has returned and declared war on humanity. The X-Men are against the ropes, almost at their end. Then the unthinkable happens.  A new horseman joins his ranks; an all-too-familiar horseman that will leave the X-Men shattered forever!", "X-Men: The End - Men and X-Men (2006) #2": "The last days of the X-Men, revealed! What terrible threat hangs above Mutantkind's head? What dark secret will destroy them all?", "X-Men (2004) #181": "Finally, the mystery of what Polaris witnessed in the recesses of space is revealed. The answer is something so twisted, so mind-bending, so outrageous, you'll be beating yourself with a paddle for missing this issue.", "Marvel Visionaries: John Romita Jr. (Hardcover)": "Celebrating the artwork of John Romita Jr., a legend in his own right, on the anniversary of his first work on AMAZING SPIDER-MAN! Tony Stark battles alcoholism! Spider-Man battles the Juggernaut though the streets of New York! The dawn of a New Universe! Daredevil and Kingpin celebrate Christmas! The Punisher joins the Mafia! Also featuring the Hulk, Magneto, Professor X, a masterful retelling of Daredevil's origin, and more! Collects stories from AMAZING SPIDER-MAN #229-230, #36, ANNUAL #11; IRON MAN #128 and #256; UNCANNY X-MEN #183 and #309; STAR BRAND #1; DAREDEVIL #253; PUNISHER WAR ZONE #1; DAREDEVIL: MAN WITHOUT FEAR #1-2; and HULK #25 and #34.\r<br>\r<br>360 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Wolverine (2003) #35": "All the details you need to know about Wolverine's mysterious past and his place in the House of M can be found right here!  The simmering war between Logan, Agent of S.H.I.E.L.D., and the leader of the human resistance movement, Nick Fury, comes to a boil.  And only one of them's going to come out alive.", "Mystique Vol. 4: Quiet (Trade Paperback)": "This is it! The mysterious Quiet Man's identity is finally revealed! Mystique is sent on a mission to find Shortpack, who has mysteriously vanished. But she has enough on her mind already: She has to figure out how to assassinate Professor Charles Xavier! Mystique been caught between two masters long enough; now, the time has come when she can no longer serve both! Collects MYSTIQUE #19-24.\r<br>144 PGS./Marvel PSR ...$14.99\r<br>", "X-Men: The Complete Age of Apocalypse Epic Book 1 (Trade Paperback)": "It begins here! The critically acclaimed, fan-favorite storyline that rocked the X-Men Universe to its core is collected across four volumes! In a cracked-mirror world ruled by the genocidal mutant despot Apocalypse, only one hope remains: Magneto and his Astonishing X-Men! Collects X-MEN CHRONICLES #1 and #2, TALES FROM THE AGE OF APOCALYPSE: BY THE LIGHT, X-MAN #-1, X-MAN '96 ANNUAL, TALES FROM THE AGE OF APOCALYPSE: SINISTER BLOODLINES, and BLINK #1-4.\r\n360 PGS./Marvel PSR ...$29.99", "Mystique (2003) #24": "\"QUIET\" Conclusion! \r<br>The shocking series finale! Everything has been leading up to the explosive events of this issue! Big changes are in store for the shifty shapechanger. Miss this issue at your peril!\r<br>", "Mystique (2003) #23": "\"QUIET\"\r<br>Choosing to take on Professor Xavier may not have been a wise choice for Mystique...especially since the X-Men are now coming after her with all chambers loaded! \r<br>Part 4 (of 5).\r<br>", "Mystique (2003) #22": "\"QUIET\" PART 3 (OF 5)\r<br>Can Mystique really go through with her murderous mission? Her decision might just surprise ya!", "X-Men: Dream's End (Trade Paperback)": "The death of Colossus, reprinted here for the first time! For too long mutants were threatened by the twin specters of the Legacy Virus and anti-mutant politics. Now, the X-Men hope to end both threats, but at what cost to their oldest and dearest? Are there deaths from which even the X-Men can't return? Featuring Mystique, Cable and the last issue of Bishop's solo series!", "Mystique Vol. 3: Unnatural (Trade Paperback)": "When everyone's favorite shape-shifting secret agent is sent to Europe to investigate a biotech company rumored to be using mutants as guinea pigs, she discovers a mystery far greater than anything she'd imagined! As Mystique and Shortpack get closer to their objective, they must confront a new revelation: that someone is selling transient mutants as guinea pigs, slaves and worse! Will Mystique go after this mutant-selling scum, or will she allow her personal crisis to tear her apart first?", "Mystique (2003) #21": "\"QUIET\" PART 2 (OF 5)\r<br>Mystique is caught between two masters-one, mutant activist Charles Xavier; the other, the mysterious Quiet Man. Now, the time has come when she can no longer serve both!\r<br>", "Mystique (2003) #20": "\"QUIET\" PART 1 (OF 5) This is it! The Quiet Man's identity is finally revealed in this series-shifting, mind-bending first part of a new arc!  Mystique is sent on a mission to find Shortpack, who has mysteriously vanished. But Mystique has enough on her m", "Mystique Vol. 2: Tinker, Tailor, Mutant, Spy (Trade Paperback)": "Mystique is a shape-shifting mutant and former terrorist, recruited by Professor Xavier of the X-Men to be a secret agent. Her current mission: to find and destroy a deadly new strain of smallpox... one that's spread telepathically! Problem is, she's not the only mutant who wants to get her hands on this potentially apocalyptic bio-weapon!<br>\r\nPlus: Mystique's globe-trotting missions take her everywhere imaginable, but now she's going back to the last place she'd ever imagine... her romantic past. Her old flame Forge can fix almost anything, but can he fix their relationship?\r\nCollects MYSTIQUE #7-13.", "Mystique (2003) #19": "PART 1 (OF 1) When an assassin's bullet aims for Mystique, the shape-shifting mutant and her enigmatic employer, Shepard, hunt down the source. This issue serves as a jumping-on point and a bridge between last month's \"Unnatural\" arc and next month's stat", "Mystique (2003) #18": "\"UNNATURAL\" PART 5 (OF 5) The stunning conclusion to the new ReLoad team's first action-packed tale! Mystique and Shortpack's relationship continues to strain as they work to take down DermaFree and rescue the mutant guinea pigs from execution! Shortpack comes to a decision about his future with Xavier, and Mystique is faced with a mind-numbing choice.", "Mystique (2003) #17": "\"UNNATURAL\" PART 4 (OF 5) It's Shortpack to the rescue in Prague when Mystique is presumed amnesiac or dead at the hands of Viktor, an unscrupulous mutant who sells other mutants on the black market!", "Mystique (2003) #16": "\"UNNATURAL\" PART 3 (OF 5) As Mystique and Shortpack get closer to their objective, they must confront a new revelation: that someone is selling transient mutants as guinea pigs, slaves and worse! Will Mystique go after this mutant-selling scum, or will she allow her personal crisis to tear her apart first?", "Mystique (2003) #15": "\"UNNATURAL\" PART 2 (OF 5) When Mystique is sent to Europe to investigate a biotech company rumored to be using mutants as guinea pigs, she discovers a mystery far greater than anything she'd imagined! Join the new X-MEN: RELOAD creative team of SEAN McKEEVER (SENTINEL, The Waiting Place) and returning artist MANUEL GARCIA (AVENGERS) for this bold new adventure featuring everyone's favorite shape-shifting secret agent!", "Mystique (2003) #14": "\"UNNATURAL\" PART 1 (OF 5) When Mystique is sent to Europe to investigate a biotech company rumored to be using mutants as guinea pigs, she discovers a mystery far greater than anything she'd imagined! Join the new X-MEN: RELOAD creative team of SEAN McKEEVER (SENTINEL, The Waiting Place) and returning artist MANUEL GARCIA (AVENGERS) for this bold new adventure featuring everyone's favorite shape-shifting secret agent!", "Mystique (2003) #13": "Shape-shifting super-spy Mystique has a secret, and so does her tiny field handler, Shortpack. Will these two mutants be able to protect the skeletons in their closets AND help each other survive a death-defying mission?\r\n32 PGS./MARVEL PSR...$2.99", "Mystique (2003) #12": "Mystique's globetrotting missions take her everywhere imaginable, but now she's going back to the last place she'd ever imagine ... her romantic past. Her old flame Forge can fix almost anything, but can he fix their relationship?", "Mystique (2003) #11": "\"MAKER'S MARK\" pt. 1 (of 2)\rMystique's a shape-shifting super-spy that can change literally change her skin. Forge is the mutant inventor who's gotten under her skin. Learn more about their past and present relationship as and find out how the Maker left his mark!!!\r32 PGS./MARVEL PSR...$2.99", "Mystique (2003) #10": "\"TINKER, TAILOR, MUTANT, SPY\" Concludes!\r\nMystique must save humanity from a deadly, mutated form of smallpox... but will she have to sacrifice the life of her loyal field handler, Shortpack, for the greater good?\r\n32 PGS./MARVEL PSR...$2.99", "Mystique (2003) #9": "\"TINKER, TAILOR, MUTANT, SPY\" pt. 3 (of 4)\r\nMystique is on the trail of a woman who is a walking plague... and who has stolen a deadly biological weapon!\r\n32 PGS./MARVEL PSR...$2.99", "Mystique (2003) #8": "\"TINKER, TAILOR, MUTANT, SPY\" pt. 2 (of 4)\r\nMystique continues her mission to find and destroy a deadly new strain of smallpox ... but she's not the only mutant who wants to get her hands on this potentially apocalyptic bio-weapon!\r\n[This is a resolicitation, all previous orders are cancelled].\r\n32 PGS./MARVEL PSR...$2.99", "Mystique (2003) #7": "Mystique's new assignment from Xavier is to track down a possible new biological weapon: mutant anthrax that spreads telepathically. But Mystique is getting restless following Xavier's orders... and he might not be the only boss she's working for these days...\r\n32 PGS. MARVEL PSR...$2.99", "Uncanny X-Men (1963) #428": "(Rated T+) First appearance of Azazel. Recounts the first meeting between Mystique and Azazel.", "X-Treme X-Men (2001) #1": "The X-Men in an new X-Treme era! Storm, Bishop, Beast, Psylocke, and Thunderbird have been captured-will Sage be able to rescue them?", "Uncanny X-Men (1963) #389": "History of the relationship between Professor X and Moira MacTaggert", "Gambit (1999) #21": "Now that the Thieves and the Assassins Guilds have been unified, Gambit digs into his past to find out more about his future, but does he even have a past? Then, sparks fly in the Pentagon as Remy LeBeau travels to Washington, DC, and runs into the sexy and sinister shape-changer known as Mystique!", "Wolverine/Deadpool: Weapon X (Trade Paperback)": "When Wolverine rebuffs the reconstituted Weapon X program, management is forced to settle for second best' but Deadpool's first assignment may test the limits of his loyalty.", "X-Men (1991) #80": "Joe Kelly celebrates the 35th Anniversary of the X-Men! Witness the formation of an all-new mutant team. Plus, the mystery behind the ‘evil X-Men’ reaches a head.", "X-Factor (1986) #130": "Graydon Creed’s violent rhetoric leads to his assassination!", "X-Factor (1986) #126": "X-Factor avoids the Dark Beast's deceptions and rescues the real Beast. Havok and Random square off against Polaris, but the winner soon hits Polaris below the belt.", "X-Men: Prime (1995) #1": "The Age of Apocalypse has ended...but what new threats await the X-Men, X-Factor, X-Force and all mutants?  Plus, what Age of Apocalypse heroes and villains have crossed over to our reality?", "X-Men Chronicles (1995) #1": "Age of Apocalypse! See the X-Men like you've never seen them before. Magneto has assembled a roster of brave mutants to usher in an age of peaceful coexistence between humanity and mutantkind. But there are those who wish to see humanity enslaved! Enter Apocalypse!", "X-Factor (1986) #109": "In Israel, Mystique lines up her sights on a new target. Only X-Factor can stop her now.", "X-Men Unlimited (1993) #7": "The X-Men go their separate directions and split up! But why?", "X-Factor (1986) #108": "Until recently, Mystique was presumed dead. But Forge has picked up the shapeshifter's trail and along with his teammates, he follows it to Israel to uncover the truth.", "X-Men Unlimited (1993) #4": "Mystique assassinates General Armond Gaudier!", "X-Men (1991) #1": "It's the X-Men vs. Magneto, Master of Magnetism!  The X-Men's oldest enemy is back and it's going to take everyone in the X-Men have to bring him down. A Marvel classic from Chris Claremont and Jim Lee!", "X-Factor Annual (1986) #6": "THE KINGS OF PAIN PART 4 Proteus, the son of Moira MacTaggert, loses control over his psychic powers. Deeply disillusioned, and putting both mutant and human in harm’s way, will X-Factor do whatever it takes to end Proteus’ reign of terror? Guest-starring Cable and his New Mutants!", "X-Factor (1986) #10": "The team must contend with a mutant massacre in the Morlock Tunnels."}