{"X-Men: First Class (2019) #3": "Professor Xavier's star students finally get the Spring Break they deserve in Florida! But a visit to an old colleague of the Professor's turns into a battle for survival in the Everglades for Beast and Angel when they hunt THE LIZARD!", "X-Men: First Class (2019) #1": "Meet the first ever X-Men! Five young people pave the way for a new kind of human while students at the Xavier School for Gifted Youngsters! Introducing Cyclops, Marvel Girl, Angel, Beast and Iceman!", "Astonishing X-Men (2017) #12": "THE FINAL SHOWDOWN FOR…A MAN CALLED X! It’s XAVIER and PSYLOCKE versus PROTEUS! In a battle for reality itself, which of these super-powered psychics will win? And when the dust settles, what’s next for the Astonishing X-men?", "Astonishing X-Men (2017) #9": "NUKE-CLEAR WAR Part 3! As a reality storm batters London and its inhabitants, PSYLOCKE must choose between trusting the mysterious MAN CALLED X and letting her beloved city fall into ruin. The SHADOW KING freed a brand-new threat with his dying throes, but who is this new threat? And how can the X-Men hope to stand against an emery that can warp reality itself?", "Astonishing X-Men by Charles Soule Vol. 1: Life of X (Trade Paperback)": "Collects Astonishing X-Men (2017) #1-6. Charles Soule and a stellar roster of superstar artists unite to put the Astonishing back in the X-Men! An ancient evil is attacking the world's most powerful minds. It will have them by the time you finish this sentence, and a moment later, it will have us all. A band of X-Men discovers the truth behind the threat, but is there any time left for Psylocke, Old Man Logan, Bishop, Archangel, Fantomex, Rogue and Gambit? In an action-packed X-epic, they must head to the astral plane in pursuit of...the Shadow King! But in this brain-bending mindscape, not everything is as it seems, and reality is a relative concept. Will this impromptu squad of X-Men be able to contain the chaos from spilling out into the world?", "X-Men: Legion - Shadow King Rising (Trade Paperback)": "Collects New Mutants (1983) #26-28, 44; Uncanny X-Men (1981) #253-255, 278-280; X-Factor (1986) #69-70. David Haller is no ordinary mutant. Son of Charles Xavier, founder of the X-Men, David’s incredible mental powers fractured his mind — and now, each of his personalities controls a different ability! And they’re not all friendly, as Xavier and the New Mutants find out the hard way! But as Legion struggles to control the chaos in his head, he attracts the attention of one of Xavier’s oldest and most malevolent foes: Amahl Farouk, the Shadow King, who’s secretly been stalking and manipulating the X-Men and their allies. When the Shadow King sinks his hooks deep into David’s mind, will two teams of X-Men be enough to defeat him — or will David be the key to the villain’s ultimate victory?", "X-Men: Grand Design (2017) #2": "Revisit all of X-Men history with Eisner-winning writer/artist Ed Piskor!!! Relive the biggest moments in X-Men history: The flight of the Sentinels! The discovery of the Savage Land!! The death of Charles Xavier!!! For the X-Fan inside everyone!", "Astonishing X-Men (2017) #7": "A MAN CALLED X Part 1. CHARLES XAVIER has a plan. He’s going to save the world...whether you want it or not. Act II of the ASTONISHING X-MEN saga begins here, as a long-lost mutant returns to the world of the X-Men, Fantomex offers a kiss and Bishop discovers the Mindkiller.", "True Believers: Phoenix Origins (2017) #1": "Learn the history of Marvel Girl, Jean Grey! Reprinting X-MEN ORIGINS: JEAN GREY #1.", "X-Men: Grand Design (2017) #1": "From Eisner award-winning creator Ed Piskor (Hip-Hop Family Tree) comes a thrilling new series chronicling all of X-Men history! X-MEN: GRAND DESIGN stitches together the most important moments in mutant history, creating a comprehensive narrative celebrating the X-Men’s past, present, and future. The first in a trilogy, GRAND DESIGN returns to Charles Xavier’s assembly of Cyclops, Marvel Girl, Iceman, Angel, and Beast! A must for fans looking to brush up on their X-Men lore or as jumping-on point for Marvel’s merry mutants.", "X-Men Classic (Hardcover)": "Collects: Backup stories and new pages from Classic X-Men #1-44; material from Marvel Fanfare (1982) #60. In 1986, Marvel launched Classic X-Men, a series that reprinted the \"All-New, All-Different X-Men\" era -with a twist! All-new backup stories fleshed out the 1970s tales and delved deeper into the characters' lives, and new story pages were even inserted into the reprints, expanding on key moments and sowing the seeds for future storylines! Now, all this newly created material is collected in one volume for the first time - complete with comparisons and text articles explaining what was changed, what was added, and why! It's the perfect companion piece to your Uncanny X-Men collection! Friendships are forged, allies are mourned and lives are transformed in these rare tales that dance between the raindrops of some of the most revered comics of all time!", "Astonishing X-Men (2017) #6": "LIFE OF X CONCLUSION! We are trapped in the SHADOW KING’s web. All strands have led here. We have seen sacrifice, battle, manipulation, lies and the darkest truths. Now, at last, CHARLES XAVIER and his X-Men will save one world and lose another.", "Astonishing X-Men (2017) #4": "A MONSTER IS LOOSE IN LONDON. HIS NAME IS LOGAN. Psylocke, Bishop and Angel are all that stand between a mind-poisoned Logan and a mountain of corpses. Rogue and Gambit consider their options. Fantomex and Mystique get the party started. And somewhere, the Shadow King laughs and laughs…", "X-Men Epic Collection: Second Genesis (Trade Paperback)": "With the original X-Men captured, Professor X recruits an all-new, all-different team to take on the mantle of the Uncanny X-Men! Including Wolverine, Storm, Colossus, Nightcrawler, Banshee, Sunfire and Thunderbird, this new international cast redefined super-hero teams forever. The transition from old team to new won't come easy, though: WOLVERINE VS. THE PUNISHER and Cyclops clash! X-Man battles X-Man! Death and rebirth visit the team! And an old nemesis returns! Plus: the first hints of Alpha Flight and the Weapon X program, the team's first outer-space saga with the Starjammers, and rare early X-Men adventures! With comic-book titans Chris Claremont, Dave Cockrum and John Byrne at the helm, the X-Men's rise to the peak of popularity starts here! Collects Giant-Size X-Men (1975) #1, Uncanny X-Men (1963) #94-110, Marvel Team-Up (1972) #53, 69-70, Annual (1976) #1, Iron Fist (1975) #14-15 and material from FOOM (1973) #10.", "New Avengers (2010) #29": "AVX Tie-in! They gather to stop the horrors of the Marvel universe before they happen...but the secret group known as the Illuminati failed to stop the Phoenix time and time again. They come together one last time...but will it be enough?", "X-Men: Season One (2011) #1": "Welcome to the X-Men&rsquo;s first year - hope you survive the experience! Professor Charles Xavier has recruited five of the most powerful mutants he&rsquo;s ever seen, in order to save a world that hates and fears them. But there&rsquo;s only one problem - they&rsquo;re teenagers who have to survive hormones and uncontrollable super-powers, all while fighting for their very lives. So right now&rsquo;s the perfect time for Magneto & the Brotherhood of Evil Mutants, along with the Sentinels, Unus the Untouchable and more to make their bids for control of the world, right? The first class of X-Men are forged in the fires of combat in ways you&rsquo;ve never seen before. You only think you know the story!", "X-Men Legacy (2008) #253": "One of the monsters from Legion's psyche is determined to retain his freedom. His power? Sucking the life out of his victims. With a foe like this, Rogue may find her team a member or two short by the end!", "Marvel Masterworks: The X-Men Vol. 3 TPB (Trade Paperback)": "Join the original X-Men - Cyclops, Marvel Girl, Beast, Angel and Iceman - in these early adventures from the days when Marvel's Merry Mutants were more the quirkiest quintet in comics than the worldwide wunderkinds they are today. Across ten issues, you'll see the X-Men confronted by a host of villains weird and varied - from Count Nefaria and his horde of henchmen to the Locust and the Aztec-inspired Kukulcán. You'll also witness the first appearance of X-Men mainstay Banshee and read the rare stories when a sixth mutant member, the Mimic, joined Professor X's squad. Also featured are the beginnings of the long-ranging Factor Three saga, and the classic battle between Mimic and the Super-Adaptoid - and all are painstakingly restored to offer the best presentation of these Marvel classics! Collecting X-MEN (1963) #22-31", "X-Men Legacy (2008) #252": "Not only have the X-Men escaped from the Age of X, but so have the most dangerous monsters from Legion's psyche! Desperate to find them, Legion and a team of X-Men leave the safety of Utopia, but it won't be long before they are in over their heads.", "Marvel Masterworks: The X-Men Vol. 3 DM Variant TPB (Trade Paperback)": "Join the original X-Men - Cyclops, Marvel Girl, Beast, Angel and Iceman - in these early adventures from the days when Marvel's Merry Mutants were more the quirkiest quintet in comics than the worldwide wunderkinds they are today. Across ten issues, you'll see the X-Men confronted by a host of villains weird and varied - from Count Nefaria and his horde of henchmen to the Locust and the Aztec-inspired Kukulcán. You'll also witness the first appearance of X-Men mainstay Banshee and read the rare stories when a sixth mutant member, the Mimic, joined Professor X's squad. Also featured are the beginnings of the long-ranging Factor Three saga, and the classic battle between Mimic and the Super-Adaptoid - and all are painstakingly restored to offer the best presentation of these Marvel classics! Collecting X-MEN (1963) #22-31", "Mystique by Sean Mckeever Ultimate Collection (Trade Paperback)": "When everyone's favorite shape-shifting secret agent - now in the employ of Professor X - is sent to Europe to investigate a biotech company rumored to be using mutants as guinea pigs, she discovers a mystery far greater than anything she'd imagined! As Mystique and Shortpack get closer to their objective, they must confront a new revelation: Someone is selling transient mutants as guinea pigs, slaves and worse! Then, Mystique sets out to find Shortpack, who's mysteriously vanished. But she's got enough on her mind already: She has to figure out how to assassinate Professor Charles Xavier! Collecting MYSTIQUE #14-24.", "X-Men: Prelude to Schism (2011) #3": "The mini-series that leads to the X-Event of 2011 continues! This month we get inside the heads of the two most important X-Men: Cyclops and Wolverine. See parts of their past you never saw before, experience the most intense moments in X-History and understand what leads to the Schism that is coming!", "New X-Men Vol. 2: Germ-Free Generation GN-TPB (Graphic Novel)": "Enter the U-Men! When envious humans begin dissecting mutants and grafting their body parts, it's up to the X-Men to stop them! But things at home aren't much better as Cyclops and Jean Grey can't stop fighting, Jean's powers flare out of control, and Professor X's mind is trapped in the body of his comatose evil twin! Introducing the new Angel - and the X-Men have never seen anything like her! Collecting NEW X-MEN #118-121.", "X-Men Legacy (2008) #250": "The X-Men have escaped the Age of X and returned to Utopia, but something sinister followed them back. Upon discovering that this new evil has been set loose, Rogue and Magneto round up a team to hunt it down.", "X-Men: Earth's Mutant Heroes (2010) #1": "All things mutants take center stage in this all-new collection of Handbook-style profiles! Featuring X-Men members (Madison Jeffries/Box, Paulie Provenzano, Wraith/Hector Rendoza), trainees (Onyxx, Ink/Eric Gitter), allies (Fred Duncan, Tom Corsi, Candy Southern, Shortpack), the evil (Cortex, X-Cutioner, Amelia Voght, Zaladane, Black Womb) and the lesser-known (Litterbug, Jazz, Arize, Jack in the Box, Crule), and updates for the big guns (Professor X, Magneto, Emma Frost, Beast, Mystique). And because you demanded it: Joseph gets a profile at last! Plus: brand-new Gus Vazquez art for the majority of profiles!", "Mystique by Brian K. Vaughan Ultimate Collection (Trade Paperback)": "Born with the ability to look and sound like anyone, the shapeshifting Mystique is a former pro-mutant terrorist wanted by nearly every government in the world for alleged crimes against humanity. She's used her morphing powers to stand against the X-Men in their battle for mutant-human coexistence for years - but in this increasingly complicated world, Mystique begins to find the battle lines are no longer so clear. In exchange for protection from her countless enemies, Mystique reluctantly agrees to go to work for Professor Charles Xavier, telepathic leader of the X-Men. But instead of being invited to join the team, Mystique is asked to participate in politically sensitive operations as one of Xavier's secret agents, operatives who can't be traced back to Xavier in the event of their capture or death. Can this former mutant-rights terrorist, who can disguise herself as anyone on the planet, be trusted? Collecting MYSTIQUE #1-13.", "X-Men Giant-Size (2011) #1": "FROM FIRST TO LAST The truth behind the origins of the Evolutionaries is finally unlocked from the darkest recesses of Cyclops' mind! Discover an old crisis so horrible that Cyclops will wish the past stayed buried!", "X-Men: Prelude to Age of Apocalypse (Trade Paperback)": "The critically acclaimed, fan-favorite storyline that rocked the X-Men Universe to its core starts here! Legion, the supremely powerful son of Charles Xavier, wants to change the world - and he's traveled back in time to kill Magneto to do it! Can the X-Men stop him, or will the world as we know it cease to exist? Featuring the last day of Cable's life; Gambit vs. Sabretooth; the beginning of Archangel and Psylocke's relationship; and Mystique, bent on revenge! Witness the final moments in the lives of the X-Men before their world changes forever! Collecting X-FACTOR #108-109, UNCANNY X-MEN #319-321, X-MEN #38-41, CABLE #20 and X-MEN: AGE OF APOCALYPSE ASHCAN EDITION.", "X-Men (2010) #11": "Jubilee has been turned by the dark forces of the undead. And though the battle with the vampires is over, Jubilee's own battle has just begun.", "X-Men Legacy (2008) #248": "After surviving the AGE OF X, Rogue and Magneto recognize that they've been through a lot together, and have grown closer. When Rogue forces Magneto to confront the horrors of his past, their relationship may just reach a breaking point.", "X-Men Legacy (2008) #246 (2nd Printing Variant)": "\"AGE OF X\" CHAPTER THREE! Rogue has stumbled upon the secret hidden deep within the bowels of Fortress X. And now she's public enemy number one. A fugitive amongst her own kind, Rogue goes on the run...but when your entire world is surrounded by an unbreakable forcefield wall, there's not far to go. Especially when a team of mutantkind's most ruthless killers is hot on your trail!", "X-Men: Prelude to Schism (2011) #1": "Before Messiah Complex came Endangered Species. This is the prelude to the X-Men Event of 2011. What does it mean to be a leader? What does it do to a person? What do the choices you make mean about the person you are? This mini-series delves into these issues and will give an X-Men reader what they need to know about their favorite mutants before everything changes in July.", "X-Men: First Class Magazine (2011) #1": "For millions of years, mankind's place on Earth was unchallenged - until five young people paved the way for a new kind of human! Join the first team of X-Men - Cyclops, Marvel Girl, Angel, Beast and Iceman -in the untold, all-ages adventures from their time as students at Professor X's School for Gifted Youngsters. Relive X-Men stories from the team's?heroic past - including their first appearance by comics legends Stan Lee and Jack Kirby - and get an exclusive, behind-the-scenes look at the creation of the X-MEN: FIRST CLASS comics! Collecting X-MEN FIRST CLASS #1 and #5, and X-MEN #1 - plus all-new interviews and feature articles!", "New Mutants (2009) #24": "\"AGE OF X\" CONCLUSION! This is it. As the psychic barricades protecting Fortress X crumble and the human militias flock to exterminate all the mutants within, mutantkind makes its last stand...against the anti-mutant forces who would see them wiped out, but also against the one responsible for their plight in the first place. And when the dust settles? No one will be left unscathed.", "X-Men Legacy (2008) #247 (THOR HOLLYWOOD VARIANT)": "\"AGE OF X\" CHAPTER 5! In the Age Of X, there are no X-Men. There are no heroes to stand in the way of the anti-mutant aggression that has run rampant for years. And when the world's most dangerous mutant is set loose in this Age, everything will come crashing down.", "X-Men Legacy (2008) #245 (2nd Printing Variant)": "AGE OF X PART ONE\nIn a world where the X-Men never existed and mutantkind has been hunted to extinction, the few remaining mutants band together to make their last stand. Who are they? And just how far will they go to survive? The Age of X starts here!", "X-Men Legacy (2008) #247": "\"AGE OF X\" CHAPTER 5! In the Age Of X, there are no X-Men. There are no heroes to stand in the way of the anti-mutant aggression that has run rampant for years. And when the world's most dangerous mutant is set loose in this Age, everything will come crashing down.", "X-Men Origins II (Hardcover)": "The X-Men's secrets revealed! Experience the origin of the X-Men's leader as you follow Cyclops from his childhood through his joining of the X-Men. Relive Nightcrawler's early days as a trapeze artist in Germany, the first time he teleported and the events that made him the hero he is today! See the small-town beginnings that helped forge Iceman, the coolest mutant of them all! Witness Emma Frost's rise from a mousy girl from a wealthy New England family to the rich and terrifying queen of a secret society to the leader of the X-Men! Plus: DEADPOOL: THE MAJOR MOTION PICTURE! You may have heard there's a Deadpool movie in the works. Wade Wilson's heard the same thing, and he's determined to tell his own story before Hollywood screws it up! Collecting X-MEN ORIGINS: CYCLOPS, NIGHTCRAWLER, ICEMAN, EMMA FROST and DEADPOOL - plus bonus material from GIANT-SIZE X-MEN #1 and X-MEN #131.", "Marvel Girl (2010) #1": "When Jean Grey's best friend was tragically killed in a car accident, her strange psychic powers appeared. Only with the aid of PROFESSOR CHARLES XAVIER was she able to control her mutant abilities.  Now, alongside four other gifted youngsters, she must learn to master her powers...before they destroy her!", "Iron Man Legacy (2010) #11": "THE ILLUMINATI versus THE PRIDE as \"INDUSTRIAL REVOLUTION\" reaches its senses-shattering conclusion!...\n'NUFF SAID!", "X-Men Forever Giant-Size (2010) #1": "Join two comic legends as they deliver an explosive confrontation between the X-MEN and the SHI'AR! Chris Claremont and Mike Grell pit the mighty Imperial Guard against Xavier's X-Men in an all-out battle! As the fighting rages on, questions mount-why have the Imperial Guard attacked? And what do they want from Xavier? Don't miss this explosive issue that will turn the X-MEN FOREVER UNIVERSE UPSIDE-DOWN! Plus, a reprint of X-Men #108!\r\nRated A ...$3.99", "X-Men Forever Annual (2010) #1": "One of the most explosive revelations of this series' was the clandestine affair between Logan and Jean Grey. Now, go deeper into the intimate history of the love between Jean and Logan-and gain insight into the betrayed heart of Cyclops!", "X-Men Noir: Mark of Cain (2009) #4": "The notorious cat burglar Katherine Pryde was already legendary for slipping in and out the most tightly guarded buildings as if walking through walls. But duping the HQ of the Office of National Emergency would be a challenge even for her talents...", "X-Men Noir: Mark of Cain (2009) #3": "Herr Wagner started out in the circus. Comrade Rasputin's an expert forger of artworks and official documents. And Ororo's skills at thievery are renowned. These are the X-Men like you've never seen them before.", "X-Men Forever (2009) #9": "The thrilling conclusion to the X-Men's South American adventure! The X-Men take on this newest threat while still reeling from new stunning revelations! Plus: The funeral of Wolverine.", "X-Men Forever (2009) #8": "As the X-Men investigate unusual events in the South American jungle, Nick Fury recalls a mission from his past, when he served with an old friend, a Canadian soldier named Logan.", "Astonishing X-Men by Joss Whedon & John Cassaday (Hardcover)": "Now in one titanic tome: the entire chart-topping run of super-team Joss Whedon and John Cassaday! Winner of multiple prestigious Eisner Awards, Whedon and Cassaday's ASTONISHING X-MEN was a smash hit with critics and fans alike from the very first issue - winning praise from dozens of top media outlets including Entertainment Weekly, Publishers Weekly, TV Guide and New York Magazine, as well as racking up nearly every major comic-book industry award. Buffy the Vampire Slayer creator Whedon and Cassaday (CAPTAIN AMERICA, Planetary) assembled a tight cast - Cyclops, the Beast, Wolverine and Emma Frost, joined by returning fan-favorite Kitty Pryde - and set forth a groundbreaking pace, from the opening pages of a Sentinel attack to the unexpected return of a beloved X-Man. Then, building on early momentum, they ratcheted up the danger and drama with a shocking second year, creating a must-read book that can truly be called \"astonishing!\" Packed with more than 40 pages of extras - including creator interviews, script pages, character designs and variant covers. Collecting ASTONISHING X-MEN #1-24 and GIANT-SIZE ASTONISHING X-MEN #1.\r\nRated T  ...$75.00\r\nISBN: 978-0-7851-3801-3", "X-Men Forever (2009) #7": "The X-Men embark on a whole new adventure in South America! Kitty, Jean Gray, Beast, Nightcrawler and Rogue join Nick Fury on an investigation into mysterious occurrences deep in the jungle.", "X-Men Forever (2009) #6": "The X-Men search for the team's infiltrator! Somehow, this is linked to the death of Wolverine, and an organization known as The Consortium. Meanwhile, something big has surfaced in South America-an enemy the battered X-Men will have to face head-on!", "X-Men Forever (2009) #5": "The team continues to track down someone they used to think was a teammate, but has now turned out to be an imposter! Somehow, this is all linked to the death of Wolverine, and a big, shadowy organization known only as \"The Consortium.\"", "Uncanny X-Men (1963) #514": "UTOPIA PART 4 Norman Osborn's victory in San Francisco is cemented when the Dark X-Men succeed where the X-Men could not. All the while the Dark Avengers are forced to watch from the sidelines. But how long will Bullseye and Ares sit idle?", "X-Men Forever (2009) #2": "With Nick Fury-and the entire world-watching over the X-Men's shoulders, the stakes have never been higher for Cyclops, Jean Grey, Wolverine, Nightcrawler, Gambit, Rogue, Kitty Pryde, Storm, Beast, and Professor X.", "Astonishing X-Men (2004) #30": "GHOST BOX PART 6 Some boxes are best left unopened. The startling conclusion to GHOST BOX is here! The mysteries of the Ghost Box tech, the triploids, and Forge's treachery are solved! And the final showdown begins...", "X-Men Forever Alpha (2009) #1": "X-Men Forever marks Chris Claremont's exciting return to a story he left unfinished over 15 years ago. Now, X-Men Forever Alpha #1 gets you caught up on all the best-selling action leading into Forever #1 with this special reprint of X-Men #1-3. The Master of Magnetism embarks on a holy crusade to rescue his fellow mutants from the coming genetic conflagration with humanity...regardless of the cost to either side. All that stands in the way of absolute chaos are the mutant heroes known as the X-Men, whose powers and abilities set them apart from a humanity that hates and fears them.\r<br>One-Shot/Reprint/Rated T+ ...$4.99\r<br>", "X-Men Legacy (2008) #223": "\"Salvage\"\r<br>It's the moment of truth for Danger and Professor Xavier as the seeds planted in ASTONISHING X-MEN finally bloom.  Prof. X kept a sentient being almost as a slave and now that she is free of her bonds, Danger will take her revenge.  And this time, the X-Men aren't there to help him.  It's the beginning of the end of Professor Xavier's part of X-MEN LEGACY! Part 4 (of 5)\r<br>Rated A ...$2.99\r<br>", "X-Men Legacy (2008) #220": "SALVAGE PART 1 While Xavier seeks out Rogue, who is searching for him? Hunter becomes hunted and friend becomes foe!", "X-Men: The Complete Onslaught Epic Book 4 (Trade Paperback)": "The final onslaught is ON! Mutantdom's mightiest telepaths are forced to turn on one of their own, because Professor X's evil side won't stand for any more repression! The world's greatest hero teams gird for battle against one of their deadliest enemies, and when the smoke clears, not only will some of them not still be standing, they won't be there at all! The X-Men are left to take the blame for over a dozen dynamic disappearances, leading the man called Bastion to lay the groundwork for their NEXT crisis! But even if Onslaught is purged from this world, can a reborn world say the same? Guest appearances galore, plus step-by-step details on where the turning point of the 1990s began and ended! Collecting FANTASTIC FOUR #416, X-MEN #56, ONSLAUGHT: MARVEL UNIVERSE, CABLE #36, UNCANNY X-MEN #337, X-MEN #57, ONSLAUGHT: EPILOGUE, IRON MAN #6 & X-MEN: ROAD TO ONSLAUGHT.\r<br>Rated T+ ...$29.99\r<br>", "X-Men Legacy (2008) #218": "ORIGINAL SIN PART 4 Wolverine and Professor X face off against an unholy alliance of enemies old and new. But the greatest danger arises as Xavier delves into Daken's scarred and traumatized mind.", "X-Men Legacy (2008) #217": "ORIGINAL SIN PART 2 Professor X is forced to revisit the biggest challenge and the biggest failure of his career: Logan.", "X-Men Vs. Apocalypse Vol. 2: Ages of Apocalypse (Trade Paperback)": "The Shi'Ar on the Moon, Cable and his wife in Egypt, Wolverine in the Negative Zone - what's wrong with this picture? Apocalypse has risen from the past to change timelines until he finds one he likes - but when the original X-Man looks him in the eye, both men are lost, leaving the X-Men to comb the world for friend and enemy alike! Will Cyclops literally become the thing he fears and hates the most, and vice versa? And where does the Red Skull fit into all of this? Anywhere he wants to! Guest-starring the Hulk, Machine Man, Deathlok and more! Collecting X-51 #8, UNCANNY X-MEN #378 and ANNUAL 1999, CABLE #77, WOLVERINE #148,\r<br>X-MEN UNLIMITED #26, X-MEN #98 and X-MEN: THE SEARCH OF CYCLOPS #1-4.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2264-7\r<br>", "X-Men: The Complete Onslaught Epic Book 3 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got underway! Professor X hasn't been himself lately - moody, inscrutable, but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, the Fantastic Four, the Avengers, but forgotten stars of the nineties like Green Goblin Phil Urich, Nate Grey the X-Man and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Hulk, the Pantheon, the Punisher, S.H.I.E.L.D. and others! Collecting HULK #445, IRON MAN #332, AVENGERS #402, PUNISHER #11, X-MAN #19, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, FANTASTIC FOUR #416 and WOLVERINE #105.\r<br>Rated T+ ...$29.99\r<br>", "Astonishing X-Men (2004) #26": "GHOST BOX PART 2 It is on a spaceship hovering 300 hundred feet above the twisted wreckage of Chaparanga Beach that the X-Men find its sole inhabitant: the mysterious Subject X. Who is this mysterious man and what does he want from the X-Men?", "Astonishing X-Men (2004) #25": "GHOST BOX PART 1 The X-Men are back to business -- with a new look, a new base of operations, and a mystery to solve that will take them into previously uncharted territory and test them to their core!", "Astonishing X-Men Vol. 4: Unstoppable (Trade Paperback)": "Strap yourselves in, folks! It's Joss Whedon and John Cassaday's final arc on Astonishing X-Men! After the shocking and brain-smashing events of recent issues, the X-Men are off to protect the Earth from its destruction at the hands of the Breakworld. And when it's all over, nothing will ever be the same! No, really, we mean it! Whedon and Cassaday prove they are more than Astonishing: They are unstoppable! Collecting ASTONISHING X-MEN #19-24 and GIANT-SIZE ASTONISHING X-MEN #1.\r\nRated T  ...$19.99 \r\nISBN: 978-0-7851-2254-8", "X-Factor Visionaries: Peter David Vol. 4 (Trade Paperback)": "X-Factor's part in the X-Cutioner's Song Saga sets them against X-Force while the life of mutual mentor Professor X hangs in the balance! The mutant teams finally rally to the same side, only to be outnumbered by three times the scheming as Apocalypse, Stryfe and Mister Sinister vie to see who can kill them first! The Horsemen, the Mutant Liberation Front and the Dark Riders are all in on a wild battleride leading to the Moon and a turning point in mutantdom's destiny! All this plus jousting in Genosha, trips into our heroes' deepest psyches and final battle with the deadliest enemies X-Factor's never heard of! Guest-starring the X-Men, Doc Samson and more! Collecting X-FACTOR #84-89 and ANNUAL #8.\r<br>Rated T+ ...$15.99\r<br>ISBN: 978-0-7851-2745-1\r<br>", "X-Men: The Complete Onslaught Epic Book 2 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got under way! Professor X hasn't been himself lately - moody, inscrutable - but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, X-Factor and X-Force, but also forgotten stars of the nineties like Phil Urich, the Green Goblin; Nate Grey, the X-Man; and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Punisher, S.H.I.E.L.D. and others! Collecting EXCALIBUR #100, WOLVERINE #104, X-FACTOR #125-126, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, PUNISHER #11, X-MAN #18 and X-FORCE #57.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2824-3\r<br>", "New Avengers: Illuminati (Trade Paperback)": "The Illuminati. What are they? An elite group of the planet's most powerful guardians. When do they meet? Whenever the Earth faces its greatest threats. Who are they? Nobody knows ' and that's the way they want it! Join Iron Man, Professor X, Black Bolt, the Sub-Mariner and Mister Fantastic as they take on the threats no one else can handle ' and learn of secrets that will forever alter the way they (and you) look at the Marvel Universe! After years spent protecting Earth from harm, it is now when the planet is perhaps at its most endangered ' as the Illuminati find themselves at the head of the spear of a Skrull invasion. But can the Illuminati keep themselves from fracturing in the waking moments of this worldwide threat? Collecting NEW AVENGERS: ILLUMINATI #1-5.\r\nRated T  '$14.99\r\nISBN: 978-0-7851-2437-5", "X-Men Vs. Apocalypse Vol. 1: The Twelve (Trade Paperback)": "Setting his grand plan for godhood into motion, Apocalypse dispatches his agents to capture the world's most powerful mutants, the fabled Twelve: Professor X, Cyclops, Jean Grey, Storm, Iceman, Sunfire, Polaris, Cable, Bishop, Mikhail Rasputin, the Living Monolith and Magneto. Having himself planted the seeds of the Twelve legend, Apocalypse hopes to siphon their power, granting him omnipotency. Desperate to stave off his ascension, the X-Men must strike a temporary truce with Magneto to battle the warlord's forces as the Twelve are assembled -- and one longtime member seemingly sacrifices his own life to end the threat of Apocalypse once and for all!  Collecting Uncanny X-Men 376-377, Cable 73-76, X-Men 96-97, Wolverine 145-147, X-Men 1999 Yearbook.\r<br>Rated T+ ...$29.99", "New Avengers: Illuminati Premiere (Hardcover)": "The Illuminati is a secret organization comprised of several of the world's most powerful heroes: Doctor Strange, Sorcerer Supreme; Black Bolt, king of the Inhumans; Charles Xavier, founder of the X-Men and mutant-rights activist; Reed Richards, founding member of the Fantastic Four; Namor the Sub-Mariner, king of Atlantis; and Iron Man (Tony Stark), founding member of the Avengers. These six men have worked together to mold and shape the status of the superhuman world and the world around it. How and what they have done together has remained a mystery...until now! Writers Brian Michael Bendis (NEW AVENGERS, ULTIMATE SPIDER-MAN) and Brian Reed (MS. MARVEL) have joined together with Jim Cheung (YOUNG AVENGERS) to reveal this untold story of the Marvel Universe and how the Illuminati's actions affect today! Collecting NEW AVENGERS: ILLUMINATI #1-5.\r<br>Rated T+ ...$19.99 \r<br>ISBN: 978-0-7851-2437-5\r<br>", "Astonishing X-Men (2004) #24 (Variant)": "\"UNSTOPPABLE\" \r\nEverything, from #1 to now, comes down to this. Things will change. One will not return. This is the end. Or is it? Part 6 (of 6)\r\nRated T  ...$2.99", "Astonishing X-Men (2004) #24": "\"UNSTOPPABLE\"  Everything, from #1 to now, comes down to this. Things will change. One will not return. This is the end. Or is it? Part 6 (of 6) Rated T  ...$2.99", "Uncanny X-Men: Extremists (Trade Paperback)": "The X-Men are back from space! Well, half of them, anyway. The team is shattered, broken and separated. The group that has returned to Earth is finding it much worse than how they left it - especially underground. Attacks in the Morlock Tunnels immediately grab the X-Men's attention. What do these attacks have to do with the future of the mutant race? Maybe special guest-star Storm can get to the bottom of all this! Collecting UNCANNY X-MEN #487-491.\r<br>Rated T+ ...$13.99\r<br>", "X-Men: The Complete Onslaught Epic Vol. 1 TPB (Trade Paperback)": "It begins here! The saga that literally re-made the Marvel Universe of the 1990s is collected in chronological order across four volumes! The psionic force of nature known only as Onslaught sprang forth from the fractured psyche of mutant mentor Charles Xavier and the genetic terrorist called Magneto. Powered by his progenitors' rage, Onslaught laid siege to humanity -- touching off a cataclysmic conflict destined to deprive a world of its most revered icons! Collecting X-MEN #53-54, UNCANNY X-MEN #334-335, AVENGERS #400-401, ONSLAUGHT: X-MEN, X-MAN #18, X-FORCE #57, CABLE #34 and INCREDIBLE HULK #444.\r\n272 PGS./Rated T  '$29.99\r\nISBN: 978-0-7851-2823-6", "New Avengers: Illuminati (2006) #5": "The Illuminati convene to deal with both the New Avengers and the Mighty Avengers. But not everyone in the cabal is who they say they are? Betrayal and intrigue await you in this issue!", "X-Men: Messiah Complex (2007) #1": "MESSIAH COMPLEX PART 1 Just when it looked like there was no possibility of a future for mutants, hope arrives. But the X-Men aren't there to meet it-The Marauders and Purifiers beat them to it. Now the race is on to get the first new mutant since the mutants became an endangered species.", "Uncanny X-Men (1963) #490": "Why are the Morlocks terrorizing innocent people?  What is their endgame?  That's what Storm and the X-Men are trying to find out.  All the while, Professor X and Nightcrawler are on the trail of Magneto!", "Astonishing X-Men (2004) #22": "\"UNSTOPPABLE\" The X-Men are on the run on Breakworld.  Can they keep the warlords of Breakworld from killing Colossus?  If his life means the destruction of an entire planet, SHOULD they save him?  Part 4 (of 6) 32 PGS./Rated T  ...$2.99", "Women of Marvel Vol. 2 (Trade Paperback)": "More classic tales of Marvel's leading ladies! Featuring Kitty Pryde, Black Cat, Dagger, Spider-Woman, Tigra, Jubilee and more! Collecting AVENGERS #83, STRANGE TALES #10-11, SPIDER-WOMAN #10, WEST COAST AVENGERS #15, visions & the Scarlet Witch #12, Uncanny X-Men #168, 189, 201, & 218\r<br>232 PGS./Rated A ...$24.99 \r<br>", "New Avengers: Illuminati (2006) #4": "They have faced the Skrull empire, the Hulk, the Sentry, the Infinity Gems and the Beyonder, but now the secret society of Marvel is faced with the one thing too much for even them...", "Uncanny X-Men: Rise & Fall of the Shi'ar Empire (Hardcover)": "A brand-new era for UNCANNY X-MEN begins here! Fresh off X-MEN: DEADLY GENESIS, Ed Brubaker takes the helm of Marvel's mighty mutants. Young Guns Reloaded artist Billy Tan and Clayton Henry join Ed for a story that won't just affect Earth, but will rock the foundations of the entire galaxy! Vulcan is out for revenge and has his sights set on the Shi'ar Empire! Get ready for the ride of your life! A perfect starting point for any new reader! Collecting \r<br>UNCANNY X-MEN #475-486.\r<br>\r<br>272 PGS./Rated T+ ...$34.99\r<br>", "Uncanny X-Men (1963) #488": "The X-Men (re-united with Storm) take to the tunnels to discover why the Morlocks have been erupting with violence.  It ain't going to be pretty.  Also, Professor X goes off in search of a VERY IMPORTANT character from X-History.", "X-Men (2004) #200 (David Finch Gatefold Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "X-Men (2004) #200 (Humberto Ramos Wraparound Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "World War Hulk: X-Men (2007) #1": "When the Illuminati voted to shoot the Hulk into space, Professor X wasn't there...but the Hulk just found out he was supposed to be.  So he shows up at the Xavier Institute to ask a few pointed questions, Hulk style.  With the other teams away, only Beast and the New X-Men stand between the massive rage of the Hulk and the Professor...not to mention the younger students who'd be caught in the crossfire.  Can the X-Men-in-training survive the wrath of the Jade Giant until the other X-teams get back?  Or will the young mutants become casualties of the World War Hulk?\r<br>32 PGS./Rated A ...$2.99\r<br>", "X-Men (2004) #200": "The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history!", "Fantastic Four Omnibus Vol. 2 (Hardcover)": "With all that Stan Lee and Jack Kirby accomplished in their first 30 issues of FANTASTIC FOUR, who would have thought they were just warming up? Well, True Believers, now it's time to jump into the fire because the second 30 are where they really start to turn up the heat!\r<br>Their achievements reflect the boundless energy of two creators at the top of their game with each issue, character and creation building upon and exceeding the scope of the last. It's a list of accomplishments unparalleled in the history of comics: the origin of Dr. Doom; the Frightful Four; the Wedding of Reed Richards and Sue Storm; the Inhumans; the first appearance of the Silver Surfer; the Galactus Saga; the debut of the world's first black super hero, the Black Panther; the cosmic clash between the FF, the Surfer and Dr. Doom; and, of course, \"This Man, This Monster!\" - the story widely regarded as the greatest FF tale of all! \r<br>Collecting the greatest stories from the World's Greatest Comics Magazine in one, massive collector's edition that has been painstakingly restored and recolored from the sharpest material in the Marvel Archives. With critical essays on the Lee/Kirby collaboration and bonus features a-plenty, this book is nothing short of a cornerstone to the Marvel Universe!\r<br>Collecting FANTASTIC FOUR #31-60 and ANNUAL #2-4.\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2403-9\r<br>Trim size: oversized\r<br>FANTASTIC FOUR OMNIBUS VOL. 2 HC - VARIANT EDITION\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2510-8\r<br>", "Uncanny X-Men (1963) #487": "The X-Men are back from space!  Well, half of them, anyway.  The team is shattered, broken and separated.  The group that has returned to earth is finding it much worse than how they left it-- especially underground.  Attacks in the Morlock Tunnels immediately grab the X-Men's attention. What do these attacks have to do with the future of the mutant race?  Maybe special guest-star Storm can get to the bottom of all this!", "New Avengers: Illuminati (2006) #3": "Years ago a mysterious creature called the Beyonder gathered the heroes and villains of the Marvel Universe for the Secret Wars. Now, finally, after decades of mystery, the true origin of this powerful creature is revealed...", "Uncanny X-Men (1963) #486": "This is it! The final chapter to Ed Brubaker's Uncanny X-Men epic!  Who lives? Who dies? And who gets left in outer space?! It's the action packed finale that sets the X-Men and the Shi'Ar Empire into whole new directions!", "Ultimate X-Men Vol. 16: Cable (Trade Paperback)": "If one man is capable of disrupting the carefully controlled world of Charles Xavier's School For Gifted Youngsters, it's this one: Ultimate Cable! He comes from a tragic future to wreak havoc on mutantkind today, and his sinister secrets will shock the X-Men to their very core. It's a huge event in Ultimate X-Men history. Get in on the ground floor. You've been warned. Plus: Delve into the secret life of the X-Men's rivals, Emma Frost's Academy of Tomorrow, in a special bonus story! Collecting ULTIMATE X-MEN #75-80.\r<br>160 PGS./Rated T+ ...$14.99\r<br>", "Uncanny X-Men (1963) #485": "War rages across the entire Shi'Ar Empire!  Emperor D'Ken is back and his new right hand man, Vulcan, plans on doing some truly terrible things to Charles Xavier!  But the X-Men and Starjammers are en route to save him.  This could turn into a suicide mission quicker than you can say M'Kraan!", "Spider-Man: Birth of Venom (Trade Paperback)": "The Beyonder's Battleworld might seem a strange place to get new threads, but it's Spider-Man who becomes unraveled when his shape-changing costume attempts to darken his life as well as his fashion sense! But ridding himself of his riotous raiment proves an even greater mistake when its alien enmity bonds with mortal madness to form our hero's most dedicated decimator! Plus: the first appearances of Puma and the Rose! Mary Jane Watson's startling secret! And the debut of the battling...Bag-Man!? Guest-starring the Black Cat, the Fantastic Four and more! Collecting SECRET WARS #8; AMAZING SPIDER-MAN #252-259, #298-300 and #315-317; FANTASTIC FOUR #274; and WEB OF SPIDER-MAN #1;  AMAZING SPIDER-MAN ANNUAL #10.\r\n344 PGS./Rated A ...$29.99", "Uncanny X-Men (1963) #484": "It's war!  The Shi'ar Empire is back doing what it does best, conquering and killing! The X-Men, Star Jammers, and the ousted Lilandra must fight their way through legions of the mighty Shi'ar in the hope to free the imprisoned Charles Xavier!", "New Avengers: Illuminati (2006) #2": "If the Infinity Gems ever fell into the wrong hands it would be catastrophic. So, when the Illuminati discover the gems are scattered across the cosmos, completely unguarded, the race is on to collect them before anyone else learns the truth!", "Astonishing X-Men Vol. 3: Torn (Trade Paperback)": "They're back! The chart-topping super-team of Joss Whedon and John Cassaday return for more Astonshing X-Men! If you thought their past efforts were full of shocks and surprises, hold onto your eyeballs - because you haven't seen anything yet, as things go from peculiar to just plain bizarre! Emma Frost's erratic behavior has the X-Men spinning in a non-stop downward spiral. Will an unlikely union be the final straw? After secretly lying in wait for months, the new Hellfire Club makes its move! Plus: The X-Man destined \r<br>to destroy the Breakworld stands revealed! Who is it, and what will be their fate? Collecting ASTONISHING X-MEN #13-18.\r<br>144 PGS./Rated T+ ...$14.99\r<br>", "Avengers Assemble Vol. 4 (Hardcover)": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>", "Uncanny X-Men (1963) #482": "The all-out battle for control of the Shi'ar Empire begins here! The X-Men team-up with the Starjammers for a rescue mission that could mean everything for the future of the Shi'ar Empire! Meanwhile, Darwin and Xavier are trapped in the clutches of the enemy!", "Astonishing X-Men (2004) #19": "\"UNSTOPPABLE!\" Part 1 (of 6) Strap yourselves in, folks! It's the beginning of Joss Whedon and John Cassaday's final arc on Astonishing X-Men! After the shocking and brain-smashing events of last issue, the X-Men are off to protect the Earth from its destruction at the hands of the Breakworld. And when it's all over, nothing will ever be the same! No really, we mean it! Whedon & Cassaday prove they are more than Astonishing: They are UNSTOPPABLE! 32 PGS./Rated T  ...$2.99", "New Avengers: Illuminati (2006) #1": "Doctor Strange, Black Bolt, Charles Xavier, Reed Richards, Namor the Sub-Mariner and Tony Stark. These six men have worked together to shape the super human world. How and what they have done together has remained a mystery...", "Ultimate X-Men (2000) #77": "CABLE PART 3 The X-Men head to an abandoned Weapon X facility in Finland to battle Cable and rescue Jean. Only Cyclops has stayed behind with Xavier as a last line of defense. If Cable takes down the X-Men, will Cyke be able to put an end to him?", "Uncanny X-Men (1963) #481": "The Shi'Ar Empire is crumbling at the hands of Vulcan! The X-Men, with Professor X captured, search for the one group of heroes that can save them and all of the Shi'Ar...the Starjammer", "New X-Men (Hardcover)": "Sixteen million mutants dead - and that was just the beginning! In one bold stroke, writer Grant Morrison (All-Star Superman, JLA, FANTASTIC FOUR: 1234) propelled the X-Men into the 21st century - masterminding a challenging new direction for Marvel's mutant heroes that began with the destruction of Genosha and never let up. Regarded as the most innovative thinker of the current comic-book renaissance, Morrison proceeded to turn the mutant-hero genre on its ear. Gone were the gaudy spandex costumes - replaced by slick, black leather and an attitude to match. Now, his entire Eisner Award-nominated run on NEW X-MEN is collected in one deluxe hardcover! Collects NEW X-MEN #114-154 and ANNUAL 2001.\r<br>1096 PGS./Rated T+ ...$99.99\r<br>", "Astonishing X-Men (2004) #18": "It's the jaw-dropping conclusion to \"Torn!\" How will Emma's betrayal affect the team?! Will the Hellfire Club stand victorious?!", "Uncanny X-Men (1963) #480": "The foundations of the mighty Shi'Ar are shaken! Vulcan is here! His first test, the Imperial Guard! It's Vulcan vs. Gladiator. The victor will decide the fate of an entire galaxy!", "X-Men: The Complete Age of Apocalypse Epic Book 4 (Trade Paperback)": "Learn who lives and who dies in either reality as the apocalyptic arc ends in treachery and tragedy! While certain heroic humans prove their mettle without armor or magic hammers, it's a race to see who the X-Men will destroy first: Apocalypse or themselves! But even with the crisis concluded, new allies and enemies emerge, guaranteeing that reality will still never be the same! Featuring the dawn of Gene Nation and a turning point for the Legacy Virus! Collects GENERATION NEXT #4, X-CALIBRE #4, X-MAN #4 and #53-54, FACTOR X #4, GAMBIT AND THE X-TERNALS #4, AMAZING X-MEN #4, WEAPON X #4, X-UNIVERSE #2, X-MEN: OMEGA, BLINK #4, and X-MEN: PRIME.\r<br>368 PGS./Rated T+ ...$29.99\r<br>", "Uncanny X-Men (1963) #479": "The X-Men find themselves deep within Shi'Ar space and even deeper trouble. The Shi'Ar have sent their secret weapon after an unaware Marvel Girl. Meanwhile, Professor X has his hands full with a band of rogue soldiers that have their sights on him. And they are out for blood!", "Ultimate X-Men Vol. 14: Phoenix? (Trade Paperback)": "After the events of MAGNETIC NORTH and their recent encounter with the master of magnetism, our heroes kick back for a night on the town with their significant others. Meanwhile, Wolverine must face a dreaded foe from the past who comes back to haunt him with unbearable secrets that have been buried for years. Plus: The mysterious mutant called Magician is plunged into the world of the X-Men, adjusting quickly and making new friends fast. But there is something deeply sinister about the newcomer. Something only young Kitty Pryde notices. Let's hope she hasn't noticed too late. Meanwhile, is Jean Grey really the cosmic entity called Phoenix? And if so...what can be done about it...? Join new ULTIMATE X-MEN writer Robert Kirkman, ULTIMATE SECRET's Tom Raney and Vigilante's Ben Oliver as they take the Ultimate Universe's favorite mutants to dazzling new heights! Collects ULTIMATE X-MEN #66-71.\r<br>144 PGS./Rated A ...$14.99\r<br>", "Ultimate X-Men (2000) #74": "MAGICAL PART 3 The X-Men discover the true nature of The Magician. Meanwhile, discover the fate of Jean Grey. Plus, battle at the X-Mansion! \n", "X-Men: The End Book 3: Men and X-Men (Trade Paperback)": "The endgame of the last tale of Marvel's most popular mutants begins! They've suffered through sneak attacks, betrayals, and fatalities - now, Professor X and Magneto are taking the fight back to the enemy, amidst the stars! Collects X-MEN: THE END - MEN AND X-MEN #1-6. \r<br>144 PGS./Rated T+ ...$14.99\r<br>", "Uncanny X-Men (1963) #478": "Prof. X and his new team find themselves between a hunk of space junk and a hard-place, as they search the wreckage of Vulcan's path of destruction for the secret that will help them get to the Shi'Ar throneworld in time. But Marvel Girl's presence on the outskirts of Shi'Ar controlled space has not gone unnoticed, and a new enemy with deep ties to her is unleashed!", "Astonishing X-Men (2004) #16": "The X-Men have been ripped apart and mentally destroyed. Only one remains standing.  But with the combined power of the Hellfire Club standing in their way, what chance  do they have?!", "Ultimate X-Men (2000) #73": "MAGICAL PART 2 The Magician's standing with the X-Men is put to the test as questions about his past begin to surface. Did he lie to gain entry to the group? Meanwhile, Jean Grey is having difficulty dealing with the results of the Shi'Ar testing. \n", "Black Panther (2005) #18": "BRIDE OF THE PANTHER PART 5 The Black Panther and Storm are ready to tie the knot. Prepare for the wedding of the decade!", "New Excalibur Vol. 1: Defenders of the Realm (Trade Paperback)": "Excalibur is back, just the way you like them! From the ashes of House of M a new Excalibur team is formed to combat the aftereffects of this cataclysmic event! Witness the birth of Captain Britain's new team forming, as a sinister force already tries to tear them apart! Starring Dazzler, Juggernaut, Nocturne and Pete Wisdom!! Guest-starring the Uncanny X-Men! Plus: Still reeling from M-Day, New Excalibur is brought together to become Europe's premier super team. Not everyone is pleased. Guest starring Lionheart (from the pages of AVENGERS)! Collects NEW EXCALIBUR #1-6.\r<br>168 PGS./Rated A ...$17.99\r<br>", "Black Panther (2005) #18 (TURNER VARIANT)": "CIVIL WAR Tie-in\r\n\"BRIDE OF THE PANTHER\"\r\nSPECIAL DOUBLE-SIZED ISSUE! It's the Wedding of the Century as T'Challa and Storm finally make it to the altar -- and not since Reed and Sue tied the knot have so many of Marvel's super heroes assembled for such a happy occasion.  Can this gathering offer much-needed respite from the Civil War that's erupted in the U.S., or will it too be engulfed by the insanity that's currently rocking the Marvel Universe?  Don't miss this historic event -- and turning point in the CIVIL WAR.  Featuring backup features, including a look behind the scenes at the creation of Storm's wedding gown, and wraparound cover by Frank Cho!  Part 5 (of 5).\r\n48 PGS./Rated T  ...$3.99", "New Avengers Vol. 2: Sentry (Trade Paperback)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? Collects NEW AVENGERS #7-10 and the NEW AVENGERS: MOST WANTED FILES handbook.\r<br>152 PGS./Rated A ...$14.99\r<br>", "Uncanny X-Men (1963) #475": "\"THE RISE AND FALL OF THE SHI'AR EMPIRE\" Begins!  Vulcan is out for revenge and has his sites set on the Shi'Ar Empire! Get ready for the ride of your life!", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Astonishing X-Men (2004) #15": "Move over Astonishing X-Men...there's a new club in town and their name is...\"Hellfire.\"  In this issue, after secretly lying in wait, they make their move!", "Ultimate X-Men (2000) #71": "PHOENIX PART 3 The quest to learn if Jean Grey is, in fact, the Phoenix reaches a shattering conclusion! And the mystery surrounding the X-Men's newest member, the Magician, deepens-as Nick Fury starts putting the pieces together! ", "X-Men: The End - Men and X-Men (2006) #6": "The long-awaited climax! Who lives, who dies, who changes-and why, after the conclusion of this adventure, is there no longer a need for X-Men?", "Uncanny X-Men Omnibus Vol. 1 (Hardcover)": "When a young writer named Chris Claremont took over X-Men in 1976, few fans could predict the incredible impact he would have on the Marvel Comics series. With a flair for realistic dialogue, heartfelt storylines and hard-hitting action, Claremont's writing breathed life into the characters. In collaboration with artists Dave Cockrum and John Byrne, Claremont crafted a run still heralded as a definitive era on the book. UNCANNY X-MEN became more than just another super-hero title: this diverse cast of mutants fighting against prejudice and intolerance has resonated in the hearts of millions of devoted readers. Now, the first five years of their landmark run on UNCANNY X-MEN are collected in one oversized volume. This keepsake edition also includes all original letters pages, newly remastered coloring and other uncanny extras! Collects UNCANNY X-MEN #94-131 and ANNUAL #3, and GIANT-SIZE X-MEN #1.\r<br>848 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$99.99\r<br>", "Astonishing X-Men (2004) #14": "From peculiar to just plain bizarre. Emma Frost's erratic behavior has the X-Men spinning in a non-stop downward spiral. Will an unlikely union be the final straw?", "Astonishing X-Men Vol. 1 (Hardcover)": "This deluxe hardcover collects ASTONISHING X-MEN VOL. 1: GIFTED and ASTONISHING X-MEN VOL. 2: DANGEROUS, plus extras. In GIFTED, Cyclops and Emma Frost re-form the X-Men with the express purpose of \"astonishing\" the world. But when breaking news regarding the mutant gene unexpectedly hits the airwaves, will it derail their new plans before they even get started? As demand for the \"mutant cure\" reaches near-riot levels, the X-Men go head-to-head with the enigmatic Ord, with an unexpected ally - and some unexpected adversaries - tipping the scales! In DANGEROUS, a tragic death at the Xavier Institute reveals a powerful enemy living among the X-Men that they could never have suspected - and no, it's not Magneto. Things heat up in a way none of the X-Men ever dreamed, but will teamwork save the day when they can't even depend on themselves? Collects ASTONISHING X-MEN #1-12.\r\n320 PGS./Rated T  SUGGESTED FOR TEENS AND UP ...$29.99", "X-Men: Mutant Genesis (Trade Paperback)": "The best-selling storyline is back in print! The mutant terrorist Magneto again threatens the world, and only the X-Men can stop him! And should they survive this confrontation, the villainous Omega Red is waiting in the wings! Collects X-MEN #1-7.\r<br>176 PGS./ T+ SUGGESTED FOR TEENS AND UP ...$19.99\r<br>ISBN: 0-7851-2212-5\r<br>", "X-Men: The End - Men and X-Men (2006) #3": "A strike-force led by Cyclops finds itself pitted against the Shi'ar Imperial Superguardians as a separate team of X-Men travel deep into space to rescue the Phoenix. And Gambit, disguised as Mr. Sinister confronts the Shi'ar Chancellor!", "X-Men: The End - Men and X-Men (2006) #2": "The last days of the X-Men, revealed! What terrible threat hangs above Mutantkind's head? What dark secret will destroy them all?", "New Excalibur (2005) #3": "It's New Excalibur vs. the original X-Men!!  With the Uncanny X-Men down, can Captain Britain and his team defeat what appears to be a murderous team of Cyclops, Jean Grey, Iceman, Beast, Angel and Charles Xavier?\r<br>32 PGS./ RATED A ...$2.99\r<br>", "SECRET WARS TPB (Trade Paperback)": "The classic 12-issue limited series is back in print! The first mega-crossover of its kind, SECRET WARS still stands as a milestone in the comic-book industry. The fate of the entire Marvel Universe hangs in the balance as all of Earth's greatest super heroes face their deadliest foes on the mysterious planet known as Battleworld! \r<br>336 pages./ T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "X-Men: The Complete Age of Apocalypse Epic Book 2 (Trade Paperback)": "See your favorite mutants through a dark glass as the epic that literally rebuilt the X-Men in eight miniseries and more continues! Apocalypse has conquered half of humankind and is ready to destroy them all! Magneto and his Amazing X-Men fight to protect humans and mutants alike, only to learn from Bishop (now on his THIRD reality and counting) that his world might need to be unmade! Plus: excerpts from Apocalypse's own files on the alternate-universe X-Men, and their friends and foes...but which is which? Featuring Blink and Sabretooth of the Exiles! Collects X-MEN: ALPHA, AGE OF APOCALYPSE: THE CHOSEN, GENERATION NEXT #1, ASTONISHING X-MEN VOL. 1 #1, X-CALIBRE #1, GAMBIT AND THE X-TERNALS #1-2, WEAPON X VOL. 1 #1-2, AMAZING X-MEN #1-2, FACTOR X #1-2 and X-MAN #1\r<br>376 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Astonishing X-Men (2004) #12": "The \"Danger\" story-arc comes to its senses-shattering conclusion as the X-Men face an enemy they never dreamed of.", "New Avengers (2004) #9": "\"THE SENTRY\"\r<br>The mystery of the Sentry revealed! What has kept the Sentry a secret from the world, and how will the world react to his re-emerging. Featuring guest stars galore, and the setup for the blistering new Sentry series by Sentry creator Paul Jenkins. Part 3 (of 3).\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "X-Men Vignettes Vol. 2 (Trade Paperback)": "From the frozen Canadian wilderness to the Shi'ar Galaxy, witness behind-the-scenes tales from an earlier X-Men era! See through the psionic sight of a super-villain! Secrets of Magneto, Banshee, Colossus, Storm, Wolverine and more revealed! It's subplot central from Marvel's magnificent mutant maven! Collects the backups stories from CLASSIC X-MEN #14-25.\r<br>152 PGS./Marvel T+ &#8230;$17.99\r<br>ISBN: 0-7851-1728-8\r<br>X-MEN VIGNETTES VOL. 1 TPB STILL AVAILABLE!\r<br>$17.99 \r<br>", "Astonishing X-Men (2004) #11": "The X-Men are put to the test by an enemy within and a secret of Professor X may put the entire team at risk.", "Astonishing X-Men (2004) #10": "A familiar face returns to the pages of ASTONISHING X-MEN just as things take a turn for the worse. But will the helping hand be in time?", "Marvel Weddings (Trade Paperback)": "Reed and Sue, heart and soul of Marvel's First Family of Super Heroes. Peter and Mary Jane, the spider and the supermodel. Scott and Jean, childhood sweethearts sworn to protect a world that hates and fears them. Bruce and Betty, the beauty and the beast. Break out the tissues, True Believer: The House of Ideas cordially invites you to celebrate the history-making nuptials of its greatest couples in this keepsake edition! From the Fantastic Four to Spider-Man to the X-Men, with a few surprises in between, this commemorative volume proves the power of love can overcome all odds! Collects FANTASTIC FOUR #150 and ANNUAL #3, INCREDIBLE HULK #319, AVENGERS #59-60 and #127, AMAZING SPIDER-MAN ANNUAL #21 and X-MEN #30.", "Marvel Masterworks: The Uncanny X-Men Vol. 5 (Hardcover)": "In celebration of the 25th anniversary and presented here for the first time in full-archival color, including pages straight from the Byrne/Austin originals, the Dark Phoenix Saga! \r<br>Gathered together by Professor Charles Xavier to protect a world that fears and hates them, the X-Men had fought many battles, been on adventures that spanned galaxies, grappled enemies of limitless might, but none of this could prepare them for the most shocking struggle they would ever face. One of their own members, Jean Grey, has gained power beyond all comprehension, and that power has corrupted her absolutely!\r<br>Now they must decide if the life of the woman they cherish is worth the existence of the entire universe!\r<br>Collecting X-Men #132-140, Annual #4 with special bonus features including the original X-Men #137 story where Jean Grey lived \"Phoenix: The Untold Story\" and the Claremont/Buscema Phoenix classic from Bizarre Adventures #27! And if that wasn't enough, brace yourself for a brouhaha with Wendigo and the seminal story of that furry blue elf Nightcrawler in \"Nightcrawler's Inferno.\"\r<br>", "What If...? Vol. 1 (Trade Paperback)": "In the proud tradition of its late, lamented series of the seventies and eighties, the House of Ideas once again poses the question, \"What if?\" The hottest creators in comics take on Marvel's top characters - turning their lives upside-down in the name of entertainment! Featuring decidedly different interpretations on Daredevil, the Avengers, the Fantastic Four, Spider-Man, the X-Men, the Hulk and more! Collects WHAT IF JESSICA JONES HAD JOINED THE AVENGERS?, WHAT IF KAREN PAGE HAD LIVED?, WHA...HUH?, WHAT IF AUNT MAY HAD DIED INSTEAD OF UNCLE BEN?, WHAT IF DR. DOOM HAD BECOME THE THING?, WHAT IF MAGNETO HAD FORMED THE X-MEN WITH PROFESSOR X?, WHAT IF NEW MUTANTS? and WHAT IF GENERAL ROSS HAD BECOME THE HULK?", "What If? (2004) #1": "X-Men legend Chris Claremont joins with the hot-shot artistic team of Cully Hamner (inside) and Jim Cheung (outside) to ask a question that MUST be answered only with speculation.  Imagine a world where the Master of Magnetism had chosen a different path.  Or perhaps he could have swayed Xavier from his own beliefs?  These two legends stalk the halls of X-Men Canon, and at last the question is asked, \"What if things had been different?\"", "X-Men: Dream's End (Trade Paperback)": "The death of Colossus, reprinted here for the first time! For too long mutants were threatened by the twin specters of the Legacy Virus and anti-mutant politics. Now, the X-Men hope to end both threats, but at what cost to their oldest and dearest? Are there deaths from which even the X-Men can't return? Featuring Mystique, Cable and the last issue of Bishop's solo series!", "X-Statix Vol. 4: X-Statix Vs. the Avengers (Trade Paperback)": "Who's stronger? Who can beat whom? Well, you're about to find out! And how! America's favorite mutant team, X-Force, squares off against Earth's Mightiest Heroes, the Avengers, in the rumble of the century...or at least the next four months! Collecting X-STATIX #19-26.", "Marvel Masterworks: The X-Men Vol. 4 (Hardcover)": "The latest & greatest title in the juggernaut that is Marvel Masterworks!\r\nCollecting the original tales of Marvel's merry mutants, MARVEL MASTERWORKS: THE X-MEN VOL. 4 presents the long out-of-print stories from X-MEN (Vol. 1) #32-42 for the first time in thirty years!\r\nThis is the original X-Men: ReLoad featuring the team's first new costumes and the death of Professor X! So hold onto your hats as the X-Men go toe-to-toe against Juggernaut, the Mole Man, Mekano, the Changeling and more menaces than any other mutants' muster could match!\r\nFeaturing guest appearances by Spider-Man and Dr. Strange, these classic tales are a must-have!", "Ultimate X-Men Vol. 9: The Tempest (Trade Paperback)": "Bound together by their unique genetic heritage, the mutant members of the X-Men have become more than just a team - they've become a family. But even the strongest family can be ripped apart by tragedy... and the death of one of their own leaves the remaining X-Men struggling to deal with the loss. And even before a moment of silence can pass, the mysterious Mr. Sinister arrives, intent on giving the X-Men a lot more to mourn! Collects ULTIMATE X-MEN #46-49.", "Ultimate X-Men (2000) #49": "Don't miss the conclusion of ULTIMATE SINISTER! This epic showdown finds the master assassin with the X-Men firmly in his sights!  What will happen as we gear up for next month's issue #50??", "Ultimate X-Men (2000) #47": "Mutants are turning up dead -- murdered in New York City. Someone is targeting them. When Charles Xavier learns of this, he puts his X-Men on the trail of the killer. But are Xavier's children of the atom the hunters -- or the hunted? And who is the mysterious figure in shadow that this serial killer follows implicitly? The answer will absolutely shock you!", "Wolverine Legends Vol. 6: Marc Silvestri Book I (Trade Paperback)": "Before Top Cow & Witchblade, artist Marc Silvestri rose to comics' superstardom during his legendary and sales record-breaking run on WOLVERINE and UNCANNY X-MEN. Now having made his triumphant return to NEW X-MEN, energizing his fans and finding legions of new ones, Marvel offers a new collected edition of some of his best Wolverine stories, highlighting a benchmark in the career of one of comics' top artists and a run of one of the industry's best-selling titles!\r\nWatch Wolverine take on the drug-crazed Japanese Yakuza, face down a legendary Canadian monster and uncover secrets of the mysterious Weapon X program, culminating in a battle with a cyborg version of himself!\r\nCollects WOLVERINE #31-34, 41-42, 48-50!", "Ultimate X-Men (2000) #42": "NEW MUTANTS PART 3 The debut of Ultimate Dazzler is here! After Hank McCoy's recent embarrassment at the hands of the public, he takes his leave of the Xavier's Institute. Meanwhile, concern grows over Xavier's relationship with the President.", "Uncanny X-Men (1963) #436": "\"TRIAL OF THE JUGGERNAUT\" pts. 1 & 2 (of 2)\r\nImprisoned and set to face trial, Juggernaut must finally face up to his violent, criminal past. Guest-starring the Avengers' SHE-HULK!\r\n32 PGS.(each)/MARVEL PSR...$2.25 (each)", "X-Statix Vol. 2: Good Guys & Bad Guys (Trade Paperback)": "The mutants in X-STATIX have seen \"Survivor\" and they know that fame is the ultimate currency in today's society .... and they're cashing in on their special mutant abilities. Now the squad is torn apart by interior squabbles. When push comes to shove, will the team's careers end at their own hands?\r\nCollects X-STATIX #6-10; WOLVERINE/DOOP 1-2 & Mike Allred's X-MEN UNLIMITED #41 story.", "New X-Men (2001) #146": "PLANET X PART 1 The young mutant known as Dust runs rampant at the Xavier Institute as Xorn and his remedial class assist Professor X in his efforts to quell her.", "New X-Men (2001) #141": "MURDER AT THE MANSION PART 3 Sage's computer brain has been shut down! Beak takes responsibility for the murder of Emma Frost! But not everything is as it seems! Who is the real assassin?", "Uncanny X-Men Vol. 2: Dominant Species (Trade Paperback)": "It's once again time for the X-Men to mutate. First, will Juggernaut - one of the X-Men's toughest foes - actually join their ranks? Then, as the high-flying Archangel goes through a major physical transformation that affects his powers, he encounters a threat to his family corporation. Finally, the entire roster gets a facelift as international artist Kia Asamiya redesigns their costumes.\r\nCollects Uncanny X-Men #416-420", "New X-Men (2001) #138": "Cyclops, Xorn, and Beast set out to neutralize the flaming Glob Herman before he demolishes a busload of human children! Plus, a funeral for a mutant and the fate of Quentin Quire, aka Kid Omega, is revealed.", "New X-Men (2001) #137": "Glob Herman has learned a new way to use his power: Glob-napalm! With flaming goo raining from above, Quentin Quire faces the newly freed Professor. Who will take the school? Plus, the mystery of Jumbo Carnation's death is revealed!", "New X-Men (2001) #136": "A U-Men squad attack Xorn and the special class in the woods outside the mansion! Meanwhile, Quentin Quire starts a riot at the institute! Plus, Cyclops and a certain woman who isn't his wife engage in a psychic tryst.", "New X-Men (2001) #135": "Xorn has taken the special class into the woods for a lesson they won't soon forget. Meanwhile, Quentin Quire assembles his fellow revolutionaries and gives them a little kick, in the form of some Hypercortisone D! Here come the New X-Men!", "X-Force: Famous, Mutant & Mortal (Hardcover)": "Long persecuted for their genetic differences, some mutants are cashing in on their special gifts. Widely accepted by the general populace, the all-new, all-different X-Force stands in defense of the free world... but only if they get paid. A story about money, race, sexuality and America's obsession with celebrities' disguised as a super hero comic.", "New X-Men (2001) #134": "At the scene of a grisly murder, Cyclops and Beast discover an inhaler containing the drug Hypercortisone D, a mutant steroid. Who's pushing these drugs to young mutants? What will this mean for students back at the mansion?", "New X-Men (2001) #133": "Wolverine rescues a young mutant from an Afghani mutant slave ring and encounters Fantomex. What is the mysterious Frenchman up to this time? Meanwhile, Professor Xavier is made the target of a daring assassination attempt.", "X-Men Visionaries: Jim Lee (Trade Paperback)": "The X-Men follow the trail of Rogue's nightmares to a hidden corner of the globe where the great dinosaurs of the Jurassic and Cretaceous Ages continue to rule.", "New X-Men (2001) #132": "The X-Men are on Genosha, surveying the destruction of the former mutant city, when they encounter Polaris. The X-Men attempt to calm the confused mutant when they inadvertently activate a recorded message from the deceased Magneto...", "New X-Men (2001) #131": "Romance is brewing among the X-Men! In Westchester, Warren takes the flight-capable students for a training session. There, sparks fly between Angel and Beak. Meanwhile, Scott and Emma engage in a rather unconventional therapy session...", "Chamber (2002) #1": "Will new X-Man Chamber solve the mystery of a hate crime — or become the next victim?", "New X-Men (2001) #130": "The Paris X-Corp strike team fight for their lives in the Channel Tunnel against the being known only as Weapon XII! Plus, Fantomex's secrets are revealed!", "New X-Men (2001) #129": "Despite international pressure, Professor X and Phoenix help to affect Fantomex's escape. Once clear of trouble, Fantomex makes not one, but two offers the mutant telepaths may not be able to refuse...", "New X-Men (2001) #128": "Fantomex makes his glorious debut! Professor X has established an X-Corp office in Paris for mutants in need. Meanwhile, the overseas X-Men team undertakes their first mission after a distress signal is sent out from deep within the Channel Tunnel.", "New X-Men (2001) #127": "A riot has broken out in Mutant Town! Xorn, Cyclops, and Phoenix head out to quell the violence. But will the task of battling an anti-mutant mob prove more difficult than the X-Men had previously imagined?", "New X-Men (2001) #124": "Lilandra has been convinced that the X-Men must be terminated with extreme prejudice. The X-Men are prepared to defend themselves, but how can they survive an engagement with Gladiator of the Imperial Guard?! Plus, Cyclops and Xorn escape!", "New X-Men (2001) #123": "The Shi'Ar Imperial Guard have attacked! In a surgical two-pronged assault on the X-Men, Gladiator issues but one command to his subordinates: destroy all mutants! Plus, learn the secret behind the flu outbreak at the mansion!", "New X-Men (2001) #122": "The Shi'Ar fleet is under siege and the empire threatens to crumble! All because of one person, the powerful sibling of Charles Xavier...Cassandra Nova! Can Lilandra and her disciples thwart this menace or will all be lost?", "New X-Men (2001) #121": "SILENCE.  Emma Frost and Jean Grey take a trip inside the mind of Cassandra Nova to rescue the consciousness of Professor X! What dark secret does the Professor have trapped inside?", "New X-Men (2001) #118": "GERM FREE GENERATION PART 1 The printing of the U-Men bible, \"The Third Species\", has incited a country-wide wave of violence. With Professor X gone and Beast in recovery from a mysterious attack, what are the X-Men to do?", "New X-Men (2001) #117": "Beast has got a busy day ahead of him. With a hot date planned for the evening and a training session with the mutant Beak during the day, what could go wrong?", "New X-Men (2001) #116": "E For Extinction Part 3 (of 3)  The X-Men are the only force capable of taking down the manical Cassandra Nova.  Plus, has the White Queen joined the X-Men?  And Xavier makes a shocking decision!", "New X-Men (2001) #115": "E For Extinction Part 2 (of 3)  Cassandra Nova stands responsible for the murder of 16 million mutants and the X-Men are bringing her down - dead or alive!", "X-Men: The Hidden Years (1999) #22": "The jam-packed conclusion to THE HIDDEN YEARS! Will Magneto's war divide and conquer?! Or will the world find a brief period of peace and coexistence between mutant and human? Take a nostalgic trip through time to the X-Men’s most classic era!", "New X-Men (2001) #114": "E For Extinction Part 1 (of 3) Sixteen million mutants dead - and that's just the beginning! The destruction of Genosha is just the beginning of a new era for the X-Men.", "X-Men: The Hidden Years (1999) #21": "Prince Namor plans an attack on Manhattan while Magneto kidnaps Susan Storm! PLUS: the X-Men battle Mole Man as the world stands on the brink of WAR!", "X-Men: The Hidden Years (1999) #20": "Super-villain team-up: the Sub-Mariner and Magneto! Namor, King of Atlantis, joins forces with the Master of Magnetism! Can even the X-Men stop this deadly duo from triggering all-out war?", "X-Men: The Hidden Years (1999) #19": "The X-Men find themselves spiraling into an abyss! It is far from a dream.", "Cable (1993) #88": "Cable reels from the death of Moira MacTaggert.", "Uncanny X-Men (1963) #389": "History of the relationship between Professor X and Moira MacTaggert", "X-Men: The Hidden Years (1999) #14": "The teenaged X-Men are back at it again, this time against mutant pop sensation, Dazzler!", "X-Men: The Hidden Years (1999) #13": "Professor X and the Beast continue to face the astounding power of a young girl and her friend, a mutant-hunting Sentinel!", "X-Men: The Hidden Years (1999) #10": "Candy Southern joins the X-Men?! Well, not quite, but wait'll you see what happens when she joins forces with Cyclops and Marvel Girl to find Angel! Meanwhile, Professor X and the Beast track down a new mutant! But when they find a young girl and a mutant-hunting Sentinel, they learn that all is not as it seems! All this and Iceman in the clutches of the sinister Sauron!", "X-Men: The Hidden Years (1999) #8": "When Professor X turned back an invasion by the alien Z'Nox, he had to link every mind on Earth. Reed Richards just happened to be one of those minds, and now he, and the FF, want answers! Byrne, the original X-Men, the Fantastic Four, Tom Palmer and special guest Joe Sinnott... now that's a marvelous team up!", "X-Men: The Hidden Years (1999) #5": "The team finds themselves caught in the torrential storms that surround the Savage Land! And to make matters worse, their makeshift hot-air balloon is beginning to break apart! Also, you'll never believe what happens when Xavier's School for Gifted Youngsters is paid a visit by Candy Southern!", "X-Men: The Hidden Years (1999) #1": "What happened between X-MEN #66 and GIANT-SIZE X-MEN #1? This series reveals all! Before Onslaught, before Apocalypse...before the world came to know the X-Men as an international band of exotic adventurers...there were a handful of troubled teenagers and one man with a dream. This series offers readers an easy jump-on point to follow the never-before-revealed exploits of a slimmed-down -- but still engrossing -- super group!", "New X-Men Vol. III: New Worlds (Trade Paperback)": "From the teeming city streets of Mutant Town to the irradiated ruins of the island nation Genosha, once a haven for mutants, the X-Men set out to heal the rift between humanity and Homo superior ' only to uncover a terrifying new threat to both species.", "Earth X (1999) #7": "Banner and Thor are betrayed as Ben Grimm is recruited for the war against the Red Skull!", "Earth X (1999) #6": "What has become of Professor Xavier's dream and how does Scott Summers press on?", "X-Men (1991) #91": "Marrow shows off her new found abilities. Rogue finds speaking her mind to be difficult.", "X-Men (1991) #90": "Magneto Rex ascends to power in Genosha, currying favor from the masses and gaining more following on the ground. Meanwhile, the X-team remains trapped thousands of light years away!", "X-Men Unlimited (1993) #23": "In the aftermath to Magneto’s rise to power, Professor X pushes his team to the brink. Is this the end of the dream?", "X-Men (1991) #84": "THE HUNT FOR XAVIER CONCLUSION Will young Nina be able to reprogram Cerebro? And what should happen is she fails? Professor Xavier is found, and recounts his dream for mutantkind to a sentient, and errant, Cerebro.", "X-Men (1991) #80": "Joe Kelly celebrates the 35th Anniversary of the X-Men! Witness the formation of an all-new mutant team. Plus, the mystery behind the ‘evil X-Men’ reaches a head.", "X-Men (1991) #-1": "Professor Xavier and Magneto’s joint past retold! How did these onetime friends become ideological enemies?", "Cable (1993) #29": "Cable prepares for his inevitable showdown with the enigmatic Nate Grey! But there's only one problem -- he'll have to face him ALONE!", "X-Force (1991) #47": "All is not as it seems at the Weisman Institute for the Criminally Insane, as Deadpool and Siryn can attest! X-Force is scattered left and right, as confusing leads lead to more dead ends. Who is Jeremy Stevens? What are his plans for X-Force’s heaviest hitters?", "Cable (1993) #23": "Cable goes to Professor X with an important request - help Nathan track down his wayward son, Tyler Summers! Plus, a murder investigation brings Domino face to face with an old friend!", "X-Force (1991) #45": "Cable and Professor X discuss their leadership styles while their respective teams spar off throughout the day. Meanwhile, Boomer is less than happy with Cannonball!", "X-Men: Prime (1995) #1": "The Age of Apocalypse has ended...but what new threats await the X-Men, X-Factor, X-Force and all mutants?  Plus, what Age of Apocalypse heroes and villains have crossed over to our reality?", "X-Men: Omega (1995) #1": "The final battle for the Age of Apocalypse is here - Apocalypse vs. Magneto and his X-Men.  Can these heroes set reality right and topple Apocalypse once and for all?", "X-Force (1991) #43": "Cable agrees to help the X-Men with their battle against Legion. Meanwhile, Locus reappears and gathers the entire X-Team to save Bobby!", "X-Men (1991) #41": "The Age of Apocalypse begins in the present while Professor Xavier plays his part in the past.", "Cable (1993) #20": "To save the Earth in the present, Cable has sent a message to the X-Men of the past. But will it be enough? Plus, Professor X teaches his last lesson...", "X-Force (1991) #38": "Forge reveals that a major techno-organic Phalanx embryo is about to erupt.", "X-Men Unlimited (1993) #5": "A Shi’ar envoy more or less kidnaps all the X-Men present – in this case Xavier, Storm, Forge and Jubilee – as they are expected to appear at an official royal function on the recently annexed Kree homeworld, Hala!", "Avengers (1963) #369": "With S.H.I.E.L.D and the Avengers deployed to Genosha, it seems that Cortez's plans have failed. With the appearance of a dangerous and powerful stranger however, things may not go the way the Avengers may hope. Is he friend of foe?", "X-Men Unlimited (1993) #3": "Former Weapon-X project Maverick begins his merciless hunt for Sabretooth. Will the X-Men be able to assist in his endeavor? And with Wolverine in Japan, will the news of Creed’s rampage reach Logan too late? Guest-starring Rogue, Bishop, and Gambit, as they try to stop Sabretooth dead in his tracks!", "Avengers (1963) #368": "Things go from bad to worse when it is discovered that Cortez has assassinated the Genoshan government!  And who do the Avengers and X-Men factor in?", "X-Men Unlimited (1993) #1": "IT'S ALL ABOUT SURVIVAL! Cyclops, Storm, and Prof. X are trapped in the Antartic by Siena Blaze in a plot to kill them in the Upstart's game.", "X-Force (1991) #19": "Members of X-Force are ready to break free! Meanwhile, Sunspot broods over the fate of X-Force, and Cannonball has a heated conversation with Professor X.", "X-Factor (1986) #86": "X-CUTIONER'S SONG Part 10. The lives of the X-Men are in the hands of their enemies! Apocalypse may be the only one who can save Professor X from the Techno-Organic Virus, while Cyclops and Jean Grey are at the mercy of Stryfe.", "Uncanny X-Men (1963) #294": "X-CUTIONER'S SONG Part 1.  The X-Men are assaulted by the Horsemen of Apocalypse! Meanwhile, a deadly assassin aims his sights at Professor X!", "Doctor Strange, Sorcerer Supreme (1988) #47": "Doctor Strange comes face-to-face against his Masked self from Counter Earth! Then Magus’ machinations come into play!", "Doctor Strange, Sorcerer Supreme (1988) #46": "Infinity War crossover! Doctor Strange, alongside Scarlet Witch, Dr. Druid, and the Sleepwalker, try to free Earth from its paralysis!", "X-Men (1991) #12": "Wolverine discovers a dark secret from Professor Xavier’s past.", "X-Men (1991) #5": "The Hand's plans for Omega Red have blown up in their face! Their would-be weapon has ditched his mission for an all-out grudge match with Wolverine and his team of X-Men.", "X-Men (1991) #2": "After their assault on Asteroid M, the X-Men stand....defeated?!  Meanwhile, a dark secret from Magneto's past emerges that makes everyone question the depth of his evil.", "X-Men (1991) #1": "It's the X-Men vs. Magneto, Master of Magnetism!  The X-Men's oldest enemy is back and it's going to take everyone in the X-Men have to bring him down. A Marvel classic from Chris Claremont and Jim Lee!", "X-Factor (1986) #70": "After the fight with the Shadow King, Legion is in a coma and Xavier attempts to wake him up!", "X-Factor (1986) #69": "The Shadow King has taken over the minds of the X-Men! Can they escape the mind control without any help?", "Uncanny X-Men (1963) #241": "As the X-Men begin to undergo demonic transformations of their own, Colossus separates from the group to find his sister Magik.", "X-Factor Annual (1986) #3": "Members of X-Force all receive the same distress call! Jean decides to lead the investigation.", "New Mutants (1983) #50": "Magik narrowly escapes the infected wrath of S'ym!", "Secret Wars (1984) #12": "NOTHING TO FEAR The heroes have defeated their enemies--all save one. Now, with the stolen power of The Beyonder himself, Doctor Doom strikes! Who can stop him now?", "Secret Wars (1984) #11": "...AND DUST TO DUST The penultimate chapter of SECRET WARS is here! The face of Doom is revealed!", "Secret Wars (1984) #10": "DEATH TO THE BEYONDER Though the heroes have successfully driven Galactus away, they find that their seeming victory has only sealed their fate.", "Secret Wars (1984) #9": "ASSAULT ON GALACTUS As the heroes make their last ditch effort against Galactus, Doctor Doom seizes the opportunity to grind them all under his heel.", "Secret Wars (1984) #8": "INVASION As the battle-weary heroes recuperate and repair their gear, Spider-Man makes make a discovery that will change his life and his costume!", "Secret Wars (1984) #7": "BERSERKER The death of an Avenger! The X-Men's greatest battle! And, introducing the all-new Spider-Woman!", "Secret Wars (1984) #6": "A LITTLE DEATH Galactus prepares to destroy both the heroes and the villians! Now, as both sides of the engagement plan their next move, two MIA soldiers make their return!", "Secret Wars (1984) #5": "THE BATTLE OF THE FOUR ARMIES The villains have the upper hand! As they plan their final strike, Galactus' mysterious vigil comes to a surprising end...", "Secret Wars (1984) #4": "SITUATION: HOPELESS The heroes' HQ has been destroyed! Thor has been captured by Enchantress and taken straight to the villains! Doctor Doom scores his first kill!", "Secret Wars (1984) #3": "TEMPEST WITHOUT, CRISIS WITHIN Doctor Doom creates two new villains Called Volcana and Titania to take the heroes down! Meanwhile, Spider-Man battles the X-Men!", "Secret Wars (1984) #2": "PRISONERS OF WAR Doctor Doom brings Ultron back online to battle the champions of Earth! Meanwhile, Magneto takes the lone-wolf route!", "Secret Wars (1984) #1": "THE WAR BEGINS Earth's heroes have been whisked away to a mysterious construct in space, but they are not alone. Earth's villains have also appeared. Who is to blame for this meeting of good and evil?", "X-Men Annual (1970) #8": "Fairytales ‘round the campfire with Marvel’s mightiest mutants! Illyana spins a tale about Kitty Pryde and her Space Dragon Lockheed. Wolverine and Nightcrawler also make an appearance - as heroes taking on the White Queen and Black King!\n", "Uncanny X-Men (1963) #167": "The New Mutants, The Starjammers, and the X-Men must band together to save a Brood-infected Professor X once the Brood begins to take hold? Can their mentor be saved or will he die by their hands?", "Uncanny X-Men (1963) #138": "Following the events of the Dark Phoenix Saga, the X-Men lay Jean Grey to rest.  After losing the woman he loves, Cyclops quits the X-Men -", "Uncanny X-Men (1963) #136": "CHILDREN OF LIGHT AND DARKNESS! The Dark Phoenix has defeated the X-Men. Who remains with the power to oppose her? In a last ditch effort, Professor X enters the fray!", "Uncanny X-Men (1963) #131": "RUN FOR YOUR LIFE! The X-Men have rescued Kitty Pryde. Now it is time to take the fight to the White Queen and recue their comrades. Prepare for a psychic battle between Emma Frost and Phoenix!", "X-Men Annual (1970) #4": "When the X-Men enter Nightcrawler's Inferno, they'll need the help of the Sorceror Supreme Doctor Strange to escape!", "Uncanny X-Men (1963) #90": "Reprint of Uncanny X-Men (1963) #42", "Uncanny X-Men (1963) #78": "Reprint of Uncanny X-Men (1963) #30", "Uncanny X-Men (1963) #75": "Reprint of Uncanny X-Men (1963) #27", "Uncanny X-Men (1963) #72": "Reprint of Uncanny X-Men (1963) #21", "Uncanny X-Men (1963) #70": "Reprint of Uncanny X-Men (1963) #17", "Uncanny X-Men (1963) #69": "Reprint of Uncanny X-Men (1963) #16", "Uncanny X-Men (1963) #68": "Reprint of Uncanny X-Men (1963) #14", "Uncanny X-Men (1963) #45": "It's Cyclops versus Quicksilver for the fate of the X-Men!", "Uncanny X-Men (1963) #42": "In their battle with the Sub-Human Grotesk, one of the X-Men will pay the ultimate price!", "Uncanny X-Men (1963) #41": "A strange creature altered by atomic radiation emerges in the surface world and fights the X-Men.", "Uncanny X-Men (1963) #38": "The X-Men race against the clock as Factor Three's plan is put into motion.", "Uncanny X-Men (1963) #30": "Who is the mysterious Warlock, and is he a match for Marvel's Merry Mutants?", "Uncanny X-Men (1963) #29": "The X-Men battle with the Super-Adaptoid, a being that possesses all of the Avengers' powers! Will Mimic face this new foe, or join him?", "Uncanny X-Men (1963) #28": "As friction increases between Mimic and the X-Men, a new mutant threat reveals itself in Manhattan!\nFirst appearance of Banshee.", "Uncanny X-Men (1963) #27": "The return of Mimic! The conniving copycat blackmails his way onto the X-Men. But what plans does the Puppet Master have for them all?", "Uncanny X-Men (1963) #25": "El Tigre seeks the power of a god, and the X-Men are in his way! With Marvel Girl gone from their ranks, do they have a prayer of stopping him?", "Uncanny X-Men (1963) #24": "There are plenty of mad scientists in the Marvel Universe, but few buggier than the Locust! Will his giant insects cut the X-Men down to size?", "Uncanny X-Men (1963) #23": "Framed for extorting Washington, D.C., the X-Men must capitalize on dissension in the Maggia's ranks! Meanwhile, a mysterious figure invades Count Nefaria's command center!", "Uncanny X-Men (1963) #21": "In the desert dwells Dominus! The X-Men must defeat an enemy they don't dare attack, but Lucifer's robots aren't returning the favor!", "Uncanny X-Men (1963) #20": "It's mutant mania when the Blob and Unus tag-team the X-Men! Featuring the origin of Professor X!", "Uncanny X-Men (1963) #19": "He's got all of the X-Men's powers but none of their sanity: the Mimic! He's out to join the team or destroy it, and he doesn't really care which!", "Uncanny X-Men (1963) #18": "Magneto sends the X-Men on a balloon ride of death! Only Iceman remains to challenge him!", "Uncanny X-Men (1963) #17": "The first Sentinel Saga is over, but metal can be dangerous even when it's not in the form of robots! Just ask...Magneto!", "Uncanny X-Men (1963) #16": "Have the Sentinels triumphed over the X-Men, or will they be struck down from within their own ranks? Before it's over, someone will die!", "Uncanny X-Men (1963) #15": "Part Two of the first X-Men vs. Sentinels storyline! The world's strangest teens have penetrated the rogue robots' citadel, but it'll be a lot harder to escape!", "Uncanny X-Men (1963) #14": "For the first time, the Sentinels walk the Earth! To protect humanity from mutantkind, they've decided to conquer the world - and only the X-Men can stop them!", "Uncanny X-Men (1963) #13": "Nothing can stop the Juggernaut, but the X-Men will go down trying! Guest-starring the Human Torch!", "Uncanny X-Men (1963) #12": "It's always awkward to have relatives crash at your place, especially when they're knocking down the walls! First appearance and origin of Professor X's stepbrother, the Juggernaut!", "Uncanny X-Men (1963) #11": "Magneto meets his match in the menace called...the Stranger! Can either the X-Men or the Brotherhood withstand his power?", "Uncanny X-Men (1963) #10": "When a trip to the South Pole yields a jungle adventure, the X-Men meet Ka-Zar, lord of the Savage Land!", "Uncanny X-Men (1963) #9": "Where the lethal Lucifer lurks, he must face...the Avengers! But defeating him could destroy the world, so the X-Men must defeat the Avengers instead!", "Uncanny X-Men (1963) #8": "Fed up with ungrateful homo sapiens, the Beast leaves the X-Men to enter the wrestling ring! Too bad he finds Unus the Untouchable waiting to knock him down without lifting a finger!", "Uncanny X-Men (1963) #7": "The Blob joins the Brotherhood! He's fighting mad at the X-Men, but can he and Magneto even count on each other?", "Uncanny X-Men (1963) #6": "The X-Men and Brotherhood are evenly matched, and both teams think Namor the Sub-Mariner can turn the tide in their favor! Too bad no one told them that in the war between good and evil, Namor's just as likely to fight both sides!", "Uncanny X-Men (1963) #5": "Abducted to Asteroid M! Magneto's got an X-Man in his clutches and a team of underlings waiting for the rescue party!", "Uncanny X-Men (1963) #4": "Magneto's back, and he's not alone! The X-Men and the Brotherhood of Evil Mutants battle for the first time!", "Uncanny X-Men (1963) #3": "Introducing the Blob! The X-Men's first try for a new recruit turns the mansion into a circus!", "Uncanny X-Men (1963) #2": "How can the X-Men catch an enemy who can be anywhere they aren't? Trouble appears when the Vanisher's on the loose!", "Uncanny X-Men (1963) #1": "The master of magnetism has taken over a missile base, and only the strangest teens of all time stand between him and victory! It's the X-Men's first day of class, and Magneto wants to make it a memorable one - and their last!"}