{"Storm (2006)": "The epic, untold love story between Marvel's two pre-eminent Black super heroes -- Storm and the Black Panther -- is finally told, as only New York Times best-selling author Eric Jerome Dickey can do it!  An orphaned street urchin, living by her wits on the unforgiving plains of Africa as she struggles to harness her slowly-developing mutant powers...A warrior Prince, embarking on his rite of passage as he ponders the great responsibility in his future...And a crew of ruthless mercenaries who'll stop at nothing to capture an elusive creature of legend -- the fabled wind-rider.  What sparks occur when their paths intersect?  Don't miss out on this story, True Believer, as it builds to a July Event that will shake the entire Marvel Universe.\r<br>\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>", "X-Men: Days of Future Past (Trade Paperback)": "\"Re-live the legendary first journey into the dystopian future of 2013 - where Sentinels stalk the Earth, and the X-Men are humanity's only hope...until they die! Also featuring the first appearance of Alpha Flight, the return of the Wendigo, the history of the X-Men from Cyclops himself...and a demon for Christmas!? \"", "X-Men Red Vol. 2: Waging Peace (Trade Paperback)": "Collects X-Men: Red #6-11. The adventures of the newly resurrected Jean Grey and her handpicked team continue! One of the X-Men’s greatest foes has come calling on Namor’s undersea kingdom of Atlantis, and they’re determined to bring about its end! Jean Grey and the Red team find themselves out of their element and under the sea as they must repel a devastating attack! Plus: The world grows more hostile toward mutants every day, and one of the X-Men’s fiercest foes is working behind the scenes to keep it that way! But Jean has had enough of the hateful world she was reborn into, and it’s time for her to confront the one responsible head-on. Prepare for a seismic showdown between Jean Grey and Cassandra Nova!", "X-Men: Red (2018) #11": "The X-Men have battled valiantly against their powerful psychic foe, Cassandra Nova, since the moment she framed Jean Grey for murder on the world stage. They have been hunted. They have been hated. And now…they can fight no more.", "X-Men Classic: The Complete Collection Vol. 1 (Trade Paperback)": "Collects Classic X-Men #1-23. In 1986, Marvel launched CLASSIC X-MEN, a series that reprinted the “All-New, All-Different X-Men” era — with a twist! All-new backup stories fleshed out the 1970s tales and delved deeper into the characters’ lives — and new story pages were even inserted into the reprints, expanding on key moments and sowing the seeds for future storylines! Now, all this newly created material has been collected together — complete with comparisons and text pieces explaining what was changed, what was added and why! Friendships are forged, allies are mourned and lives are transformed in these rare tales that dance between the raindrops of some of the most revered X-Men comics of all time!", "X-Men: Red (2018) #9": " Following the shocking events of X-MEN RED #8, it’s time for Jean to finally confront her demon head-on. Jean Grey and Cassandra Nova... The showdown begins here! ", "X-Men: Gold (2017) #35": "The X-Men versus the undead! Goddess versus god! Storm’s final battle?", "X-Men: Red (2018) #7": "Attack on Atlantis! One of the X-Men’s greatest foes comes calling on the undersea kingdom, determined to bring about their end!", "X-Men: Gold (2017) #34": "Storm must battle a mysterious figure from her past! But with the true nature of Stormcaster revealed, can Storm trust her powers anymore?", "X-Men: Gold (2017) #33": "Storm returns to the Kenyan village that once worshipped her as a goddess! But now, with her Stormcaster hammer, it’s true…isn’t it? The truth about Storm’s Asgardian hammer is revealed here!", "X-Men: Wakanda Forever (2018) #1": "Former Dora Milaje member and eternal troublemaker Nakia, A.K.A. Malice, has set a trap to lure the Black Panther into her obsessive clutches! Step One: Take out the Panther’s one true love, Storm of the X-Men! But Nakia didn’t count on the interference of her former warriors-in-arms, the fierce Dora Milaje — and they’re hot on her trail. Can Okoye, Ayo and Aneka capture Malice before she wreaks havoc on their king’s life — again? The talented Ray-Anthony Height joins best-selling author Nnedi Okorafor for the second installment of WAKANDA FOREVER!", "X-Men: Red (2018) #6": "From deep beneath the ocean, Jean Grey’s X-Men watch as waves of anti-mutant hatred wash over the world! Can the X-Men quell the tide? Or will they be swept away in its wake?", "X-Men: Gold (2017) #32": "You may have known her as Rachel Grey…as Phoenix…as Prestige…but all of that is over. Only THE HOUND remains! And you better pray she hasn’t caught your scent! A seismic shift in status quo for one of X-MEN GOLD’s charter members starts here!", "X-Men: Gold (2017) #31": "X-HONEYMOON! The cake’s been cut, the band’s gone home, and the biggest X-Wedding in history is finally a done deal! I’m not crying, you’re crying! And so is one of the X-Men! And those aren’t tears of joy: You won’t believe which X-Man calls it quits!", "Hunt for Wolverine: Mystery in Madripoor (2018) #2": "ONE X-MAN DOWN, FIVE TO GO! The new Femme Fatales claim their first victim (but not their last)! What is Magneto’s connection to Logan’s disappearance? Can Storm, Kitty, Domino and Jubilee survive when the whole city is hunting them?", "X-Men: Red (2018) #5": "MUTANT HATE IS AT AN ALL-TIME HIGH…and Jean Grey is caught right in the middle! CASSANDRA NOVA’s plan is finally revealed….but to devastating consequences. And just because JEAN GREY’s team finally knows what’s going on, doesn’t mean they can actually stop it. Someone close to Jean is about to become Nova’s latest pawn…but who? And why?", "X-Men: Gold (2017) #29": "Escape from OUTER SPACE! KITTY and the X-MEN must race to safety or die in the cold vacuum of space! The only obstacles in their way? Human supremacist LYDIA NANCE and the nanite-based AI SENTINEL 0101! Get ready for a fatal confrontation with the GOLD team’s newest nemesis!", "X-Men: Gold (2017) #28": "THE COUNTDOWN TO THE MUTANT WEDDING OF THE CENTURY! Everything is going wrong. The X-Men are under attack from all sides…and there’s still a wedding to plan!", "X-Men: Red (2018) #4": "JEAN GREY and her team of X-Men are trying to save the world…but one mutant could spoil that for everyone. When an old friend of Jean’s is corrupted and turned against her, will Jean have to do the unthinkable?", "Rise of the Black Panther (2018) #5": "WINDS OF CHANGE BLOW THROUGH WAKANDA! Just as Wakanda comes onto the global stage, enemies close by make their move! The Hyena Clan is out to exploit the country’s vast technology — and with a new king on the throne, it’s a perfect time to strike. Assaulted on all fronts, T’Challa seeks out a love he left behind: Ororo Munroe, soon-to-be Storm of the X-Men. A missing chapter of the Black Panther and Storm’s lifelong romance comes to light! And it’s a triple threat as a traitor gathers forces. What is Project Koukou — and who is behind it?!", "X-Men: Gold (2017) #27": "LYDIA NANCE, the anti-mutant lobbyist, and 0101, the most advanced Sentinel on the planet, have found each other. Their goal? Kill the X-Men — starting with COLOSSUS.", "X-Men: Gold (2017) #26": "THE COUNTDOWN TO THE MUTANT WEDDING OF THE CENTURY! It all begins here! But WHO is tying the knot? And can I bring a plus-one? Also: The X-MEN in their final confrontation with an old foe, a fight that ends up costing RACHEL everything. Plus…The evil alliance you never expected.", "Black Panther (2016) #172": "Klaw and his allies have brought Wakanda to the brink of destruction. To seal the deal, Klaw has summoned a powerful Marvel foe not seen in years. But Black Panther isn’t done fighting yet. He still has a secret weapon: his ex-wife.", "X-Men: Gold (2017) #24": "The NEW X-MEN GOLD are doing their best to protect people from the likes of The Shredded Man and other baddies...but pretty soon a threat bigger than they can imagine will be on their doorstep. Something has survived the Negative Zone, and it wants revenge.", "X-Men: Gold (2017) #23": "Kitty and her X-Men team are in prison! While they’re away, who will protect the people of NYC? Read on, true believer, to meet the new X-Men Gold!", "Black Panther (2016) #170": "With Storm back by his side, T'Challa finally confronts Ras the Exhorter, the mysterious villain summoning dark creatures to Wakanda. But what the Black Panther learns will shake all he believes. Who IS Ras The Exhorter? And what is his connection to T'Challa's old foes? And to celebrate the release of Marvel Studios' BLACK PANTHER movie, this issue includes an exclusive interview with the film's director, Ryan Coogler, and Ta-Nehisi Coates!", "X-Men: Gold (2017) #21": "The BROTHERHOOD OF EVIL MUTANTS is back and more deadly than ever! What is happening to RACHEL SUMMERS? Plus: The GOLD team bids farewell to one of their own. Who will it be?", "X-Men: Gold (2017) #20": "THE NEGATIVE ZONE WAR Part 5. The X-Men’s victory against the might of Scythian has come at a cost…which might kill them all! How can the X-Men survive on a barren planet? You DO NOT want to miss the status quo-altering final page!", "X-Men: Gold (2017) #18": "The DARTAYUS ODYSSEY Part 3 Trapped! The X-Men’s resident fuzzy blue elf Nightcrawler is a prisoner to the Dartayan Empire, and Rachel Grey may never see her new beau ever again!", "X-Men: Gold (2017) #17": "The DARTAYUS ODYSSEY Part 2! After alien invaders attack Manhattan, the X-Men must take the fight to the NEGATIVE ZONE! But what does the mysterious KOLOGOTH have planned next?", "X-Men: Gold (2017) #16": "THE NEGATIVE ZONE WAR Part 1. Invaders from deep within THE NEGATIVE ZONE have come to reclaim one of their own... And they’re taking one of THE X-MEN with them!", "X-Men: Gold (2017) #12": "While on a mission to apprehend the latest incarnation of the Brotherhood of Evil Mutants, the X-Men discovered a villain amongst their number who was a complete mystery. Little did they know, the alien KLEEVUS was on a mission of his own! Now, they're on the verge of discovering Kleevus' true nature - but will it be too late?", "Black Panther (2016) #17": "FOREVER MY LADY! T'Challa's got royalty in his DNA, but does he have the loyalty of a goddess in his corner? Ororo Munroe, also known as Storm of the X-Men and former queen of Wakanda, is back in T'Challa's life. But is it for good this time? Or will country come between a man and his queen again?", "Black Panther and the Crew (2017) #6": "Black Panther and the Crew finally crack the case surrounding the mysterious death of Harlem community pillar Ezra Keith! In the wake of Ezra's life one thing is certain: the world needs the Crew now more than ever!", "Black Panther and the Crew (2017) #5": "The teleporting hero known as MANIFOLD joins The Crew in their search for answers about the mysterious death of Harlem community pillar Ezra Keith -- and what they learn is not only shocking but devastating! It seems an old evil has infiltrated the very heart of Harlem, and if it's not rooted out, the community will be brought to its knees.", "X-Men: Gold (2017) #8": "SECRET EMPIRE TIE-IN! The Xavier Institute is on lockdown. But the X-Men haven't succeeded in keeping danger out. Instead, they've just locked themselves inside with it. Can the X-Men stop the all-new X-CUTIONER before he claims any more of their number?", "X-Men: Gold (2017) #7": "SECRET EMPIRE TIE-IN! When Manhattan is besieged, the X-Men open their doors and repurpose their school as a safe haven for any human or mutant in need of sanctuary. But little do they know that one of the humans they've welcomed in is the all-new X-CUTIONER! And he's about to make the Xavier Institute the last place mutants want to be…", "X-Men: Gold (2017) #5": "Each new generation of Sentinel has been DEADLIER than its predecessors…and 0101 is no exception to that rule! As the X-Men race to stop the perfect mutant-killing machine from executing its programming, they'll find themselves asking one question: Are they the hunters…or the hunted?", "Black Panther and the Crew (2017) #2": "STORM COMES TO HARLEM! Misty Knight continues investigating how and why Ezra Keith, a Harlem community pillar and civil rights activist, died in police custody, now with the help of one of Ezra’s former protégés, STORM of the X-Men. The two women soon discover that the neighborhood is under siege by a threat much bigger than they’d imagined…Luckily, help arrives in the form of a friend from Storm’s past.", "Moon Girl and Devil Dinosaur (2015) #17": "WELCOME TO THE X-MEN, LUNELLA LAFAYETTE! Storm and her extraordinary X-Men come to Yancy Street — hope they survive the experience! Lunella Lafayette, a.k.a. Moon Girl, is finally getting the attention she deserves as the smartest in the world…but not all of it’s good, especially when it comes from Victor Von Doom!", "Extraordinary X-Men (2015) #20": "Storm once referred to JEAN GREY as the heart of the X-Men, and she was ultimately the catalyst for bringing this team of X-Men together. But in the aftermath of their war with the Inhumans, the X-Men’s resolve is faltering…and Jean Grey is doubting her place with them. The X-MEN may have survived the war…but at what cost?", "Extraordinary X-Men Vol. 3: Kingdoms Fall (Trade Paperback)": "An ancient evil stirs in the periphery of Limbo, consuming mystical realms, and little does Magik suspect that the X-Men's newest charge is drawing it straight to X-Haven! Meanwhile, Colossus is rampaging across Earth...as a Horseman of Apocalypse. Can Nightcrawler and Iceman stop their longtime friend and teammate and wrest him from Apocalypse's grasp? COLLECTING: EXTRAORDINARY X-MEN (2016) #13-16, Annual.", "Marvel Masterworks: The Uncanny X-Men Vol. 10 (Hardcover)": "John Romita Jr. joins Chris Claremont as the Uncanny X-Men’s chart-topping adventures continue! Drama abounds as Cyclops heads off on his honeymoon with Madelyne Pryor, Wolverine’s relationship with Mariko takes a turn for the worse and Kitty Pryde is kidnapped and forced to marry the Morlock Caliban. Meanwhile, Rogue is Public Enemy No. 1, and anti-mutant sentiment threatens the passage of a law that will strip all mutants in the United States of their rights. There’s no shortage of action, either: Colossus battles Juggernaut, Mystique and the Brotherhood of Evil Mutants return and Rachel Summers arrives on the scene! Topped off by Claremont and Barry Windsor-Smith’s stunning classic story “Lifedeath” and the Magik limited series, there’s no shortage of mutant masterworks! Collecting UNCANNY X-MEN (1981) #176-188, MAGIK (1983) #1-4 and material from MARVEL FANFARE (1982) #40.", "Extraordinary X-Men (2015) #18": "INHUMANS VS. X-MEN TIE-IN! The X-MEN have waged war on the INHUMANS! And the X-Men’s resident genius, FORGE, has just been dispatched on a mission crucial to not just the X-Men’s success, but their survival. But will Forge’s unrequited love for Storm drive him to start a war of his own when he’s partnered with the X-Man receiving her affections — OLD MAN LOGAN?", "Extraordinary X-Men (2015) #17": "INHUMANS VS. X-MEN TIE-IN! The X-Men have just learned that the Terrigen Mist—the source of the Inhumans’ powers that through a cruel twist of fate is lethal to Mutants—has reached an irreversible saturation point, rendering Earth uninhabitable to their kind.  And now they see no other option than to strike against the Inhumans to ensure their own survival. But one X-Man doesn’t take the decision lightly. STORM has literally led the X-Men through hell and back, but will she lead them against their longtime friends and allies?", "Extraordinary X-Men (2015) #16": "THE EPIC CONCLUSION OF “KINGDOMS FALL”! Magik’s protégé, Sapna, has become possessed by THE WORLD-EATER, an extradimensional entity whose sole purpose is to live up to its name. And Magik’s brother, Colossus, is under the thrall of one of the X-Men’s greatest adversaries, APOCALYPSE. As the World-Eater bears down on Limbo, everything Magik cares about is on the line – her ward, her brother and the world’s surviving mutants. What will it cost to save them all?", "Black Panther (2016) #8": "VOYAGE INTO THE DJALIA T’Challa’s research and technology takes him to a place that not even THE CREW can follow: THE DJALIA, Wakanda’s collective memory. Just getting there was hard, but finding SHURI across their nation’s past, present and future might turn out to be impossible. Even so, the strain on his Soul-Stalker abilities might tear him apart before he gets very far…", "Extraordinary X-Men (2015) #15": "The X-Men’s newest charge has become possessed by THE WORLD-EATER, an extradimensional entity whose sole purpose is to live up to its name. And it has its sights set on LIMBO next! Can Storm and Magik prevent it from reaching mutantkind’s last refuge? Meanwhile, Iceman and Nightcrawler learn that saving Colossus from the clutches of Apocalypse comes at a price!", "Black Panther (2016) #7": "“THE CREW” STARTS NOW!\nWith no one left to trust, T’Challa leans on his day ones: Luke Cage. Misty Knight. Storm. But Wakanda may be too far gone for this all-new, all different CREW...", "Extraordinary X-Men Annual (2016) #1": "NEW STORY ARC STARTS NOW! When the Terrigen Cloud threatens to wash over a prison and the warden refuses to protect its mutant inmates, the Extraordinary X-Men take matters into their own hands…and stage a PRISON BREAK! And when Moon Girl takes it upon herself to solve the Terrigen crisis, she may just find an unlikely ally…", "Extraordinary X-Men (2015) #13": "“KINGDOMS FALL”STARTS NOW! An ancient evil stirs in the periphery of Limbo, consuming mystical realms…and little does Magik suspect that the X-Men’s newest charge is drawing it straight to X-Haven! Meanwhile, Colossus is rampaging across Earth…as a Horseman of Apocalypse. Can Nightcrawler and Iceman stop their longtime friend and teammate and wrest him from Apocalypse’s grasp?", "Uncanny X-Men (2013) #28": "- Because YOU demanded it-the return of MAGNETO! - You might be happy about it-but the X-Men sure aren't! - Cyclops beware!", "Uncanny X-Men (2013) #13": "X-MEN: BATTLE OF THE ATOM, PART 8!\r\n\r\n\r\n\r\n<ul><li>Wolverine, who just lost his healing factor, takes a mortal hit!</li><li>And a surprise ending that changes everything in the X-Men Event of 2013!</li></ul>", "Uncanny X-Men (2013) #12": "BATTLE OF THE ATOM PART 4!\n- The Uncanny X-Men enter the crossover. Whose side will they be on?", "Astonishing X-Men (2004) #67": "- Wolverine and Gambit - on the road - in a stolen Lamborghini...\n...With an alien stuffed in the teeny tiny trunk - and more aliens tailing them.\n- What could possibly go wrong?", "Wolverine (2013) #9": "<ul><li>Wolverine takes a road trip into the valley of death with Kitty Pryde!</li><li>But there&#39;s a hefty bounty on Logan&#39;s head, and every villain and mercenary is popping out of the woodwork to try to take him down.</li><li>First up: Batroc the Leaper!</li></ul>", "Astonishing X-Men (2004) #66": "- In the aftermath of Iceman's assault on the world, the X-Men need some time to breathe and reflect, and take stock of their relationships.\n- What will come from this?\n- And will it send one character down a new path away from the X-Men?", "Wolverine (2013) #8": "PART ONE OF KILLABLE!\r\n\r\n\r\n\r\n\r\n<ul><li>It all starts here, the biggest Wolverine event in years!</li><li>Wolverine thinks a cure has been found&hellip;but it&#39;s in Wakanda, where he&#39;s not exactly a welcome guest!</li><li>Meanwhile, Nick Fury and S.H.I.E.L.D. are working on even bigger problems that Wolverine might have caused.</li><li>Guest-starring Storm and Black Panther!</li></ul>", "Wolverine (2013) #7": "<ul><li>After the events of Wolverine #6, Logan must adjust to a very different kind of life.</li><li>How will his friends and rivals respond to his new status quo?</li><li>Guest-starring Storm and Beast!</li></ul>", "Uncanny X-Force (2013) #6": "- Secrets from the future and the past come to haunt Uncanny X-Force!\n- What does Fantomex want from Betsy?\n- What does Betsy want from Cluster?\n- What does Cluster want from Fantomex?\n- What does Bishop want from the 21st century? A body count or a good burger?\n- And Los Angeles, lock up your humans: there's a new mutant on the loose!", "Uncanny X-Force (2013) #5": "<ul><li>Guest-penciler ADRIAN ALPHONA (co-creator of RUNAWAYS) joins UXF!</li><li>Psylocke digs deep into Bishop&rsquo;s head and what she finds will shock you!</li><li>One of the biggest X-Villains of the past 20 years threatens the Uncanny X-Force!</li></ul>", "Uncanny X-Force (2013) #4": "<ul><li>The first arc comes to a crazy climactic end!</li><li>What have Fantomex and Cluster been up to while Bishop has been killing the rest of X-Force?</li></ul>", "Uncanny X-Force (2013) #3": "<ul><li>This is it! Bishop vs. UNCANNY X-FORCE!</li><li>Bishop has amazing new powers that help him take down X-Force. But how did Bishop get the new power?</li></ul>", "X-Men Legacy (2012) #6": "<ul><li>The groundbreaking first arc of X-MEN: LEGACY ends here!</li><li>Discovering a plot to assassinate one of the X-Men that he inadvertently put into motion, Legion infiltrates the Jean Grey School for Higher Learning&hellip;but after their last run-in, will the X-Men accept his help?</li><li>Meanwhile, Legion learns that the demon lurking in the depths of his psyche has a familiar face&hellip;</li></ul>", "Uncanny X-Force (2013) #2": "Bishop vs. Uncanny X-Force! What secrets does the man with the \"M\" on his face bring from the future?", "X-Men (2010) #41": "<ul><li>FINAL ISSUE!</li><li>At the end of an era, Storm puts a team together to search for the start of the next.</li><li>In the field, will Angel challenge her for leadership?</li></ul>", "X-Men Legacy (2012) #5": "<ul><li>LEGION vs. THE X-MEN!</li><li>Two new villains begin plotting Legion&rsquo;s demise. And little does he know, one of them is lurking within his own psyche, and the other is now hiding amongst the X-Men themselves&hellip;</li></ul>", "Uncanny X-Force (2013) #1": "Psylocke and Storm lead a new team of outcasts and scoundrels, including fan-favorite Puck, the villainous Spiral, and the mysterious Cluster. Their first adversary? X-legend Bishop!", "X-Men (2010) #40": "The end of an era of X-Men! What happens to a team when they lose the trust that binds them?", "X-Men Legacy (2012) #4": "<ul><li>LEGION vs. THE X-MEN!</li><li>Two new villains begin plotting Legion&rsquo;s demise. And little does he know, one of them is lurking within his own psyche, and the other is now hiding amongst the X-Men themselves&hellip;</li></ul>", "A+X (2012) #3": "Chris Bachalo writes and draws a teamup of two of the biggest Marvel movie ladies \nBLACK WIDOW AND ROGUE VS. SENTINELS!\nJames Asmus and Billy Tan bring together the stars of the two biggest new Marvel series \nGAMBIT AND HAWKEYE SAVE LIVES!", "Wolverine & the X-Men (2011) #20": "Storm joins the faculty of the Jean Grey School! But why is Wolverine a clown, Iceman a fire swallower, and Rachel Grey a fortune teller?", "X-Men (2010) #37": "<ul><li>Meet the last living Proto-Mutant!</li><li>The Storm-Cyclops divide widens as the team starts to unravel</li><li>Colossus has his own agenda&hellip;will he leave the team to pursue it?</li></ul>", "X-Men (2010) #36": "* Jumping on point!\n* In the aftermath of the \"Mutant Scare\", Storm's leadership is called into question.\n* Will there be a new team-member - and what side are they really on?", "X-Men (2010) #35": "* The X-Men must make a choice...the destruction of a life, or the survival of a weapon.\n* Domino versus Psylocke!", "Uncanny X-Men (2011) #17": "<ul><li>The climactic end to the X-Men&rsquo;s greatest stand against Sinister!</li><li>The culmination of everything Sinister has planned since Uncanny #1!</li></ul>", "X-Men (2010) #34": "- The history of the Proto Mutants is revealed!\n- Mr. Grey makes his move against the X-Men...and it's not what any of them are expecting!\n- Colossus makes a decision that could endanger the entire team.\n- Storm's field agents are kidnapped and a weapon of the X-Men's making goes missing.", "X-Men (2010) #33": "<ul><li>The history of the Proto Mutants is revealed!</li><li>Mr. Grey makes his move against the X-Men&hellip;and it&rsquo;s not what any of them are expecting!</li><li>Colossus makes a decision that could endanger the entire team.</li><li>Storm&rsquo;s field agents are kidnapped and a weapon of the X-Men&rsquo;s making goes missing</li></ul>", "X-Men (2010) #32": "<ul><li> Learn the secret origin of the proto-mutants\n</li><li> How long can Storm keep Cyclops from taking control of her team?</li></ul>", "X-Men (2010) #31": "A new race of mutants is discovered!  How does this affect the X-Men as protectors of mutantkind?", "Astonishing X-Men (2004) #51": "The issue everyone has been talking about! The unforgettable wedding of Northstar and Kyle Jinadu! But will their path to wedded matrimony in New York City be smooth or are there hidden dangers around the corner?", "X-Men (2010) #30": "A new race of mutants has been discovered?  What does this mean for the X-Men?", "X-Men (2010) #29": "With the X-Men suffering from inner turmoil, a lost team of Skrulls infiltrates Utopia. As Pixie is discovered missing, the X-Men fear the worst.", "Avengers (2010) #25": "&bull; Avx Tie-In!\r\n&bull; Captain America Has Declared War On The X-Men.\r\n&bull; The Shocking Final Storyline In The Brian Bendis Avengers Saga!", "Avengers Vs. X-Men (2012) #2": "- As The Opening Shot Is Fired, The Avengers Storm The Beach Of Utopia, And The Phoenix Draws\nEver Nearer To Earth!\n- But Which Side Will Wolverine Fight On?\n- And What Choice Will Hope Make That Will Change The Direction And Scope Of The Conflict Dramatically?", "X-Men (2010) #27": "The Marvel Universe's deadliest assassins have been sent after The Forgiven and are trying to kill Jubilee! Guest starring Lady Bullseye, The Assasin's Guild, and Lord Deathstrike.", "Uncanny X-Men (2011) #10": "Unit, a genocidal fugitive from space, lands on Earth looking for the Mutant Messiah. The X-Men must take arms against the killer, but why is Hope placed in his sights?", "New Avengers (2010) #24": "AVX Tie-In!  The New Avengers have received the call to duty by Captain America to go to war against the X-Men.  Both an Avenger and an X-Man, Wolverine will be forced to choose a side.", "Uncanny X-Men (2011) #9": "Prison break! Featuring the Avengers!", "Uncanny X-Men (2011) #8": "Prison break! Featuring the Avengers!", "X-Men (2010) #26": "The X-Men fight to rescue Jubilee from the hands of her vampire brethren!", "X-Men (2010) #25": "The X-Men will stop at nothing to find Jubilee, even if they have to kill every vampire on Earth to do so!", "Fear Itself: The Fearless (2011) #9": "Valkyrie versus Storm over the streets of San Francisco! Plus, the secrets of the Valkyrior are revealed as Sin and Crossbones launch a vicious attack! Guest starring Captain America, Dr. Strange, and the Mighty Thor!", "Uncanny X-Men (2011) #7": "TABULA RASA PART 3 The secrets of the evolutionary jungle are revealed, as the X-Men face the Immortal Man, with the help of a brand new ally!", "X-Men (2010) #24": "&bull; Jubilee learns more about her vampire heritage.\r\n<br />&bull; Featuring Raizo and the Forgiven!", "Uncanny X-Men (2011) #6": "TABULA RASA PART 2 Cyclops and his team delve further into a world where evolution has run rampant. Plus, a new foe is revealed, who will show the X-Men just how out of date homo superior really are!", "Uncanny X-Men (2011) #5": "The X-Men investigate a new Marvel Universe area called Tabula Rasa!", "X-Men (2010) #23": "The fate of an oppressed people is in the hands of War Machine and the X-Men! Can they save the day with so many Sentinels blotting out the sky?", "Uncanny X-Men (2011) #4": "The Phalanx return to wreck havok for the Uncanny X-Men!", "Uncanny X-Men (2011) #3": "REGENESIS Mr. Sinister's tampering with the Golden Celestial has summoned the immortal Space Gods to Earth, to render judgment upon all mankind.", "X-Men (2010) #22": "REGENESIS No longer content to fend off attackers, the Governor and her army of Sentinels are hell-bent on going on the offensive, leading towards one of the worst ethnic cleansings in the history of the world.", "Astonishing X-Men (2004) #44": "Storm needs Cyclops' help with a special  mission, but it ends up being much more than they bargained for.", "X-Men (2010) #21": "SCHISM pushes the X-Men and War Machine towards conflict in Eastern Europe, as Sentinels are being traded on the black market. But things aren't as they seem and the X-Men and War Machine are going to have to work together to stop a truly horrible plot.", "Uncanny X-Men (2011) #1": "What is to become of the mutants who side with Cyclops after the big split? And what does it have to do with the resurrected Mister Sinister?", "X-Men (2010) #20 (Keown Variant)": "GUEST STARRING IRON MAN 2.0! The fallout of Schism pushes the X-Men and War Machine at each other in Eastern Europe as sentinels are being traded on the black market. But things aren't as they seem and the X-Men and War Machine are going to have to work together to stop a truly horrible plot.", "X-Men (2010) #20": "GUEST STARRING IRON MAN 2.0! The fallout of Schism pushes the X-Men and War Machine at each other in Eastern Europe as sentinels are being traded on the black market. But things aren't as they seem and the X-Men and War Machine are going to have to work together to stop a truly horrible plot.", "X-Men: Regenesis (2011) #1": "After SCHISM, who will the mutants follow - Cyclops or Wolverine? Setting the stage for WOLVERINE & THE X-MEN #1 and UNCANNY X-MEN #1 and the rest of the X-Men Universe!", "Herc (2010) #8": "SPIDER-ISLAND TIE IN Hercules finds himself infected with Spider-Powers of his own! Unfortunately, our web-slinging former demigod soon finds himself testing his new powers in a battle against the X-Men!", "X-Men (2010) #15.1": "START READING with this Point One Issue! GUEST-STARRING THE NEW GHOST-RIDER! When a medicine woman is at death's door, the demons she has been containing for decades are looking forward to their freedom. Good news... the X-Men are on the scene. Bad news...these demons are out of our mutant super heroes' league. It would be nice to have help from Ghost Rider, but is this new Spirit of Vengeance friend or foe? This is a perfect jumping- on point to the X-Men book in the middle of the Marvel Universe!", "Astonishing X-Men (2004) #40": "The Brood are terrorizing the X-Men again, but wiping out the terrifying parasitic aliens isn't an option as they are an endangered species. Also, Agent Brand has been infected!", "X-Men: Lifedeath (Hardcover)": "Visionary artist Barry Windsor-Smith takes on the Uncanny X-Men as Storm and Forge find themselves trapped on a primitive paradise world with no hope of escape! Spiral and Lady Deathstrike target Wolverine for death! And Dazzler is hunted by the Marauders, with only the X-Men to save her! Plus: The original X-Men go toe-to-toe against Blastaar, deadly menace from the Negative Zone, in Windsor-Smith first Marvel Masterwork! Collecting UNCANNY X-MEN #53, #186, #198, #205 and #214.", "Black Panther: The Man Without Fear (2010) #520": "PANTHER + STORM + KRAVEN THE HUNTER = \"STORM HUNTER\" PARTS 1 & 2! From the rooftops to the subway tunnels, why is Spider-Man's deadly foe stalking T'Challa across the city...and how long until the prey targets the pursuer? Plus: will the world's greatest predators have anywhere to hide when Ororo arrives and rips the skies open? It's the first meeting of husband and wife since the Panther's new status quo...in the two-part thriller that will show why IGN.com says this series is \"the gritty, violent action romp the character needed.\" ", "Uncanny X-Men (1963) #538": "Blood has been shed on the island of Utopia as Powerlord Kruun's Night of the Knives draws to a close. Who has perished? Who has survived? Discover the answers as vengeance rears its ugly, alien head!", "X-Men (2010) #13 (Medina Variant)": "\"FIRST TO LAST\"! Who are the Evolutionaries and why doesn't anyone remember when they fought Xavier and his original five X-Men? Cyclops and his crew on Utopia better figure out quick or the Evolutionaries are going to wipe out every human on the planet. That's right, every HUMAN. Two issues of this huge story this month both showing X-Men/Evolutionary actionin the past and in the present. And it's all thanks to Christopher Yost (X-FORCE), amazing regular artist Paco Medina and the always classic Dalibor Talijic (HITMONKEY)! Parts 2 and 3 (of 5)", "X-Men (2010) #13": "FIRST TO LAST With the battle between the X-Men and the Evolutionaries just beginning, the truth behind the origins of the new group of villains begins to unravel. How are these two super groups connected?", "X-Men: Great Power (2011) #1": "Collecting X-MEN #7-9", "X-Men (2010) #12": "FIRST TO LAST Who are the Evolutionaries? With Cyclops and his Utopia team being the only thing standing between the Evolutionaries' plan to kill every human on Earth, the team must quickly dispatch their very familiar enemies.", "X-Men (2010) #12 (Medina Variant)": "\"FIRST TO LAST\"! Who are the Evolutionaries and why doesn't anyone remember when they fought Xavier and his original five X-Men? Cyclops and his crew on Utopia better figure out quick or the Evolutionaries are going to wipe out every human on the planet. That's right, every HUMAN. Two issues of this huge story this month both showing X-Men/Evolutionary actionin the past and in the present. And it's all thanks to Christopher Yost (X-FORCE), amazing regular artist Paco Medina and the always classic Dalibor Talijic (HITMONKEY)! Parts 2 and 3 (of 5)", "Astonishing X-Men (2004) #38": "Cyclops, Emma, Wolverine and Armor are off in Japan dealing with giant monsters. Meanwhile, something dire happens that demands the attention of the X-Men. Storm, Colossus and Kitty Pryde join Beast and Agent Brand to take on the Brood.", "X-Men Giant-Size (2011) #1 (Medina Variant)": "\"FROM FIRST TO LAST\" Think you know everything there is to know about the original X-Men? Think again! Something happened to Cyclops, Marvel Girl, Beast, Angel, Iceman and Professor X years ago, a secret so horrible that it has been locked away in the dark corner of Cyclops' mind until today. What crisis strikes in the present that calls upon memories of the past? Witness the astonishing debut of the Evolutionaries! Taking the lead for a few issues is famed X-Men writer CHRIS YOST (X-FORCE) and with all this danger, he's lucky to have  regular X-MEN artist PACO MEDINA and DALIBOR TALAJIC (PUNISHER) along for the ride.", "X-Men Giant-Size (2011) #1": "FROM FIRST TO LAST The truth behind the origins of the Evolutionaries is finally unlocked from the darkest recesses of Cyclops' mind! Discover an old crisis so horrible that Cyclops will wish the past stayed buried!", "X-Men Giant-Size (2011) #1 (Blank Cover Variant)": "\"FROM FIRST TO LAST\" Think you know everything there is to know about the original X-Men? Think again! Something happened to Cyclops, Marvel Girl, Beast, Angel, Iceman and Professor X years ago, a secret so horrible that it has been locked away in the dark corner of Cyclops' mind until today. What crisis strikes in the present that calls upon memories of the past? Witness the astonishing debut of the Evolutionaries! Taking the lead for a few issues is famed X-Men writer CHRIS YOST (X-FORCE) and with all this danger, he's lucky to have  regular X-MEN artist PACO MEDINA and DALIBOR TALAJIC (PUNISHER) along for the ride.", "Fear Itself (2010) #1 (2nd Printing Variant)": "DO YOU FEAR...TOMORROW? In this time of global anxiety, of economic turmoil and mass hysteria, Sin, the new Red Skull, has made an awesome discovery...a shameful secret that will rock the foundations of the Marvel Universe! A revelation that will divide father and son, turn friend against friend, and herald the rise of Fear personified. HE IS RETURNING...and the world has nothing to fear but FEAR ITSELF. Matt Fraction and Stuart Immonen bring fans the biggest Marvel the biggest Marvel event since CIVIL WAR!", "X-Men Giant-Size (2011) #1 (Ff 50th Anniversary Variant)": "\"FROM FIRST TO LAST\" Think you know everything there is to know about the original X-Men? Think again! Something happened to Cyclops, Marvel Girl, Beast, Angel, Iceman and Professor X years ago, a secret so horrible that it has been locked away in the dark corner of Cyclops' mind until today. What crisis strikes in the present that calls upon memories of the past? Witness the astonishing debut of the Evolutionaries! Taking the lead for a few issues is famed X-Men writer CHRIS YOST (X-FORCE) and with all this danger, he's lucky to have  regular X-MEN artist PACO MEDINA and DALIBOR TALAJIC (PUNISHER) along for the ride.", "DOOMWAR TPB (Trade Paperback)": "Wakanda! The royal family of Wakanda - former Black Panther and King T'Challa, X-Man Queen Storm and the current Black Panther, Princess Shuri - is unseated by a group of conservative dissidents in a coup funded and organized by the nefarious Dr. Doom! Having unlocked the mystical properties of the rare and precious metal Vibranium, Doom's political maneuvering gains him access to the world's largest store of the metal and the source of unlimited magical power. The royal family will require the help of Marvel's best - the X-Men, the Fantastic Four and the always-ready-for-action Deadpool - to stop Doom before he unlocks the power to rule the world! Collecting DOOMWAR #1-6.", "X-Men Legacy (2008) #247": "\"AGE OF X\" CHAPTER 5! In the Age Of X, there are no X-Men. There are no heroes to stand in the way of the anti-mutant aggression that has run rampant for years. And when the world's most dangerous mutant is set loose in this Age, everything will come crashing down.", "Wolverine (2010) #7 (CAPTAIN AMERICA 70TH ANNIVERSARY VARIANT)": "WOLVERINE VS. THE X-MEN CONTINUES! On the outside, an enraged Logan is fighting for his life against the combined might of both Namor and Magneto, while on the inside he's battling to stop a horde of demons from burning him out of his own mind. And now some of his closest friends, including Storm, Rogue and Kitty Pryde, look to stage the most improbable of rescue missions. Powerhouses JASON AARON and DANIEL ACUà'A tear it up as Wolverine's battle against his literal demons rages on!", "X-Men Origins II (Hardcover)": "The X-Men's secrets revealed! Experience the origin of the X-Men's leader as you follow Cyclops from his childhood through his joining of the X-Men. Relive Nightcrawler's early days as a trapeze artist in Germany, the first time he teleported and the events that made him the hero he is today! See the small-town beginnings that helped forge Iceman, the coolest mutant of them all! Witness Emma Frost's rise from a mousy girl from a wealthy New England family to the rich and terrifying queen of a secret society to the leader of the X-Men! Plus: DEADPOOL: THE MAJOR MOTION PICTURE! You may have heard there's a Deadpool movie in the works. Wade Wilson's heard the same thing, and he's determined to tell his own story before Hollywood screws it up! Collecting X-MEN ORIGINS: CYCLOPS, NIGHTCRAWLER, ICEMAN, EMMA FROST and DEADPOOL - plus bonus material from GIANT-SIZE X-MEN #1 and X-MEN #131.", "X-Men Legacy (2008) #245": "\"AGE OF X\" PART ONE!\nIn a world where the X-Men never existed and mutantkind has been hunted to extinction, the few remaining mutants band together to make their last stand. Who are they? And just how far will they go to survive? The AGE OF X starts here!", "X-Men: Curse of the Mutants  (Hardcover)": "When a suicide bomber strikes in downtown San Francisco, it gets the X-Men's immediate attention. But this is not your garden variety terrorist, and he's not acting alone. Vampires from around the globe are descending en masse on the City by the Bay, staking a brutal claim for the patch of land the X-Men call their home. What is their agenda? Who is their mysterious leader? The X-Men are about to find out, as they brace themselves for a war of the species that will wrack the Marvel Universe. Collecting X-MEN #1-6, and material from X-MEN: CURSE OF THE MUTANTS SAGA and X-MEN: CURSE OF THE MUTANTS SPOTLIGHT.", "HULK VOL. 2: RED & GREEN TPB (Trade Paperback)": "There are now TWO HULKS in the Marvel Universe! One green and the other red. Double the action. Twice the aventure. And a million times more battles as both Hulks prove they are the strongest there is! Featuring guest appearances by Moon Knight, She-Hulk, the X-Men's Storm and the Avengers' Ms. Marvel and a bevy of Marvel's coolest characters - plus, the Gray Hulk! Collecting HULK #7-9 and KING-SIZE HULK #1. Rated A ...$15.99 ISBN: 978-0-7851-2884-7", "X-Men (2010) #7 (DJURDJEVIC GATEFOLD VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "X-Men (2010) #7": "PROTECT AND SERVE PART ONE Strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan?", "X-Men: To Serve and Protect (2010) #3": "Who are the mysterious X-Vigilante's and what is a big-time Spidey villain doing in San Francisco? Chris Yost's return to the X-Books continues here! Also, a visit from Thor to Wakanda ends up with Storm becoming a true Goddess of the Weather. EEP! All this and more!", "X-Men (2010) #7 (FF ANNIVERSARY VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "Age of X: Alpha (2010) #1": "Mutantkind's final war starts here. If you don't know which side you're on, check  your DNA.", "X-Men (2010) #7 (DODSON INKED VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "X-Men (2010) #7 (PREMIERE VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "X-Men (2010) #7 (BACHALO VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "X-Men (2010) #7 (BLANK COVER VARIANT)": "\"PROTECT AND SERVE,\" PART ONE It's a new age for the X-Men. Cyclops and company have declared it a time to be heroes. Wherever a citizen is in need, there's an X-Man on the job. But strange rumors have come to the attention of the X-Men, and Storm and her team are off to New York City to investigate. What do they find in the dank sewers beneath Manhattan? Only New York's favorite wall-crawler has the answers.", "X-Men Forever 2 (2010) #11": "She's lain claim to Wakanda...now Perfect Storm has her sights set on Genosha! And with Little 'Ro in her clutches, our mutant heroes are more vulnerable than ever to the wretched weather witch's wrath. But if anyone can stop the traitorous X-Man-turned-conqueror-it's the mysterious GHOST PANTHER! Is this the spirit of T'Challa come back for vengeance...or something far, far worse? Only X-Legend Chris Claremont has the answers!!! Rated A ...$3.99 (each)", "Uncanny X-Men (1963) #528": "THE FIVE LIGHTS PART 3 Idie Okonkwo is to be executed for the crime of witchcraft. But could her magic abilities actually be mutant powers?", "Astonishing X-Men (2004) #35": "EXOGENETIC PART CONCLUSION The X-Men finally come face to face with the man responsible for their troubles. And now he's preparing to unleash one more genetic nightmare upon the world before his time runs out.", "X-Men (2010) #1": "CURSE OF THE MUTANTS PART 1 Vampires from around the globe are descending en masse on the City by the Bay, staking a brutal claim for the patch of land the X-Men call their home. What is their agenda? Who is their mysterious leader?", "Astonishing X-Men (2004) #34": "EXOGENETIC PART 4 Someone is taking the X-Men's biggest threats and making them nightmares. As Cyclops and his team struggle to survive long enough to confront the one responsible, their tormentor has something even more horrible awaiting them!", "X-Men Legacy (2008) #237": "CHAPTER TWELVE X-Force cuts their way through a dangerous future trying to cut off Bastion's armies at the source. They better hurry as the X-Men in the present are falling left and right.", "X-Men Forever 2 (2010) #1": "CHRIS CLAREMONT CONTINUES HIS LANDMARK SERIES WITH A NEW STORY, A NEW TEAM, AND EVEN MORE TWISTS AND TURNS! With the drastic events from the end of Volume 1, the X-Men are shaken to their very core. As they start to pick up the pieces, they are confronted by a new enemy, more powerful than any other they've ever faced. With original series artist TOM GRUMMETT, these are two issues you", "Prelude to Deadpool Corps (2010) #2": "Enter the sexy-but-insecure Lady Deadpool! The devious-but-lovable Headpool ! The bratty-but-brilliant Kidpool! And the irascible mutt known as Dogpool! Individually, they're, well, kind of messed up, but together, they're the Deadpool Corps!\n", "Black Widow & the Marvel Girls (2009) #4": "The Black Widow is not normally a woman who involves herself in gang wars, but this one is a bit different. When an ousted Torino family lieutenant forms a new mob \"family\" and comes after his old family with a vengeance, leading a renegade mob of moloids and kidnapping a U.S. senator who's a personal friend of the X-Men known as Storm, it's up to the Black Widow to put an end to this mob war. And she has to do it all with a team comprised of herself, and Storm, and the world's number one expert on moloids...the Mole Man.\r\nRated A ...$2.99", "Astonishing X-Men (2004) #33": "EXOGENETIC PART 3 Dead mutants turned into biological weapons...genetically-reprogrammed Brood sleazoids...the truth about Abby Brand. It all adds up to an attempt to remove mutantcy from the planet Earth entirely and the rise of the Bio-Sentinels.", "Black Panther (2009) #11": "\"POWER,\" PART 5\r\nT'Challa prepares his Dora Milaje army to fight an unwinnable war, Storm battles an unstoppable and unnatural destructive force, and the new Black Panther wages war against an unbeatable foe: Prince Namor, the Sub-Mariner!  Guest-starring the Fantastic Four!\r\nRated T  ...$2.99", "Ms. Marvel Vol. 7: Dark Reign (Trade Paperback)": "It's the evolution of Ms. Marvel as the mantle passes from one heroine to the next! Carol Danvers has fought for years as Ms. Marvel, taking her inspiration and name from the Kree hero Mar-Vell, known to most of Earth as Captain Marvel. But with the former super villain Norman Osborn rising to power and taking control of the Avengers, Danvers is forbidden not only from wearing her costume but from even using the name Ms. Marvel. Complicating matters further, her powers have become unreliable and now cause her excruciating pain. Can she fight through the hurt to track down her old foe, Ghazi Rashid? Meanwhile, the devious Osborn has taken steps to replace Danvers, turning to none other than Dr. Karla Sofen - better known as the super villain-cum-Thunderbolt Moonstone! Collecting MS. MARVEL #35-41.\r\nRated T  ...$19.99\r\nISBN: 978-0-7851-3839-6", "Uncanny X-Men (1963) #517": "NATION X PART 3 Magneto's return has stunned the X-Men, but that's not the only surprise they're in for. A Predator X herd has arrived on Utopia, hungry for mutant flesh. Can the X-Men, still nursing their wounds from UTOPIA, deal with all this?", "Astonishing X-Men (2004) #32": "EXOGENETIC PART 2 The X-Men have fought many Sentinels but never quite like this. Never a Sentinel made of meat and bone, wearing the skin of one of their own deceased teammates. What could this monstrosity have to do with The Brood?", "X-Men Forever (2009) #9": "The thrilling conclusion to the X-Men's South American adventure! The X-Men take on this newest threat while still reeling from new stunning revelations! Plus: The funeral of Wolverine.", "Uncanny X-Men (1963) #516": "NATION X PART 2 He returns.", "Uncanny X-Men (1963) #515": "NATION X PART 1 A funeral for a friend. Tension between lovers. An old enemy arrives.", "Ms. Marvel Vol. 7: Dark Reign (Hardcover)": "A mass suicide by a branch of the Church of Hala has claimed the lives of twenty families. With Captain Marvel gone, Carol Danvers investigates this tragedy performed in his name, putting her directly in the path of would be Captain Marvel replacement: Noh Varr. Collecting MS. MARVEL #35-41.\r\nRated T  ...$24.99", "X-Men Forever (2009) #6": "The X-Men search for the team's infiltrator! Somehow, this is linked to the death of Wolverine, and an organization known as The Consortium. Meanwhile, something big has surfaced in South America-an enemy the battered X-Men will have to face head-on!", "Uncanny X-Men: First Class (2009) #2": "Nightcrawler thought he'd found sanctuary in Attilan  but now he's transgressed their most sacred law! Kurt stands trial before an angry mob, with Black Bolt the ultimate judge of his fate â€\" and if the verdict is guilty, he's one dead mutant! ", "X-Men Forever (2009) #5": "The team continues to track down someone they used to think was a teammate, but has now turned out to be an imposter! Somehow, this is all linked to the death of Wolverine, and a big, shadowy organization known only as \"The Consortium.\"", "Black Panther (2009) #7": "Wakanda has been attacked on every front.  Heroes have fallen, old alliances have been betrayed, the country is in turmoil.  Now is the time for the new Black Panther to rise and make a stand against threats both foreign and domestic.  \"Power\" is a bold new direction for the Panther, written by celebrated producer-director Reginald Hudlin and multiple Bram Stoker Award-winning author Jonathan Maberry (Patient Zero, PUNISHER: NAKED KILL).  New game, new rules, and lots of surprises as the new Black Panther is set on a collision course with one of the Marvel Universe's most feared and powerful beings. \r\nRated T  ...$2.99", "Ultimatum (2008) #5": "The Ultimate heroes have faced their final judgment. When the dust settles, will they be found wanting?\n", "X-Men Forever (2009) #4": "As the dust from the battle between the X-Men and their dangerous old foe-culminating in a brutal battle between Sabretooth and a particularly vicious Storm-all may not be as it appears... Plus, what secret is Kitty hiding up her sleeve?", "Black Panther (2009) #6": "It all comes down to this: The new Black Panther versus Morlun in a fight to the finish. Cover-to-cover action, with the fate of Wakanda, T'Challa and Storm hanging in the balance.", "Uncanny X-Men: First Class (2009) #1": "The early days of the X-Men are revealed! Professor X invites the mysterious Inhumans into the X-Men's home, but when Wolverine and Gorgon meet, the party turns ugly! Starring Cyclops, Storm, Banshee, Colossus, Nightcrawler, Wolverine and Phoenix! ", "X-Men Forever (2009) #3": "The X-Men are still reeling from the events of the previous issue; having just scraped through the Cortez mission by the skin of their teeth, the X-Men were completely unprepared for the surprise visit from one of their greatest nemeses, Sabretooth!", "X-Men Forever (2009) #2": "With Nick Fury-and the entire world-watching over the X-Men's shoulders, the stakes have never been higher for Cyclops, Jean Grey, Wolverine, Nightcrawler, Gambit, Rogue, Kitty Pryde, Storm, Beast, and Professor X.", "Astonishing X-Men (2004) #30": "GHOST BOX PART 6 Some boxes are best left unopened. The startling conclusion to GHOST BOX is here! The mysteries of the Ghost Box tech, the triploids, and Forge's treachery are solved! And the final showdown begins...", "Ms. Marvel Vol. 6: Ascension (Trade Paperback)": "Delve into the history of one of the Marvel Universe's greatest heroines! Carol Danvers has played many roles in her life: daughter, sister, Air Force intelligence agent and Avenger. Convinced she has not lived up to her potential, she is determined to become the best of the best. Though she has made great strides, Danvers knows she can be better. But before she can embrace her future as the world's greatest super hero, she must confront her past. Collecting MS. MARVEL #31-34, MS. MARVEL STORYTELLER and MS. MARVEL 2008 ANNUAL.\r\nRated T  ...$14.99\r\nISBN: 978-0-7851-3178-6", "Uncanny X-Men (1963) #511": "SISTERHOOD CONCLUSION The Sisterhood makes its final move against the X-Men.", "X-Men Forever (2009) #1": "Attempting to heal the rift between man and mutantkind, Professor Xavier volunteers his X-Men to go on a mission to capture Magneto's sole remaining Acolyte, Fabien Cortez!", "Black Panther (2009) #5": "Morlun, Devourer of Totems, is cutting through the Wakandan army like a hot knife through butter as he descends on the palace to feast on T'Challa's body. Absolutely nothing can stop him. Wakanda's only hope is the new Black Panther!", "Runaways (2008) #10": "When Runaway Molly Hayes responds to the X-Men's\r\npsychic invitation welcoming all mutants to a new home in San\r\nFrancisco, she declares it \"Moll-ifest Destiny\" and heads to the Headlands to investigate! But when she finds herself back-to-back with Wolverine, cornered by a villain with a vendetta, she might find being an X-Man isn't just secret clubhouses and cool-looking costumes...\r\nRated T  ...$3.99", "Uncanny X-Men (1963) #510": "SIEGE PART 3 The Sisterhood executes a massive raid on the Graymalkin Facility, taking their fight to the Uncanny X-Men, and you won't believe the ferocity!", "Black Panther (2009) #4": "Wakanda stands at the brink as an unstoppable force advances toward the gates of the city: Morlun is back, and he's here to feast on the Panther totem. Wakanda's only hope is the new Black Panther...if she's worthy to inherit the mantle.", "Uncanny X-Men (1963) #509": "SISTERHOOD PART 2 The X-Men perfect the delicate art of living as the Sisterhood plan their imminent demise. The Science Team gets to work, trying very hard not to kill one another first.", "Astonishing X-Men (2004) #29": "GHOST BOX PART 5 The X-Men have discovered that their former teammate Forge is responsible for the artificially-created mutants that they've been battling. They head to Wundagore Mountain to confront him...", "Hulk Vol. 2: Red & Green (Hardcover)": "When Bruce Banner sets out to find the Red Hulk he doesn't expect his search will lead him to Sin City, Nevada. And imagine his surprise when he arrives to discover the unbridled carnage a pack of Wendigos can unleash! Las Vegas buffets will never be the same! Plus: no matter what size, shape, color or sex, Hulks don't take kindly to being on the wrong side of a beating. Armed with an arsenal of advanced S.H.I.E.L.D. weaponry and itching for payback, She-Hulk's Lady Liberators have one goal: Subdue the Red Hulk, and make him pay in the process. All this plus a special KING-SIZE spectacular with MORE smashing, bashing, trashing, and clashing than should be allowed by law! Collecting HULK #7-9 and KING-SIZE HULK #1.\r<br>Rated A ...$19.99 \r<br>ISBN: 978-0-7851-2883-0\r<br>Trim size: standard\r<br>", "Uncanny X-Men (1963) #506": "LOVELORN PART 3 Emma has a bad dream. Peter finds horror in the Port of Oakland. The assembly of the Fringe Science Team makes a big discovery!", "X-Men Vs. Hulk (2009) #1": "You're Colossus, the steel-skinned X-Man who can dish out some serious hurt. So when Wolverine wants to take you down a peg or two, who's he gonna call? If you're thinking mean and green, you're on the right track...\r<br>Join X-Legend Chris Claremont for a tutorial in pain you won't forget!  Plus: a classic Claremont tale!\r<br>One-Shot/Rated A...$3.99\r<br>", "X-Men: Worlds Apart (2008) #4": "On one hand, her husband. On the other, her teammates. While Storm races to save the lives of the Black Panther and the X-Men, she recognizes a third option: take down the one responsible for making her choose in the first place. And to do it, she just might get some help from an unlikely source...\r<br>Rated T+ ...$3.99\r<br>", "Astonishing X-Men (2004) #28": "GHOST BOX PART 4 Upon arriving in Tian, China, the X-Men encounter a team of hostile mutants, mutants who have a connection to one of their own: former X-Man Forge!", "Wolverine by Claremont & Miller (Trade Paperback)": "The master of mutants joins the master of ninjas in Wolverine's first solo series ' replete with romance, intrigue and mayhem! Our beleaguered berserker's in Japan on a mission of the heart, if he can survive the Hand first! Plus: the introduction of everyone's favorite riotous ronin, Yukio! Collects WOLVERINE #1-4, plus UNCANNY X-MEN #172-173.\r\nRated T  '$16.99\r\nISBN: 978-0-7851-3724-5", "X-Men: Worlds Apart (2008) #3": "From the time she joined the X-Men, Storm has been called upon to fight mutants, aliens, demons and even gods...and she's triumphed. But how will she fare when she is forced to combat her own husband? It's the fight you've been waiting for: Storm, Queen of Wakanda, against the Black Panther! And with her kingdom and the lives of her teammates, the X-Men, on the line, Storm knows this is one fight she can't afford to lose...\r<br>Rated T+ ...$3.99\r<br>", "X-Men: The Complete Onslaught Epic Book 4 (Trade Paperback)": "The final onslaught is ON! Mutantdom's mightiest telepaths are forced to turn on one of their own, because Professor X's evil side won't stand for any more repression! The world's greatest hero teams gird for battle against one of their deadliest enemies, and when the smoke clears, not only will some of them not still be standing, they won't be there at all! The X-Men are left to take the blame for over a dozen dynamic disappearances, leading the man called Bastion to lay the groundwork for their NEXT crisis! But even if Onslaught is purged from this world, can a reborn world say the same? Guest appearances galore, plus step-by-step details on where the turning point of the 1990s began and ended! Collecting FANTASTIC FOUR #416, X-MEN #56, ONSLAUGHT: MARVEL UNIVERSE, CABLE #36, UNCANNY X-MEN #337, X-MEN #57, ONSLAUGHT: EPILOGUE, IRON MAN #6 & X-MEN: ROAD TO ONSLAUGHT.\r<br>Rated T+ ...$29.99\r<br>", "X-Men: Worlds Apart (2008) #2": "The game is set. The Black Panther, ruler of Wakanda, is being held captive and the military might of his entire kingdom\r<br>has been turned on the one person who could free him: his wife and queen, Storm. But if Storm chooses to fight her fellow Wakandans and rescue her husband, she does so at a cost: she may not be able to save her teammates, the X-Men, who are in similar peril halfway around the world. Writer Chris Yost (X-FORCE, NEW X-MEN) and up-and-coming artist DIOGENES NEVES pose the question: Does Storm stand by the Black Panther or the X-Men?\r<br>Rated T+ ...$3.99\r<br>", "Astonishing X-Men (2004) #27": "GHOST BOX PART 3 Upon study of the Ghost Box technology left behind at the Subject X murder scene, the X-Men uncover a conflict between artificially created mutants and mutants from another reality!", "X-Men: Worlds Apart (2008) #1": "Over the course of her life, STORM has been many things: A thief. A goddess. An X-Man. A Wife. A Queen.  But not until now have these roles come into conflict. When a mutant commits a mysterious murder in Wakanda, Storm takes it upon herself to investigate. And what she discovers will force her into a position where she must choose: Will she stand with the X-Men or with her husband? Writer Chris Yost (X-FORCE, NEW X-MEN) and up-and-coming artist Diogenes Neves bring you this first part of a limited series that will change Storm forever...\r<br>Rated T+ ...$3.99", "Black Panther (2005) #41": "A SECRET INVASION TIE-IN!\r<br>\"SEE WAKANDA AND DIE,\" PART 3 \r<br>The war for Wakanda comes to its brutal conclusion.  With Storm and the Black Panther both prisoners of the Skrull invaders, is all hope lost for the people of Wakanda?  Or does their king still have one last trick up his sleeve?\r<br>Rated T+ ...$2.99\r<br>", "X-Men Vs. Apocalypse Vol. 2: Ages of Apocalypse (Trade Paperback)": "The Shi'Ar on the Moon, Cable and his wife in Egypt, Wolverine in the Negative Zone - what's wrong with this picture? Apocalypse has risen from the past to change timelines until he finds one he likes - but when the original X-Man looks him in the eye, both men are lost, leaving the X-Men to comb the world for friend and enemy alike! Will Cyclops literally become the thing he fears and hates the most, and vice versa? And where does the Red Skull fit into all of this? Anywhere he wants to! Guest-starring the Hulk, Machine Man, Deathlok and more! Collecting X-51 #8, UNCANNY X-MEN #378 and ANNUAL 1999, CABLE #77, WOLVERINE #148,\r<br>X-MEN UNLIMITED #26, X-MEN #98 and X-MEN: THE SEARCH OF CYCLOPS #1-4.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2264-7\r<br>", "Astonishing X-Men (2004) #26": "GHOST BOX PART 2 It is on a spaceship hovering 300 hundred feet above the twisted wreckage of Chaparanga Beach that the X-Men find its sole inhabitant: the mysterious Subject X. Who is this mysterious man and what does he want from the X-Men?", "Cable (2008) #6": "Cyclops must make a gametime decision after learning that Bishop is in hot pursuit of Cable and the last hope for mutankind!", "Counter X Vol. 1 (Trade Paperback)": "Like all mutants, X-Force must face a callous and deadly world -- but now they've been trained for it by Peter Wisdom, one of the most callous and deadly mutants of all! The proactive paranormal platoon faces a city transformed by Cold War mad science and a mutant druglord terrorist, but will their deadliest enemies be Wisdom's long-lost allies? Featuring killer zombies, exploding buildings and the dynamic Domino! Collecting X-FORCE #102-109.\r<br>Rated T+ ...$19.99\r<br>ISBN: 978-0-7851-3304-9\r<br>", "Astonishing X-Men (2004) #25": "GHOST BOX PART 1 The X-Men are back to business -- with a new look, a new base of operations, and a mystery to solve that will take them into previously uncharted territory and test them to their core!", "X-Factor Visionaries: Peter David Vol. 4 (Trade Paperback)": "X-Factor's part in the X-Cutioner's Song Saga sets them against X-Force while the life of mutual mentor Professor X hangs in the balance! The mutant teams finally rally to the same side, only to be outnumbered by three times the scheming as Apocalypse, Stryfe and Mister Sinister vie to see who can kill them first! The Horsemen, the Mutant Liberation Front and the Dark Riders are all in on a wild battleride leading to the Moon and a turning point in mutantdom's destiny! All this plus jousting in Genosha, trips into our heroes' deepest psyches and final battle with the deadliest enemies X-Factor's never heard of! Guest-starring the X-Men, Doc Samson and more! Collecting X-FACTOR #84-89 and ANNUAL #8.\r<br>Rated T+ ...$15.99\r<br>ISBN: 978-0-7851-2745-1\r<br>", "New Mutants Classic Vol. 3 (Trade Paperback)": "The New Mutants face a demon menace and befriend an alien misfit! A rock concert pulls them into the orbit of a multi-galaxy music star, then the team, with Cloak and Dagger, is drawn into a deadly exchange program...of super-powers! Plus: Hellfire Club intrigue and early steps on the path of reformation by Magneto! Action, romance, family reunions and a fairy tale! Anything else? Oh, right, guest-starring the X-Men! Collecting NEW MUTANTS #18-25 and ANNUAL #1.\r<br>Rated A ...$24.99 \r<br>ISBN: 978-0-7851-3119-9\r<br>", "Marvel Adventures the Avengers (2006) #22": "The Avengers take a walk on the wild side as they go toe-to-toe--and claw-to-claw with the savage Sabretooth!  Hope you all have current passports, heroes, because this adventure is going to take you deep into the heart of the African jungle...and right into the heart of the mysterious nation known as Wakanda! (Looks like Sabretooth isn't the only cat about to cross the Avengers' paths...)\r<br>All Ages ...$2.99\r<br>", "X-Men Vs. Apocalypse Vol. 1: The Twelve (Trade Paperback)": "Setting his grand plan for godhood into motion, Apocalypse dispatches his agents to capture the world's most powerful mutants, the fabled Twelve: Professor X, Cyclops, Jean Grey, Storm, Iceman, Sunfire, Polaris, Cable, Bishop, Mikhail Rasputin, the Living Monolith and Magneto. Having himself planted the seeds of the Twelve legend, Apocalypse hopes to siphon their power, granting him omnipotency. Desperate to stave off his ascension, the X-Men must strike a temporary truce with Magneto to battle the warlord's forces as the Twelve are assembled -- and one longtime member seemingly sacrifices his own life to end the threat of Apocalypse once and for all!  Collecting Uncanny X-Men 376-377, Cable 73-76, X-Men 96-97, Wolverine 145-147, X-Men 1999 Yearbook.\r<br>Rated T+ ...$29.99", "Black Panther Annual (2008) #1": "\"BLACK TO THE FUTURE\": A special double-sized issue to commemorate Black History Month.\r<br>It's 2057 and the Watcher's prediction came true: Wakanda is an Imperial Power steering the course for humanity's future.  As T'Challa prepares the next Black Panther for the great responsibility ahead, he must first reflect on the road traveled-a long and winding journey filled with surprises.\r<br>Rated T+...$3.99\r<br>", "Clandestine Classic Premiere (Hardcover)": "For centuries they have lived among us - mysterious, elusive, unknowable...so what are they doing with brightly colored costumes and codenames?! Teenagers Rory and Pandora want to pull Alan Davis's family of extra-normal outsiders into the world of heroes and villains, little knowing that M.O.D.O.K. and A.I.M. are waiting for them! Centuries-old patriarch Adam Destine knows the disastrous duo has a lot to learn about power and responsibility...and we all know who's the web-spinning specialist on that, don't we? Plus Adam and his super-powered scions join the X-Men in a demonic debacle against the sinister Synraith! Also guest-starring Doctor Strange, the Silver Surfer and the Invaders! Collecting CLANDESTINE #1-8, MARVEL COMICS PRESENTS #158 and X-MEN & CLANDESTINE #1-2.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2742-0\r<br>", "Marvel Masterworks: The Uncanny X-Men Vol. 6 (Hardcover)": "The X-Men return for another milestone Marvel Masterworks of beginnings, endings and maybe even the beginning of the end! Chris Claremont and John Byrne raised a rag-tag group of mutants from a burning ember to an all-out firestorm that topped the world of comics. And they'll ride out that flame with one of the most influential X-Men stories of all-\"Days of Future Past!\"\r<br>Feared, hated and now on the road to extinction, Marvel's Children of the Atom face a bleak future of mutant concentration camps and a world where heroes are a thing of days gone past. Only by leaping back through time can Kitty Pryde's future self hope to stop the events that created this dystopian nightmare!\r<br>Claremont and Byrne close out their classic run together with a fan-favorite Kitty Pryde holiday tale, but things only pick up from there with the return of the man who first delineated the all-new, all-different X-Men-Dave Cockrum! \r<br>Cockrum and Claremont put their team in a slow-pressure cooker with Arcade, Dr. Doom, Garokk and then blows its top with the return of Magneto in a double-sized anniversary extravaganza! Featuring guest-appearances by Spider-Woman, Dazzler, not to mention the debut of Mystique's Brotherhood of Evil Mutants, there's no question this one's for the ages! \r<br>Collecting X-MEN #141 and UNCANNY X-MEN #142-150\r<br>Rated A...$54.99\r<br>ISBN: 978-0-7851-3013-0\r<br>", "Black Panther (2005) #34": "It's clobberin' time-in the arena and in the streets, between the new Fantastic Four and several gangs that may have their number.", "Marvel Adventures the Avengers (2006) #20": "The arrival of ANT-MAN! Hank Pym has gone missing from his lab at Van Dyne Industries, and it's up to his most famous experiment-the gorgeous Giant-Girl-to track him down. But when Giant-Girl finds herself stuck in the middle of a very bizarre love triangle, it's time for the world's tiniest super hero to make his diminutive debut! Will he be able to prove that size doesn't really matter?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Storm (Trade Paperback)": "The epic, untold love story between Marvel's two pre-eminent black super heroes - Storm and the Black Panther - is finally told, as only New York Times best-selling author Eric Jerome Dickey can do it! An orphaned street urchin, living by her wits on the unforgiving plains of Africa, struggles to harness her slowly developing mutant powers. A warrior Prince, embarking on his rite of passage as he ponders the great responsibility in his future. And a crew of ruthless mercenaries who'll stop at nothing to capture an elusive creature of legend: the fabled wind-rider. What sparks occur when their paths intersect? Don't miss out on this prelude to the wedding of Storm and the Black Panther! Collecting STORM #1-6.\r<br>Rated T+ ...$14.99\r<br>ISBN: 0-7851-1956-6\r<br>", "Black Panther (2005) #33": "The new Fantastic Four's battle with the Skrull gangsters reaches a pulse-quickening conclusion!", "Uncanny X-Men: Extremists (Trade Paperback)": "The X-Men are back from space! Well, half of them, anyway. The team is shattered, broken and separated. The group that has returned to Earth is finding it much worse than how they left it - especially underground. Attacks in the Morlock Tunnels immediately grab the X-Men's attention. What do these attacks have to do with the future of the mutant race? Maybe special guest-star Storm can get to the bottom of all this! Collecting UNCANNY X-MEN #487-491.\r<br>Rated T+ ...$13.99\r<br>", "X-Men: The Complete Onslaught Epic Vol. 1 TPB (Trade Paperback)": "It begins here! The saga that literally re-made the Marvel Universe of the 1990s is collected in chronological order across four volumes! The psionic force of nature known only as Onslaught sprang forth from the fractured psyche of mutant mentor Charles Xavier and the genetic terrorist called Magneto. Powered by his progenitors' rage, Onslaught laid siege to humanity -- touching off a cataclysmic conflict destined to deprive a world of its most revered icons! Collecting X-MEN #53-54, UNCANNY X-MEN #334-335, AVENGERS #400-401, ONSLAUGHT: X-MEN, X-MAN #18, X-FORCE #57, CABLE #34 and INCREDIBLE HULK #444.\r\n272 PGS./Rated T  '$29.99\r\nISBN: 978-0-7851-2823-6", "Black Panther (2005) #32": "Someone get them a road map! The new Fantastic Four have just taken another wrong turn on the dimensional superhighway -- and this time, they've landed in the middle of a gang-war between machine-gun toting Skrulls!", "Black Panther (2005) #31": "With Zombies chomping at their heels, the new Fantastic Four take another wrong turn on the dimensional superhighway. This time, they've landed in the middle of Sub-Atomica! Can a skirmish with Psycho-Man be far behind? It's clobberin' time.", "Cable & Deadpool (2004) #46 (Zombie Variant)": "Since Deadpool is twice as much trouble as anyone in the Marvel Universe, the only logical people who could possibly rescue him and Bob, Agent of Hydra, from their temporal tantrum are... the FANTASTIC EIGHT? Twice the guest stars! Twice the fun! But not twice the price! How can you say no? 32 PGS./Rated T+ $2.99", "Uncanny X-Men (1963) #491": "This is it, the final showdown between the X-Men and the terrorist branch of the Morlocks.  But how can they win with Warpath and Hepzibah captured and Storm buried under a ton of debris?  The future is at stake and it all centers on Magneto.  But what role will the former Master of Magnetism play?", "Marvel Adventures the Avengers (2006) #16": "Look, sorry pal- ow- but this isn't Robin Hood and the Merry Men- ow-ow-, this is The Avengers- ow!  Hey, watch it with those thi- ow, ow, OW! Fine. What did you say your name was, Hawk-something?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Uncanny X-Men (1963) #490": "Why are the Morlocks terrorizing innocent people?  What is their endgame?  That's what Storm and the X-Men are trying to find out.  All the while, Professor X and Nightcrawler are on the trail of Magneto!", "Black Panther (2005) #30": "After taking a wrong interdimensional turn, the Fantastic Four have just become the daily special in the Zombie Universe! Seated at table one: Zombie Galacti! At table two: Zombie Skrulls! And at table three: a Zombie Monster from the Negative Zone!", "Women of Marvel Vol. 2 (Trade Paperback)": "More classic tales of Marvel's leading ladies! Featuring Kitty Pryde, Black Cat, Dagger, Spider-Woman, Tigra, Jubilee and more! Collecting AVENGERS #83, STRANGE TALES #10-11, SPIDER-WOMAN #10, WEST COAST AVENGERS #15, visions & the Scarlet Witch #12, Uncanny X-Men #168, 189, 201, & 218\r<br>232 PGS./Rated A ...$24.99 \r<br>", "Fantastic Four (1998) #548": "Fantastic Four vs. Frightful Four-'Nuff Said!", "Uncanny X-Men (1963) #489": "With the Morlocks committing terrorist acts, it's up to the X-Men to stop them and figure out why these normally-peaceful mutants have turned to violence.  Guest-starring Storm and her friends in the Fantastic Four!", "Black Panther (2005) #29": "The New Fantastic Four is stranded on the Skrull Planet in the MARVEL ZOMBIES universe! They're all that stand in the way of Zombie Skrulls intent of eating the entire universe!", "Paradise X Vol. 1 (Trade Paperback)": "In EARTH X, Captain America, the Fantastic Four, Thor, the Hulk and the X-Men discovered that their purpose - and the meaning of all super heroes and mutated people in the universe - was nothing more than to protect their host planet, in this case Earth, from outside invasion. They learned super heroes are merely biological antibodies to protect a growing embryo within the Earth. An embryo for the Celestial race: This is the way these Gods fought back - only to cause a terrible ecological imbalance, a rift at its core that in time would wipe out all life on the planet. In UNIVERSE X, Captain Marvel was reborn on Earth years after his death. But he also still claimed to walk in the realm of the unliving, where Earth's fallen champions still exist. Mar-Vell led a team of heroes in a quest for the greatest weapons of mass destruction on Earth, suggesting this would limit the destruction caused by the growing power struggle on the planet. But this was not the only reason. For his crusade on Earth only supported and armed a battle he fought in the realm of the fallen, a battle against Death herself. Those living champions who died in his collection of artifacts were added to the battle raging in this other realm. Mar-Vell led a charge against Death and killed her. But now that Death is dead, no one will ever die again. They may writhe in pain in hospitals because their bodies have been broken beyond repair, but they will not die. They will call out for an end to their suffering. They will cry out for peace but there will be no answer. Paradise will be denied them. Yes. Death is truly dead. Long live the living. Collecting PARADISE X #0-5, PARADISE X: XEN and HERALDS #1-3.\r<br>304 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2415-2\r<br>", "Uncanny X-Men (1963) #488": "The X-Men (re-united with Storm) take to the tunnels to discover why the Morlocks have been erupting with violence.  It ain't going to be pretty.  Also, Professor X goes off in search of a VERY IMPORTANT character from X-History.", "X-Men (2004) #200 (Humberto Ramos Wraparound Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "X-Men (2004) #200": "The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history!", "X-Men (2004) #200 (David Finch Gatefold Variant)": "Blinded by the Light,  Part 1 of 4.  \r<br>Jump on board here! This is where it all begins! The X-Men face meltdown from within and from without... and their leader, Rogue, faces something worse.  Meanwhile a mysterious strike force is taking out the few remaining mutants one by one, with ruthless efficiency.  But who is the ultimate target?  This special double-sized anniversary issue features a plethora of mutant guest stars, the return of several fan-favorites, and a devastating face-off against the deadliest villain team in the X-Men's forty-four year history! FEATURING THE FIRST ENDANGERED SPECIES BACK-UP STORY LEADING UP TO THIS FALL'S X-MEN EVENT!\r<br>64 PGS./Rated A ...$3.99 \r<br>", "Black Panther (2005) #28": "The New Fantastic Four just has landed in the middle of Zombie-verse! If the Black Panther, Storm, the Human Torch and the Thing can't come up with the perfect escape plan, they're going to be the next hors d'ouvres for Zombie Galacti!", "Uncanny X-Men (1963) #487": "The X-Men are back from space!  Well, half of them, anyway.  The team is shattered, broken and separated.  The group that has returned to earth is finding it much worse than how they left it-- especially underground.  Attacks in the Morlock Tunnels immediately grab the X-Men's attention. What do these attacks have to do with the future of the mutant race?  Maybe special guest-star Storm can get to the bottom of all this!", "Black Panther: Civil War (Trade Paperback)": "The Royal Couple, King T'Challa and Queen Ororo, embark on a diplomatic tour that will have them spanning the globe - and beyond! Stops include Latveria (Dr. Doom), the Moon (Black Bolt and the Inhumans), Atlantis (Namor the Sub-Mariner) and the CIVIL WAR-ravaged United States, for a meeting with none other than the point man for the U.S. government's implementation of the Super Human Registration Act: Tony Stark, T'Challa's former Avengers teammate. Will the Black Panther and Storm decide to get off the sidelines of the CIVIL WAR and get involved? Collecting BLACK PANTHER #19-25.\r<br>168 PGS./Rated T+ ...$17.99 \r<br>", "Ultimate X-Men Vol. 16: Cable (Trade Paperback)": "If one man is capable of disrupting the carefully controlled world of Charles Xavier's School For Gifted Youngsters, it's this one: Ultimate Cable! He comes from a tragic future to wreak havoc on mutantkind today, and his sinister secrets will shock the X-Men to their very core. It's a huge event in Ultimate X-Men history. Get in on the ground floor. You've been warned. Plus: Delve into the secret life of the X-Men's rivals, Emma Frost's Academy of Tomorrow, in a special bonus story! Collecting ULTIMATE X-MEN #75-80.\r<br>160 PGS./Rated T+ ...$14.99\r<br>", "Black Panther (2005) #27": "INITIATIVE tie-in. Black Panther and the new Fantastic Four must combat a creature from the Negative Zone.", "Ultimate X-Men (2000) #80": "AFTERMATH PART 2 In the wake of their tragedy, Scott Summers reaches a momentous decision: Disband the X-Men! Is this the end of Xavier's dream? And if so, what does this mean for the evil mutants who may rush in to fill the power vacuum?", "Black Panther (2005) #26": "INITIATIVE tie-in. Black Panther and Storm join Human Torch and Thing as the New Fantastic Four!", "Spider-Man: Birth of Venom (Trade Paperback)": "The Beyonder's Battleworld might seem a strange place to get new threads, but it's Spider-Man who becomes unraveled when his shape-changing costume attempts to darken his life as well as his fashion sense! But ridding himself of his riotous raiment proves an even greater mistake when its alien enmity bonds with mortal madness to form our hero's most dedicated decimator! Plus: the first appearances of Puma and the Rose! Mary Jane Watson's startling secret! And the debut of the battling...Bag-Man!? Guest-starring the Black Cat, the Fantastic Four and more! Collecting SECRET WARS #8; AMAZING SPIDER-MAN #252-259, #298-300 and #315-317; FANTASTIC FOUR #274; and WEB OF SPIDER-MAN #1;  AMAZING SPIDER-MAN ANNUAL #10.\r\n344 PGS./Rated A ...$29.99", "Black Panther (2005) #25": "CIVIL WAR: BLACK PANTHER PART 7 The startling conclusion to Black Panther's Civil War involvement!", "Ultimate X-Men (2000) #79": "AFTERMATH PART 1 After their encounter with Cable, the X-Men must deal with their loss and move forward...but is everything as it seems? And what is...the Shadow King?", "Black Panther (2005) #24": "CIVIL WAR: BLACK PANTHER PART 6 The honeymoon is officially over. With the CIVIL WAR racing toward a senses-shattering conclusion, the Black Panther and Storm pledge their allegiance to the renegade Captain America.", "Ultimate X-Men (2000) #78": "CABLE PART 4 Ultimate Cable, the mutant from the future, makes his final stand against those from the present who oppose him. Win or lose, one of the X-Men will die in this issue!", "Black Panther (2005) #23": "CIVIL WAR: BLACK PANTHER PART 5 Alarmed by the CIVIL WAR that's rocking the U.S., T'Challa and Storm decide to get off the sidelines and get involved in the fight!", "Wolverine by Claremont & Miller (Hardcover)": "The master of mutants joins the master of ninjas in Wolverine's first solo series - replete with romance, intrigue and mayhem! Our beleaguered berserker's in Japan on a mission of the heart, if he can survive the Hand first! Plus: the introduction of everyone's favorite riotous ronin, Yukio! Collects WOLVERINE #1-4, plus Uncanny X-Men # 172-172.\r<br>144 PGS./Rated T+ ...$19.99\r<br>", "Ultimate X-Men (2000) #77": "CABLE PART 3 The X-Men head to an abandoned Weapon X facility in Finland to battle Cable and rescue Jean. Only Cyclops has stayed behind with Xavier as a last line of defense. If Cable takes down the X-Men, will Cyke be able to put an end to him?", "New X-Men (Hardcover)": "Sixteen million mutants dead - and that was just the beginning! In one bold stroke, writer Grant Morrison (All-Star Superman, JLA, FANTASTIC FOUR: 1234) propelled the X-Men into the 21st century - masterminding a challenging new direction for Marvel's mutant heroes that began with the destruction of Genosha and never let up. Regarded as the most innovative thinker of the current comic-book renaissance, Morrison proceeded to turn the mutant-hero genre on its ear. Gone were the gaudy spandex costumes - replaced by slick, black leather and an attitude to match. Now, his entire Eisner Award-nominated run on NEW X-MEN is collected in one deluxe hardcover! Collects NEW X-MEN #114-154 and ANNUAL 2001.\r<br>1096 PGS./Rated T+ ...$99.99\r<br>", "X-Men: The Complete Age of Apocalypse Epic Book 4 (Trade Paperback)": "Learn who lives and who dies in either reality as the apocalyptic arc ends in treachery and tragedy! While certain heroic humans prove their mettle without armor or magic hammers, it's a race to see who the X-Men will destroy first: Apocalypse or themselves! But even with the crisis concluded, new allies and enemies emerge, guaranteeing that reality will still never be the same! Featuring the dawn of Gene Nation and a turning point for the Legacy Virus! Collects GENERATION NEXT #4, X-CALIBRE #4, X-MAN #4 and #53-54, FACTOR X #4, GAMBIT AND THE X-TERNALS #4, AMAZING X-MEN #4, WEAPON X #4, X-UNIVERSE #2, X-MEN: OMEGA, BLINK #4, and X-MEN: PRIME.\r<br>368 PGS./Rated T+ ...$29.99\r<br>", "Wolverine: Enemy of the State - The Complete Edition (Hardcover)": "Collecting the entire best-selling, blockbuster storyline in one deluxe hardcover! The world's deadliest living weapon just fell into the wrong hands. It's Wolverine vs. the Marvel Universe as Logan shreds his way through the X-Men, Fantastic Four, S.H.I.E.L.D., and more! How did Wolverine end up fighting to destroy everything he holds dear? Plus: Wolverine may be back in S.H.I.E.L.D. custody, but at what cost? As the X-Men mourn their fallen teammate in a funeral befitting a hero, Hydra celebrates the coronation of a new leader. And the reign of terror continues, as the Hand picks off the meta-humans, one by one. Will Wolverine be deprogrammed in time to stop the carnage? Collects WOLVERINE #20-32.\r<br>352 PGS./Parental Advisory ...$34.99 \r<br>", "Ultimate X-Men (2000) #75": "CABLE PART 1 Jean's powers are becoming difficult to control. What lengths will Xavier go to ensure she is stabilized? Plus, the X-Men are attacked by someone with intimate knowledge of their powers and tactics! Who is this mystery man?", "Ultimate X-Men Vol. 14: Phoenix? (Trade Paperback)": "After the events of MAGNETIC NORTH and their recent encounter with the master of magnetism, our heroes kick back for a night on the town with their significant others. Meanwhile, Wolverine must face a dreaded foe from the past who comes back to haunt him with unbearable secrets that have been buried for years. Plus: The mysterious mutant called Magician is plunged into the world of the X-Men, adjusting quickly and making new friends fast. But there is something deeply sinister about the newcomer. Something only young Kitty Pryde notices. Let's hope she hasn't noticed too late. Meanwhile, is Jean Grey really the cosmic entity called Phoenix? And if so...what can be done about it...? Join new ULTIMATE X-MEN writer Robert Kirkman, ULTIMATE SECRET's Tom Raney and Vigilante's Ben Oliver as they take the Ultimate Universe's favorite mutants to dazzling new heights! Collects ULTIMATE X-MEN #66-71.\r<br>144 PGS./Rated A ...$14.99\r<br>", "Black Panther (2005) #20": "CIVIL WAR: BLACK PANTHER PART 2 The royal couple King T'Challa and Queen Ororo continue their diplomatic tour! Last issue they survived a trip to Latveria, now they're going to the moon for a meeting with Black Bolt and the Inhumans.", "Uncanny X-Men - The New Age Vol. 5: First Foursaken (Trade Paperback)": "Here it comes! Find out why and how Psylocke came back to life. Find out what Jamie Braddock is up to and why he's been popping up from place to place in the past year. Everything has been building to this. Don't miss it! Collects UNCANNY X-MEN #472-474 and ANNUAL #1.\r<br>120 PGS./Rated A ...$11.99\r<br>", "Ultimate X-Men (2000) #74": "MAGICAL PART 3 The X-Men discover the true nature of The Magician. Meanwhile, discover the fate of Jean Grey. Plus, battle at the X-Mansion! \n", "Wolverine Classic Vol. 4 (Trade Paperback)": "Enemies like Roughouse are hard to find, as Wolverine learns all too well when his favorite Asgardian sparring partner gets abducted into a dictator's experiment! But the trail leads the mutant marvel to more menace than he expected in the form of a Nazi cyborg, an amphibious evildoer and a giant germ of the gods! Featuring the X-Men, the Avengers and Daredevil! Collects WOLVERINE #17-23.\r<br>168 PGS./Rated T+ ...$14.99\r<br>", "X-Men: The End Book 3: Men and X-Men (Trade Paperback)": "The endgame of the last tale of Marvel's most popular mutants begins! They've suffered through sneak attacks, betrayals, and fatalities - now, Professor X and Magneto are taking the fight back to the enemy, amidst the stars! Collects X-MEN: THE END - MEN AND X-MEN #1-6. \r<br>144 PGS./Rated T+ ...$14.99\r<br>", "Women of Marvel (Trade Paperback)": "It's a First-Issue Frenzy as Marvel collects the crime-fighting debuts of the Dazzler, Ms. Marvel, Shanna the She-Devil and the Cat - with distaff deviltry from the Enchantress and the White Queen! Plus: The Black Widow gets a new costume and the She-Hulk a new team membership, but that's nothing next to the changes Storm and Rogue undergo! Guest-starring Spider-Man, the Avengers, the X-Men and more! Featuring the first appearance of Jubilee! Collects AVENGERS #221; UNCANNY X-MEN #151-152, 182 & 244; AMAZING SPIDER-MAN #86; MS. MARVEL #1; THE CAT #1; DAZZLER #1; and SHANNA, THE SHE DEVIL #1\r<br>224 PGS./Rated T+ ...$24.99\r<br>", "Black Panther (2005) #18 (TURNER VARIANT)": "CIVIL WAR Tie-in\r\n\"BRIDE OF THE PANTHER\"\r\nSPECIAL DOUBLE-SIZED ISSUE! It's the Wedding of the Century as T'Challa and Storm finally make it to the altar -- and not since Reed and Sue tied the knot have so many of Marvel's super heroes assembled for such a happy occasion.  Can this gathering offer much-needed respite from the Civil War that's erupted in the U.S., or will it too be engulfed by the insanity that's currently rocking the Marvel Universe?  Don't miss this historic event -- and turning point in the CIVIL WAR.  Featuring backup features, including a look behind the scenes at the creation of Storm's wedding gown, and wraparound cover by Frank Cho!  Part 5 (of 5).\r\n48 PGS./Rated T  ...$3.99", "Black Panther (2005) #18": "BRIDE OF THE PANTHER PART 5 The Black Panther and Storm are ready to tie the knot. Prepare for the wedding of the decade!", "Storm (2006) #6": "It's High Noon -- at 20,000 feet!  Captured by the Bull and his cronies, bound and helpless on a transport helicopter and headed to God knows where, Ororo and T'Challa are in big trouble.  If they are going to survive this ordeal, then Ororo must do what she has never done before: harness her terrifying powers and, for the first time, use them as a weapon.  And that's the easy part!  Trust us, True Believer, you won't want to miss this key issue of the limited series that tells the untold love story between Marvel's two pre-eminent Black super heroes -- Storm and the Black Panther!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Ultimate X-Men (2000) #72": "MAGICAL PART 1 Here comes The Magician! He's a media darling, a vital part of the X-Men dynamic and the newest member of the team. Plus-the fallout from the Shi'Ar's test on Jean Grey has drastically unanticipated consequences.\n", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Storm (2006) #5": "For Ororo and T'Challa, things are about to go from bad to worse.  As the bond between them continues to grow in unforeseen ways, tensions simmer to the boiling point in the camp of the men who are hunting them.  To say that the De Ruyter brothers aren't seeing eye to eye is to put it mildly. The outcome of their power struggle will have grave repercussions for Ororo and T'Challa. True Believer, you won't want to miss this key issue of the limited series that tells the untold love story between Marvel's two pre-eminent Black super heroes -- Storm and the Black Panther!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Black Panther (2005) #17": "BRIDE OF THE PANTHER PART 4 One of the biggest battles T'Challa and Storm has ever faced is at hand: who will they invite to the wedding?", "Uncanny X-Men - The New Age Vol. 4: End of Greys (Trade Paperback)": "In the wake of HOUSE OF M, Marvel Girl's emotions are heating up! Faced with a future she thought was destroyed, Rachel Grey will find out just what she's really made of when her entire family is placed on the intergalactic wanted list! Now, the X-Men are the only thing that stands between the Greys and their extraterrestrial executioners! Collects UNCANNY X-MEN #466-471.\r<br>144 PGS./Rated T+ ...$14.99\r<br>", "Uncanny X-Men Annual (2006) #1": "This X-Men special features Storm as she faces the most important crossroads of her life! How does she react to T'Challa's proposal of marriage? How will it affect her role with the X-Men? Will she be able to lead two different lives at the same time. This leads into next month's BLACK PANTHER / STORM WEDDING!\r<br>48 PGS./Rated A ...$3.99\r<br>", "Ultimate X-Men (2000) #71": "PHOENIX PART 3 The quest to learn if Jean Grey is, in fact, the Phoenix reaches a shattering conclusion! And the mystery surrounding the X-Men's newest member, the Magician, deepens-as Nick Fury starts putting the pieces together! ", "X-Men: The End - Men and X-Men (2006) #6": "The long-awaited climax! Who lives, who dies, who changes-and why, after the conclusion of this adventure, is there no longer a need for X-Men?", "Storm (2006) #4": "Knowing that their very survival may hinge on Ororo's ability to harness her newfound powers, T'Challa and Ororo travel deeper into the jungle, just a step ahead of the mercenaries that are hot on their trail.  There, the sparks between the two teenagers finally ignite into fire, and their relationship takes on a whole new meaning.  \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Black Panther (2005) #16": "BRIDE OF THE PANTHER PART 3  T'Challa's heart -- and a seat on the Wakandan throne -- is Storm's, if she'll just accept his hand in marriage.  Question is, does she want it?", "Uncanny X-Men Omnibus Vol. 1 (Hardcover)": "When a young writer named Chris Claremont took over X-Men in 1976, few fans could predict the incredible impact he would have on the Marvel Comics series. With a flair for realistic dialogue, heartfelt storylines and hard-hitting action, Claremont's writing breathed life into the characters. In collaboration with artists Dave Cockrum and John Byrne, Claremont crafted a run still heralded as a definitive era on the book. UNCANNY X-MEN became more than just another super-hero title: this diverse cast of mutants fighting against prejudice and intolerance has resonated in the hearts of millions of devoted readers. Now, the first five years of their landmark run on UNCANNY X-MEN are collected in one oversized volume. This keepsake edition also includes all original letters pages, newly remastered coloring and other uncanny extras! Collects UNCANNY X-MEN #94-131 and ANNUAL #3, and GIANT-SIZE X-MEN #1.\r<br>848 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$99.99\r<br>", "Black Panther (2005) #15": "BRIDE OF THE PANTHER PART 2 T'Challa's search for his true love, the mutant called Storm, takes him to Kenya!", "New Mutants Classic Vol. 1 (Trade Paperback)": "Cannonball. Sunspot. Moonstar. Karma. Rahne. Teenagers, thrown together by the one thing they had in common: the X factor in their genes that made them different, made them mutants. Relive the adventurers of the team that will come to be known as X-Force...if they survive. Collects MARVEL GRAPHIC NOVEL #5, NEW MUTANTS #1-7 and UNCANNY X-MEN #167.\r<br>240 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$24.99\r<br>", "Uncanny X-Men (1963) #472": "Find out why and how Psylocke came back to life.  Find out what Jamie Braddock is up to and why he's been popping up from place to place.", "Uncanny X-Men (1963) #471": "Rachel takes the fight to the aliens that slaughtered her family!  But will the X-Men be able to keep her from crossing the line into murder?!", "X-Men: Mutant Genesis (Trade Paperback)": "The best-selling storyline is back in print! The mutant terrorist Magneto again threatens the world, and only the X-Men can stop him! And should they survive this confrontation, the villainous Omega Red is waiting in the wings! Collects X-MEN #1-7.\r<br>176 PGS./ T+ SUGGESTED FOR TEENS AND UP ...$19.99\r<br>ISBN: 0-7851-2212-5\r<br>", "Storm (2006) #2": "The epic, untold love story between Marvel's two pre-eminent Black super heroes -- Storm and the Black Panther -- is finally told, as only New York Times best-selling author Eric Jerome Dickey can do it!  The orphaned street urchin known as Ororo has big problems: Emerging mutant powers that she can't understand, let alone control, and a crew of ruthless mercenaries that will stop at nothing to capture the elusive \"wind-rider\" of legend.  Ororo's only hope to survive?  A boy she's never met.  A warrior prince whose fledgling skills are about to be put to the supreme test.  Don't miss out on this story, True Believer, as it builds to a July Event that will shake the entire Marvel Universe.\r\n<br>32 PGS./T  SUGGESTED FOR TEENS AND UP ...$2.99\r\n<br>", "Black Panther (2005) #14": "BRIDE OF THE PANTHER PART 1 Every King needs a Queen -- and that's exactly what the Black Panther is searching for!", "Uncanny X-Men (1963) #470": "The line has been drawn and the first strike has been made! Never has an X-Man had so much taken away and feared so much for what the future may bring! No more waiting for the next shoe to drop. The X-Men will take the fight to their enemies, no matter the cost!", "X-Men: The End - Men and X-Men (2006) #3": "A strike-force led by Cyclops finds itself pitted against the Shi'ar Imperial Superguardians as a separate team of X-Men travel deep into space to rescue the Phoenix. And Gambit, disguised as Mr. Sinister confronts the Shi'ar Chancellor!", "House of M: Uncanny X-Men (Trade Paperback)": "The return of Captain Britain! Brian Braddock is released from his duties as protector of the Omniverse to deal with a threat of even greater proportions-as if that was even possible! Meanwhile, Pyslocke and Rachel find themselves trapped in a situation with no way out! Collects UNCANNY X-MEN #462-465.\r<br>96 PGS./RATED T+ ...$13.99\r<br>", "Uncanny X-Men (1963) #469": "The line has been drawn and the first strike has been made! Never has an X-Man had so much taken away and feared so much for what the future may bring! No more waiting for the next shoe to drop. The X-Men will take the fight to their enemies, no matter the cost!", "X-Men: The End - Men and X-Men (2006) #1": "The Endgame of the last tale of Marvel's most popular mutants begins! They've suffered through sneak attacks, betrayals, and fatalities-now, Professor X and Magneto are taking the fight back to the enemy, amidst the stars!", "Uncanny X-Men (1963) #467": "Marvel Girl's entire family has been placed on the intergalactic wanted list! The X-Men are the only thing that stands between the Greys and their extraterrestrial executioners!", "SECRET WARS TPB (Trade Paperback)": "The classic 12-issue limited series is back in print! The first mega-crossover of its kind, SECRET WARS still stands as a milestone in the comic-book industry. The fate of the entire Marvel Universe hangs in the balance as all of Earth's greatest super heroes face their deadliest foes on the mysterious planet known as Battleworld! \r<br>336 pages./ T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Marvel Visionaries: John Romita Jr. (Hardcover)": "Celebrating the artwork of John Romita Jr., a legend in his own right, on the anniversary of his first work on AMAZING SPIDER-MAN! Tony Stark battles alcoholism! Spider-Man battles the Juggernaut though the streets of New York! The dawn of a New Universe! Daredevil and Kingpin celebrate Christmas! The Punisher joins the Mafia! Also featuring the Hulk, Magneto, Professor X, a masterful retelling of Daredevil's origin, and more! Collects stories from AMAZING SPIDER-MAN #229-230, #36, ANNUAL #11; IRON MAN #128 and #256; UNCANNY X-MEN #183 and #309; STAR BRAND #1; DAREDEVIL #253; PUNISHER WAR ZONE #1; DAREDEVIL: MAN WITHOUT FEAR #1-2; and HULK #25 and #34.\r<br>\r<br>360 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "X-Men (2004) #176": "WILD KINGDOM Part 3\nThe X-Men's team-up with Black Panther continues! With the X-Men captured, Storm and Black Panther are going to have to put their differences aside and work together before all of Africa is overrun with mutated monstrosities!", "X-Men: The Complete Age of Apocalypse Epic Book 2 (Trade Paperback)": "See your favorite mutants through a dark glass as the epic that literally rebuilt the X-Men in eight miniseries and more continues! Apocalypse has conquered half of humankind and is ready to destroy them all! Magneto and his Amazing X-Men fight to protect humans and mutants alike, only to learn from Bishop (now on his THIRD reality and counting) that his world might need to be unmade! Plus: excerpts from Apocalypse's own files on the alternate-universe X-Men, and their friends and foes...but which is which? Featuring Blink and Sabretooth of the Exiles! Collects X-MEN: ALPHA, AGE OF APOCALYPSE: THE CHOSEN, GENERATION NEXT #1, ASTONISHING X-MEN VOL. 1 #1, X-CALIBRE #1, GAMBIT AND THE X-TERNALS #1-2, WEAPON X VOL. 1 #1-2, AMAZING X-MEN #1-2, FACTOR X #1-2 and X-MAN #1\r<br>376 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Black Panther (2005) #8": "WILD KINGDOM Part 2\nInvestigating a the appearance of mutated wild animals in Africa, the X-Men come face to face with mutant bio-organisms the likes of which the world has never seen.  The key to defeating them may lie with the Black Panther.", "Gambit: Hath No Fury (Trade Paperback)": "It's voodoo chaos in the Big Easy as the reanimated dead are crawling out of their graves and overrunning the streets. Gambit may be the only person who can save the city from an undead apocalypse, but he's got bigger problems at the moment: two women, both heartbroken, both angry and both demanding his head on a platter. Plus: As a thief, Gambit has faced some risky jobs, but this may be his most dangerous yet: He'll have to infiltrate the heavily-fortified home of the world's most powerful mutants. That's right...Gambit's got to swipe something right from under the noses of his teammates, the X-Men! Collects GAMBIT #7-12.\r<br>144 PGS./T+ SUGGESTED FOR TEENS AND UP ...$14.99\r<br>", "Marvel Nemesis: The Imperfects (2005) #5": "Now able to track the mysterious source that controls Dr. Van Roekel's augmented army, Storm, Iron Man, The Human Torch and the Thing track Elektra to the jungles of the Amazon where they discover more than they bargained for…a full-on battle with The Imperfects. But can they survive long enough to turn the possessed assassin?", "Marvel Visionaries: Chris Claremont (Hardcover)": "In celebration of the 30th anniversary of Chris Claremont's first X-Men story, the House of Ideas presents a timeless testament to another true Marvel visionary! Best known for ushering the X-Men from reprints to blockbuster franchise, Claremont has steered Marvel's mutants for three decades while working alongside some of comicdom's top artists. This deluxe keepsake edition collects some of his greatest moments - including stories from DAREDEVIL #102; MARVEL PREMIERE #11; IRON FIST #14; UNCANNY X-MEN #137, #153, #205, #268 and ANNUAL #12; AVENGERS ANNUAL #10; WOLVERINE #3; NEW MUTANTS #21; CLASSIC X-MEN #13; EXCALIBUR #16; and X-MEN UNLIMITED #36.\r<br>376 PGS./Marvel T+ ...$29.99\r<br>ISBN: 0-7851-1887-x\r<br>", "Uncanny X-Men - The New Age Vol. 3: On Ice (Trade Paperback)": "High adventure in the Savage Land! The X-Men discover a wondrous and advanced new civilization when they return to the isolated, Antarctic jungle &#8211; but it&#8217;s none too friendly toward humans&#8230;or mutants! And could the X-Men have unintentionally helped them take their first steps toward world domination? Plus: The team gains a highly unexpected new member! Collects UNCANNY X-MEN #455-461. \r<br>168 PGS./Marvel T+ &#8230;$15.99\r<br>", "Giant-Size X-Men (2005) #4": "Ode to an old soldier! In celebration of super-scribe Chris Claremont's 30th anniversary chronicling the adventures of Marvel's Merry Mutants comes this colossal collection of classic tales - plus a brand-new 8-page story by Claremont and fan-favorite X-artist Paul Smith! Featuring Thunderbird's death at the hands of Count Nefaria in X-MEN #94-95 (August/October 1975), a eulogy for the fallen hero in CLASSIC X-MEN #3 (November 1986) and his younger brother's attempt to exact revenge on the X-Men in UNCANNY X-MEN #193 (May 1985).\r<br>96 PGS./T+ SUGGESTED FOR TEENS AND UP ...$4.99\r<br>", "X-Men Vignettes Vol. 2 (Trade Paperback)": "From the frozen Canadian wilderness to the Shi'ar Galaxy, witness behind-the-scenes tales from an earlier X-Men era! See through the psionic sight of a super-villain! Secrets of Magneto, Banshee, Colossus, Storm, Wolverine and more revealed! It's subplot central from Marvel's magnificent mutant maven! Collects the backups stories from CLASSIC X-MEN #14-25.\r<br>152 PGS./Marvel T+ &#8230;$17.99\r<br>ISBN: 0-7851-1728-8\r<br>X-MEN VIGNETTES VOL. 1 TPB STILL AVAILABLE!\r<br>$17.99 \r<br>", "Uncanny X-Men (1963) #462": "El Tigre seeks the power of a god, and the X-Men are in his way! With Marvel Girl gone from their ranks, do they have a prayer of stopping him?", "Giant-Size X-Men (2005) #3": "In celebration of the 30th anniversary of 1975's GIANT-SIZE X-MEN #1 and #2 comes a colossal collection of the X-Men's greatest team-ups - <b>plus a brand-new untold tale of the All-New, All-Different X-Men by JOSS WHEDON and DAVE COCKRUM!</b> The X-Men tangle with the FF in FANTASTIC FOUR #28 (July 1964), the Might Avengers guest-star in X-MEN #9 (January 1964) and along comes a Spider-Man in X-MEN #35 (August 1967)!\r<br>80 Pgs/ Marvel PSR... 4.99\r<br>", "Uncanny X-Men (1963) #461": "\"MOJO RISING\" Part 2 (of 2).\r<br>The Uncanny X-Men just can't get a break. As the team tries to relax and deal with the return of their once-dead teammate Psylocke, guess who crashes their party? We'll give you a hint; he's really fat, and his name's in the title!\r<br>32 PGS./T+ Suggested for Teens and Up ...$2.50 \r<br>", "X-Men/Fantastic Four (Hardcover)": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding adventure! Can the two teams put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence? Even as the heroes trek into the stars, the real threat to their mission might just be among themselves! It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Collects X-MEN/FANTASTIC FOUR #1-5. \r<br>120 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>ISBN: 0-7851-1520-X\r<br>", "Uncanny X-Men (1963) #460": "\"MOJO RISING\" Parts 1 & 2 (of 2).\r<br>The Uncanny X-Men just can't get a break. As the team tries to relax and deal with the return of their once-dead teammate Psylocke, guess who crashes their party? We'll give you a hint; he's really fat, and his name's in the title!\r<br>32 PGS. (EACH)/T+ Suggested for Teens and Up ...$2.50 (EACH)\r<br>", "FANTASTIC FOUR/SPIDER-MAN CLASSIC TPB (Trade Paperback)": "Marvel movie stars past and present unite in a series of senses-shattering slugfests for the ages! At the dawn of the Marvel Age, Spider-Man meets the Fantastic Four as the Chameleon strikes! Also featuring a battle royal with the Frightful Four! The first appearance of the future New Mutant known as Karma! The villainy of Dr. Doom! A date with Invisible Girl! When comics' first family and everybody's friendly neighborhood wall-crawler get together, chaos is sure to ensue! Collects AMAZING SPIDER-MAN #1; SPECTACULAR SPIDER-MAN #42; FANTASTIC FOUR #218; MARVEL TEAM-UP #100, 132-133; and UNTOLD TALES OF SPIDER-MAN '96.\r<br>152 PGS./Marvel PSR ...$16.99\r<br>", "Uncanny X-Men (1963) #459": "\"ON ICE!\"\r<br>The exciting conclusion of the X-Men's Savage Land adventure! Their strange new foes are bent on claiming the Earth for their own-and they plan on using the might of the X-Men to do it! The merry mutants must make some uneasy alliances to stop the only enemies they aren't a match for-their own teammates! Guest-starring Ka-Zar! Part 5 (of 5).\r<br>32 PGS./Marvel PSR ...$2.25\r<br>", "Gambit (2004) #10": "HATH NO FURY  PART 1 As a thief, Gambit has faced some risky jobs, but this may be his most dangerous yet-he'll have to infiltrate the heavily-fortified home of the world's most powerful mutants and his teammates-the X-Men!", "X-Men: Eve of Destruction (Trade Paperback)": "Magneto menaces the world once again - but while he threatens to spread war, the X-Men are trapped in Genosha! It's up to Phoenix to lead a new team to victory, but can she manage it? Can they? Guest-starring Dazzler, Northstar, Corsair of the Starjammers and more! Collects UNCANNY X-MEN #391-393 and X-MEN #111-113.\r<br>152 PGS./MARVEL PSR ...$14.99\r<br>", "X-Men: Age of Apocalypse (2005) #6": "This AGE OF APOCALYPSE event comes to a close with this star-shattering conclusion! What will be the final fate of the AoA universe?!", "Marvel Visionaries: Steve Ditko (Hardcover)": "In celebration of its 65th anniversary, the House of Ideas proudly presents a timeless testament to another true Marvel visionary! Best known as the first artist to bring Spider-Man to life in the pages of AMAZING FANTASY, Steve Ditko illustrated AMAZING SPIDER-MAN for four years - helping create characters such as Doctor Octopus, the Lizard, the Vulture and dozens more of Spider-Man's classic villains. In contrast to the grounded realism of Spider-Man, Ditko also drew the adventures of Doctor Strange, a master of the mystic arts who defended Earth's citizens from bizarre otherworldly threats. Now, this deluxe keepsake edition collects his greatest moments - including stories from TALES TO ASTONISH #26 and #42; STRANGE TALES #94, #97, #110, #115, #126, #127 and #146; AMAZING ADULT FANTASY #7, #10, #12, #13 and #14; AMAZING SPIDER-MAN #1, #31-33 and ANNUAL #1; HULK #6 and #249; TALES OF SUSPENSE #48; DAREDEVIL #162; \r<br>MARVEL SUPER-HEROES SPECIAL; and SPEEDBALL #1.\r<br>336 PGS./All Ages ...$29.99\r<br>", "X-Men: The Complete Age of Apocalypse Epic Book 1 (Trade Paperback)": "It begins here! The critically acclaimed, fan-favorite storyline that rocked the X-Men Universe to its core is collected across four volumes! In a cracked-mirror world ruled by the genocidal mutant despot Apocalypse, only one hope remains: Magneto and his Astonishing X-Men! Collects X-MEN CHRONICLES #1 and #2, TALES FROM THE AGE OF APOCALYPSE: BY THE LIGHT, X-MAN #-1, X-MAN '96 ANNUAL, TALES FROM THE AGE OF APOCALYPSE: SINISTER BLOODLINES, and BLINK #1-4.\r\n360 PGS./Marvel PSR ...$29.99", "X-Men: Age of Apocalypse (2005) #5": "The fan-favorite Age of Apocalypse sequel thunders towards its conclusion.  Will the AOA survive?", "X-Men: Age of Apocalypse (2005) #4": "The Age of Apocalypse's return may be short-lived...can the AOA universe survive?", "X-Men: Age of Apocalypse (2005) #3": "Return to the Age of Apocalypse as Sinister is about to bring about his own reign of terror!", "Uncanny X-Men (1963) #457": "\"ON ICE!\"\r<br>High adventure in the Savage Land! The X-Men discover a wondrous and advanced new civilization...but it's none too friendly toward humans-or mutants! And could the X-Men have unintentionally helped them take their first steps toward world domination?\r<br>Part 3 (of 5).\r<br>32 PGS./Marvel PSR ...$2.25\r<br>", "X-Men: Age of Apocalypse (2005) #2": "As Sinister launches his endgame, Magneto and the X-Men's only hope lies in tracking down a retired Weapon X!", "Uncanny X-Men (1963) #456": "\"ON ICE!\" Part 2 of 5! \r<br>The X-Men return to the Savage Land! Plus, the team gains a highly unexpected new member! The fabulous Alan Davis returns as the monthly penciler! \r<br>", "X-Men: The End Book One: Dreamers & Demons (Trade Paperback)": "It's the epic finale to the story of the Children of the Atom as renowned X-Men scribe Chris Claremont joins with star artist Sean Chen for a trilogy in the style of the Lord of the Rings movies, one that spans the length and breadth of the X-Men canon and brings the saga of Marvel's mutants to a climax! Collects X-MEN: THE END - DREAMERS AND DEMONS #1-6", "New Mutants Vol 1: Back to School (Trade Paperback)": "Moonstar, Karma, Magma, and Wolfsbane - the former X-Men-in-training who helped define a generation - are back. But what happens when these \"New Mutants\" find out Professor Xavier's up-and-coming students think of them as the \"Old Mutants?\" Former students become the teachers as the old guard is asked back to help prepare the next generation of New X-Men. Collects New Mutants (2003) #1-6.", "Wolverine (2003) #25": "\"ENEMY OF THE STATE\" Conclusion!  Tough love takes on a whole new meaning when Wolverine, brainwashed and evil, comes home to the X-Mansion for his most damaging Hydra mission yet. Are the X-Men and Nick Fury ready for him? The blistering storyline speeds to a breakneck conclusion you have to see to believe!", "X-Men/Fantastic Four (2004) #3": "It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Part 3 (of 5).", "Marvel Masterworks: The Uncanny X-Men Vol. 5 (Hardcover)": "In celebration of the 25th anniversary and presented here for the first time in full-archival color, including pages straight from the Byrne/Austin originals, the Dark Phoenix Saga! \r<br>Gathered together by Professor Charles Xavier to protect a world that fears and hates them, the X-Men had fought many battles, been on adventures that spanned galaxies, grappled enemies of limitless might, but none of this could prepare them for the most shocking struggle they would ever face. One of their own members, Jean Grey, has gained power beyond all comprehension, and that power has corrupted her absolutely!\r<br>Now they must decide if the life of the woman they cherish is worth the existence of the entire universe!\r<br>Collecting X-Men #132-140, Annual #4 with special bonus features including the original X-Men #137 story where Jean Grey lived \"Phoenix: The Untold Story\" and the Claremont/Buscema Phoenix classic from Bizarre Adventures #27! And if that wasn't enough, brace yourself for a brouhaha with Wendigo and the seminal story of that furry blue elf Nightcrawler in \"Nightcrawler's Inferno.\"\r<br>", "X-Men: Dream's End (Trade Paperback)": "The death of Colossus, reprinted here for the first time! For too long mutants were threatened by the twin specters of the Legacy Virus and anti-mutant politics. Now, the X-Men hope to end both threats, but at what cost to their oldest and dearest? Are there deaths from which even the X-Men can't return? Featuring Mystique, Cable and the last issue of Bishop's solo series!", "X-Men/Fantastic Four (2004) #1": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding limited series! Can the X-Men and the Fantastic Four put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence?! Join megawatt creator Pat Lee and writer Akira Yoshida (THOR: SON OF ASGARD) for mutant meyham and fantastic fights!", "X-Statix Vol. 4: X-Statix Vs. the Avengers (Trade Paperback)": "Who's stronger? Who can beat whom? Well, you're about to find out! And how! America's favorite mutant team, X-Force, squares off against Earth's Mightiest Heroes, the Avengers, in the rumble of the century...or at least the next four months! Collecting X-STATIX #19-26.", "Ultimate X-Men Vol. 9: The Tempest (Trade Paperback)": "Bound together by their unique genetic heritage, the mutant members of the X-Men have become more than just a team - they've become a family. But even the strongest family can be ripped apart by tragedy... and the death of one of their own leaves the remaining X-Men struggling to deal with the loss. And even before a moment of silence can pass, the mysterious Mr. Sinister arrives, intent on giving the X-Men a lot more to mourn! Collects ULTIMATE X-MEN #46-49.", "X-Men: The End - Dreamers & Demons (2004) #1": "\"DREAMERS AND DEMONS\" PART 1 (OF 6) It's the epic finale to the story of the Children of the Atom as renowned X-Men scribe Chris Claremont joins with star artist Sean Chen for a trilogy in the style of the Lord of the Rings movies, one that spans the length and breadth of the X-Men canon and brings the saga of Marvel's mutants to a climax!", "Ultimate X-Men (2000) #49": "Don't miss the conclusion of ULTIMATE SINISTER! This epic showdown finds the master assassin with the X-Men firmly in his sights!  What will happen as we gear up for next month's issue #50??", "Avengers Assemble (Hardcover)": "\"The Avengers embark on one of their strongest eras ever! Kurt Busiek and George Pérez have renovated the comic-book field with such works as Astro City and New Teen Titans, respectively; now, see their take on Earth's Mightiest Heroes. Fresh from the Heroes Reborn fiasco, the Avengers find themselves thrown into yet another alternate reality, under the power of Morgan Le Fay! Meanwhile, on the home front, the Squadron Supreme challenges their very identities! Collects AVENGERS #1-11 and ANNUAL '98.\"", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 2 TPB (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues as the FF face off against two of their greatest foes: Galactus and Doctor Doom! Guest-starring the Black Panther, Thor, Spider-Man, Iron Man, Daredevil, Doctor Strange, the Inhumans, the X-Men and more! Collects FANTASTIC FOUR #241-250.", "Ultimate X-Men (2000) #48": "Mutants are turning up dead -- murdered in New York City. Someone is targeting them. When Charles Xavier learns of this, he puts his X-Men on the trail of the killer. But are Xavier's children of the atom the hunters -- or the hunted? And who is the mysterious figure in shadow that this serial killer follows implicitly? The answer will absolutely shock you!", "Ultimate X-Men (2000) #47": "Mutants are turning up dead -- murdered in New York City. Someone is targeting them. When Charles Xavier learns of this, he puts his X-Men on the trail of the killer. But are Xavier's children of the atom the hunters -- or the hunted? And who is the mysterious figure in shadow that this serial killer follows implicitly? The answer will absolutely shock you!", "Ultimate X-Men (2000) #45": "NEW MUTANTS PART 6 One of the X-Men is dead. While, the rest of the team deals with the surprise Sentinel attack, Nick Fury makes a move to take out those responsible.", "Ultimate X-Men (2000) #44": "NEW MUTANTS PART 5 Emma Frost, alongside the president of the United States, rolls out her new team of mutants when a surprise attack puts the original mutant team-The X-Men-on the offensive.", "Ultimate X-Men (2000) #43": "NEW MUTANTS PART 4 Emma Frost provides the President with an alternative to the X-Men. What does this new team have to do with Cyclops' brother, Alex? And what does Emma hope to achieve with her new mutant initiative?", "Ultimate X-Men (2000) #42": "NEW MUTANTS PART 3 The debut of Ultimate Dazzler is here! After Hank McCoy's recent embarrassment at the hands of the public, he takes his leave of the Xavier's Institute. Meanwhile, concern grows over Xavier's relationship with the President.", "X-Treme X-Men Vol. V: God Loves, Man Kills (Trade Paperback)": "Collecting the classic graphic novel that that inspired the 2003 blockbuster X2, along with a brand new sequel to that legendary story!", "X-Treme X-Men Vol. 5: God Loves, Man Kills (Trade Paperback)": "Collecting the classic graphic novel by Chris Claremont and Brent Anderson (inspiration for the 2003 blockbuster X2), along with a brand new sequel to that legendary story! \r\nThe Anti-Mutant Movement leader Stryker has returned and it's up to the X-Treme team to make sure his hatred of mutants does not lead to more deaths. But what happens when the X-Treme team and Stryker's goals are one and the same? Guest-starring Wolverine and Shadowcat!\r\nCollects X-MEN: GOD LOVES, MAN KILLS GN, X-TREME X-MEN #25-30", "X-Men Legends Vol. III: Arthur Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.", "Thor Legends Vol. 2: Walt Simonson Book II (Trade Paperback)": "Few people have ever left their mark on one character quite the way Walter Simonson has. His work on the MIGHTY THOR swept the Norse God of Thunder to heights never before seen and rarely achieved since. Spanning epic tales of heroism and treachery, love and war, Simonson's work is often considered the definitive Thor. From the majesty and mystery of Asgard to the gritty streets of New York City, Thor was never the same. That is the mark of a true visionary. \r\nThis volume continues the collection of Simonson's epic run, reprinting THOR #349-355 and #357-359.", "X-Men Legends Vol. 3: Art Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.\r\nCollects NEW MUTANTS SPECIAL EDITION #1; X-MEN ANNUALS #9-10, 12; FANTASTIC FOUR #347-349.", "X-Treme X-Men Vol. 3: Schism (Trade Paperback)": "They've accomplished their goal, but what will the X-Treme team do now? Join Storm, Wolverine. Bishop, Sage, and more of your favorite mutants for more romance, mystery and high-adventure.\r\nCollects X-Treme X-Men #19-23 and X-POSE #1-2.", "X-Treme X-Men (2001) #23": "The safety protocols on the Danger Room have been disabled and Storm and Emma are stuck inside!\n", "Ultimate X-Men (2000) #30": "Magneto intends to use Forge's power-amplifying machine to reverse the Earth's polarity, effectively wiping out mankind. Cyclops has other plans!", "X-Treme X-Men (2001) #22": "Sage and Bishop are breaking in...to the X-Mansion?!\n", "X-Treme X-Men (2001) #21": "Sage and Bishop have been taken into police custody. Why? And does it have anything to do with the murder in Alaska?\n", "X-Treme X-Men: X-Pose (2003) #2": "Rogue and Gambit intercept a meeting between a mutant and a team of journalists. Disaster ensues!", "X-Treme X-Men: X-Pose (2003) #1": "A group of reporters are tasked with getting the scoop on the X-Men. But are the X-Men ready to expose themselves to the media?", "X-Treme X-Men (2001) #19": "The festive mood that the X-Men are enjoying is shattered after Kitty Pryde's mood takes a turn. What's on her mind? And how will it affect the team going forward?\n", "X-Men Visionaries: Jim Lee (Trade Paperback)": "The X-Men follow the trail of Rogue's nightmares to a hidden corner of the globe where the great dinosaurs of the Jurassic and Cretaceous Ages continue to rule.", "New X-Men (2001) #132": "The X-Men are on Genosha, surveying the destruction of the former mutant city, when they encounter Polaris. The X-Men attempt to calm the confused mutant when they inadvertently activate a recorded message from the deceased Magneto...", "X-Treme X-Men (2001) #15": "While Sage ushers Storm to safety, Rogue faces off against Vargas!", "X-Treme X-Men (2001) #14": "A new Venom for a new era! Flash Thompson is Spider-Man&rsquo;s biggest fan. That hero worship inspired him to enlist in the Army, where he became a decorated veteran and war hero. And though he lost his legs, Flash never lost his dignity &mdash; or his desire to serve. Now, the government has offered him a chance to be a hero once again &mdash; to don the alien symbiote that grants its wearer powers similar to those of Spider-Man, but also puts them at risk of permanently bonding with the parasitic creature. Flash Thompson is Venom, the government&rsquo;s most lethal special operative &mdash; sent into the hottest of hot zones against the worst enemies of the state. He&rsquo;s fought tough foes before, but the toughest opponent he faces may just be himself. Collecting VENOM (2011) #1-5.", "Wolverine (1988) #176": "Prepare to be shocked by who Wolverine is confronted by in this thrilling issue!", "X-Treme X-Men (2001) #13": "Sage mounts a risky mission to rescue Storm from Khan's space station!\n", "Exiles (2001) #12": "The Exiles and Weapon X must team up to protect David Richards, who is destined to become the most powerful mutant on Earth.", "X-Treme X-Men (2001) #12": "In 2000, Marvel launched the Ultimate Universe, reinventing Spider-Man for a new millennium. Now, the first three years of Brian Michael Bendis and Mark Bagley&rsquo;s fan-favorite, award-winning take on the web-slinger are collected in one oversized volume! Relive Peter Parker&rsquo;s early days as Spider-Man, learning to fight crime by trial and error as he struggles to balance his new life with the demands of high school: puberty, homework and dating! Even with the help of his best friend and confidante, Mary Jane Watson, Peter has a heavy load to bear. But the neophyte Spider-Man is making enemies left and right &mdash; including the Green Goblin, the Kingpin of Crime, Dr. Octopus, Kraven the Hunter and the maniacal Venom &mdash; and unless he can rise to the occasion, he may not survive until prom! Collecting ULTIMATE SPIDER-MAN (2000) #1-39 and #1/2.", "X-Treme X-Men (2001) #10": "To safeguard Storm's enigmatic family heirloom, Gambit and Lifeguard attempt to flee with it while The X-Men do battle with Shaitan!\n", "X-Treme X-Men (2001) #9": "CABLE IS BACK! AND HE'S GOT JUST 24 HOURS TO WIPE THE AVENGERS FROM THE PAGES OF HISTORY!<br> How has Cable been reborn? Where has he been since \"Second Coming\"? And what dark event has driven him to destroy the Avengers? The answers are just the tip of an iceberg that threatens to smash the Marvel Universe to smithereens! <br> A crucial new series by the creators behind SUPERMAN/BATMAN and HULK, Jeph Loeb and Ed McGuinness <br> THE COUNTDOWN TO 2012's STATUS QUO-SHATTERING EPIC BEGINS HERE!", "X-Treme X-Men (2001) #8": "CABLE IS BACK! AND HE'S GOT JUST 24 HOURS TO WIPE THE AVENGERS FROM THE PAGES OF HISTORY!<br> How has Cable been reborn? Where has he been since \"Second Coming\"? And what dark event has driven him to destroy the Avengers? The answers are just the tip of an iceberg that threatens to smash the Marvel Universe to smithereens! <br> A crucial new series by the creators behind SUPERMAN/BATMAN and HULK, Jeph Loeb and Ed McGuinness <br> THE COUNTDOWN TO 2012's STATUS QUO-SHATTERING EPIC BEGINS HERE!", "X-Treme X-Men (2001) #7": "Sebastian Shaw and Lady Mastermind have captured Sage inside an elaborate mind prison. They plan to bring her back into the Hellfire Club whether she likes it or not!", "X-Treme X-Men (2001) #5": "The X-Men discover that Gambit is guilty of a terrible crime! Plus, Gambit and Rogue face off against Red Lotus!", "X-Treme X-Men (2001) #4": "Learn the secret history of Bishop! Meanwhile, Gambit heads to Vargas' castle. What will he find there? And does it have anything to do with Destiny's strange prophecy?", "X-Treme X-Men (2001) #3": "Pyslocke has been slain and Beast is on death's door. Can the X-Men avenge Betsy's death? Plus, Tessa uses a never-before-seen power!", "X-Treme X-Men (2001) #2": "Rogue and Sage set out on a daring rescue mission! But to get to their teammates they will have to go through Vargas first!", "Universe X (2000) #11": "Mephisto's grand plan stands revealed! Find out how and why he has been manipulating the minds of Thanos, Nighthawk, Gargoyle and Dr. Doom.\n", "X-Treme X-Men (2001) #1": "The X-Men in an new X-Treme era! Storm, Bishop, Beast, Psylocke, and Thunderbird have been captured-will Sage be able to rescue them?", "Universe X (2000) #8": "The heroes are on the hunt for the Cosmic Cube, but their search is interrupted once they encounter the Black Panther! Plus, the appearance of the Monster Generation and the mysterious Mr. Church...\n", "Uncanny X-Men (1963) #389": "History of the relationship between Professor X and Moira MacTaggert", "X-Men: Black Sun (2000) #5": "Belasco's plans come to fruition! The necessary souls are collected and the portal between dimensions is almost open! And as the Bloodstones are at last gathered, Thunderbird and Wolverine fight for the lives of the X-Men! Will Magik be the team's savior or their executioner? And just who is she anyway?", "X-Men: Black Sun (2000) #2": "Storm faces off in aerial warfare with the high-flying Angel, who's been possessed by the nasty N'Garai! Meanwhile, the mysterious Magik continues her quest for the Bloodstones, but is she with or against Belasco? Will Phoenix, Beast, Iceman and Polaris be able to stop her? More importantly, should they?", "X-Men: Black Sun (2000) #1": "The demon known as Belasco is burning a path around the globe searching for the legendary Bloodstone. With it, he can rip open a dimensional portal, allowing all of Limbo to pour into our world! Enter Storm, Banshee, Sunfire, Colossus, Nightcrawler, Wolverine and the new mutant who took on the namesake of Thunderbird! But can even this team (that first formed 25 years ago in GIANT SIZE X-MEN #1) stop the fiery fiend from stealing the souls of their most cherished loved ones—the members of the original X-team? All this, plus the return of Magik! But who is the girl in the Eldritch Armor? Is she a friend back from the dead...or a new enemy in disguise?", "Cable (1993) #79": "The \"Revolution\" event hits Cable! Demonic possessions are flaring up, and it's only a matter of time before all Hell breaks loose! Who are the Undying, and what sinister plan is beginning to unfold?", "Earth X (1999) #10": "Black Bolt is Earth X's only hope as Cap's final battle with the Red Skull begins!", "X-Treme X-Men: Savage Land (Trade Paperback)": "The X-Men follow the trail of Rogue's nightmares to a hidden corner of the globe where the great dinosaurs of the Jurassic and Cretaceous Ages continue to rule.", "New X-Men Vol. III: New Worlds (Trade Paperback)": "From the teeming city streets of Mutant Town to the irradiated ruins of the island nation Genosha, once a haven for mutants, the X-Men set out to heal the rift between humanity and Homo superior ' only to uncover a terrifying new threat to both species.", "X-Men: Mutant Massacre (Trade Paperback)": "The vicious Marauders have been employed to wipe out the underground mutant community known as the Morlocks, whose only hope of salvation rests in the hands of the X-Men.", "Earth X (1999) #6": "What has become of Professor Xavier's dream and how does Scott Summers press on?", "X-Men (1991) #91": "Marrow shows off her new found abilities. Rogue finds speaking her mind to be difficult.", "Earth X (1999) #4": "The Red Skull's army grows and Cap has been defeated, physically and spirtually.  But there is a hope for Earth X...", "X-Men (1991) #90": "Magneto Rex ascends to power in Genosha, currying favor from the masses and gaining more following on the ground. Meanwhile, the X-team remains trapped thousands of light years away!", "X-Men (1991) #89": "Poetic irony? The X-Men are freed from one hellish dimension…only to arrive on the Skrull homeworld the night before it’s to be gobbled up by Galactus!", "X-Men (1991) #88": "The mutants…mutated! The X-Men have their powers amplified to freakish levels when they are thrown into a dimension that refutes the laws of physics!", "Peter Parker: Spider-Man (1999) #4": "Spidey’s team-up with the X-Men continues! This time our favorite web-slinger works with Marrow to uncover a mystery of disappearing New Yorkers.", "Wolverine (1988) #134": "WOLVERINE VS. THE MARVEL UNIVERSE! Featuring too many guest stars to name!\n", "X-Men (1991) #84": "THE HUNT FOR XAVIER CONCLUSION Will young Nina be able to reprogram Cerebro? And what should happen is she fails? Professor Xavier is found, and recounts his dream for mutantkind to a sentient, and errant, Cerebro.", "X-Men (1991) #83": "THE HUNT FOR XAVIER PART 4 Cerebrite Alpha launches a psychic attack against the team, preying on personal weaknesses. Humanity awaits 'final programming'. Enter Cerebro Prime.", "X-Men (1991) #82": "THE HUNT FOR XAVIER PART 2 Where is the X-Men's leader and mentor? The team goes searching for answers in an elusive monastery, and encounters a new Alpha-class mutant!", "Avengers (1998) #10": "Wanda delves into her past to learn how to fully resurrect Wonder Man. Meanwhile, at the Avengers Parade, the proceedings are interrupted by the Grim Reaper and the Legion of the Unliving.", "X-Men (1991) #80": "Joe Kelly celebrates the 35th Anniversary of the X-Men! Witness the formation of an all-new mutant team. Plus, the mystery behind the ‘evil X-Men’ reaches a head.", "X-Men (1991) #79": "Mastermind tricks the X-Men into believing the Dark Phoenix has arisen once more!", "X-Men (1991) #78": "Could this be Psylocke's last stand? Behold the psychic ninja and the Shadow King in hand-to-hand combat on the Astral Plane!", "X-Men (1991) #75": "An investigation into Wolverine's autopsy leads to the discovery of an alien race out to conquer Earth!", "X-Men (1991) #71": "At the Xavier Institute, the X-Men begin a relatively quiet day!", "Uncanny X-Men (1963) #350": "Gambit's darkest secrets revealed!", "X-Men (1991) #70": "The crew must band together to save Cyclops…but the X-Men stand divided!", "Wolverine (1988) #118": "When the X-Men’s newest friend gets activated as a Prime Sentinel, Wolverine decides the best thing to do is evacuate!  But when Cyclops gets hit in the crossfire, we discover there may be a few casualties in this war.", "Wolverine (1988) #117": "When the X-Men realize that innocent people are being turned into Prime Sentinels, they take action. And finally—the return of Jubilee!", "Wolverine (1988) #116": "After the X-Men escape from Bastions base, Wolverine makes a huge discovery and reveals the secret of the Prime Sentinels!", "Wolverine (1988) #115": "When the X-Men are taken prisoner by Zero Tolerance, it's up to an injured Wolverine to save the day!", "X-Men (1991) #66": "Ice Man returns!", "X-Men (1991) #65": "The team is beaten by Bastion, and all of Professor Xavier’s secrets threaten to be exposed.", "X-Men (1991) #64": "What will the X-Men do with the cure for the Legacy Virus?", "X-Men (1991) #63": "The X-Men take on Shinobi Shaw!", "X-Men (1991) #62": "Shang-Chi teams with the X-Men to investigate Sebastian Shaw and his research into a cure for the Legacy Virus. Will Shaw and the Hellfire Club use a possible cure to save mutantkind or use it to make an enormous profit?", "X-Men (1991) #61": "Cyclops arrives with the cavalry to save Storm from Candra’s “magic show”. Who will possess the soul gem by the end of this issue?", "X-Men (1991) #60": "Storm is caught up in a whirlwind from her past as a thief...the eternal Candra comes calling!", "X-Men Unlimited (1993) #12": "Cain Marko thought he was in control of the Cyttorak…until the gem claims him for itself! Juggernaut is filled with all the rage -- but has nowhere to channel it!", "Uncanny X-Men (1963) #335": "Apocalypse awakens and consults the Watcher. And Onslaught gathers his minions!", "X-Force (1991) #51": "Warpath has a shadowy (and romantic) encounter with a mutant who seems like trouble. Boom-Boom gets a daring new look, and Siryn can’t quite get Deadpool out of her head. What’s going on there?!", "X-Men (1991) #48": "Since Bishop is the only one who remembers the Age of Apocalypse, Sugar Man and Dark Beast decide they must eliminate the X-Man for good.", "Wolverine (1988) #96": "Logan and his fellow X-Men go camping! Stories are swapped ‘round the campfire, and Wolverine reflects on past heartache. Cyber finds himself at the wrong end of a feeding frenzy!", "X-Force (1991) #48": "The team gives Boomer an intervention about her constant visits to Sabretooth and how it could put herself and everyone in danger. Will the wise words finally change her mind? Or will it just add fuel to the fire in her strange addiction?", "Cable (1993) #23": "Cable goes to Professor X with an important request - help Nathan track down his wayward son, Tyler Summers! Plus, a murder investigation brings Domino face to face with an old friend!", "X-Men (1991) #42": "Amelia Voght turns to Scott and Jean for help!", "X-Men: Prime (1995) #1": "The Age of Apocalypse has ended...but what new threats await the X-Men, X-Factor, X-Force and all mutants?  Plus, what Age of Apocalypse heroes and villains have crossed over to our reality?", "X-Men Chronicles (1995) #2": "Age of Apocalypse! Wolverine versus the X-Men! Plus, a love triangle forms between Rogue, Gambit, and Magneto!", "X-Men Chronicles (1995) #1": "Age of Apocalypse! See the X-Men like you've never seen them before. Magneto has assembled a roster of brave mutants to usher in an age of peaceful coexistence between humanity and mutantkind. But there are those who wish to see humanity enslaved! Enter Apocalypse!", "X-Men: Alpha (1995) #1": "The Age of Apocalypse starts here!  Witness the birth of a whole new era for the X-Men. ALPHA kicks off Astonishing and Amazing X-Men and sets the stage for everything that is to come!", "X-Men (1991) #41": "The Age of Apocalypse begins in the present while Professor Xavier plays his part in the past.", "Rogue (1995) #1": "Rogue visits her first boyfriend who she put into a coma when her powers first arose. Little does she know that Bella Donna Boudreaux, ex-wife of Gambit, has dastardly plans for the two of them.", "X-Men (1991) #40": "Legion captures and blasts the X-Men 20 years into the past!", "Bishop (1994) #1": "Bishop and Storm’s night at the theater is interrupted when Bishop's old acquaintance Bantam approaches them - with a malicious mutant named Mountjoy on his tail!", "Cable (1993) #18": "The chase of the Dark Riders is on! Cable, Domino and Storm are on the Riders' trail when they are suddenly transported to the scene of a massacre! Who is responsible for this horror, and how is Cable's son Tyler connected to it all?", "X-Men Unlimited (1993) #7": "The X-Men go their separate directions and split up! But why?", "Cable (1993) #17": "THE DARK RIDE begins here! Cable and Domino visit the X-Men, but reunions are cut short by the appearance of the Dark Riders! What are the Riders after, and who is behind their resurgence?", "Cable (1993) #16": "The X-Men vs. the Phalanx! Along with Cyclops, Jean Grey, and Wolverine, Cable stages an all-out assault on the Phalanx citadel! Can they take it down, or is all of mutantkind doomed to assimilation?", "X-Force (1991) #38": "Forge reveals that a major techno-organic Phalanx embryo is about to erupt.", "X-Men Unlimited (1993) #5": "A Shi’ar envoy more or less kidnaps all the X-Men present – in this case Xavier, Storm, Forge and Jubilee – as they are expected to appear at an official royal function on the recently annexed Kree homeworld, Hala!", "X-Men (1991) #28": "Sabretooth's imprisonment at the X-Mansion raises concerns for the team.", "X-Men Annual (1991) #3": "The X-Men attempt to rescue Storm from Shinobi Shaw. Meanwhile, Hydra holds Banshee’s old Interpol pal hostage!", "Uncanny X-Men (1963) #307": "Beast, Xavier and USAgent defend themselves against the Genoshan Magistrates. Meanwhile, Sersi and Exodus battle it out while Quicksilver and Jean Grey look for a way into Genosha's capitol to save Luna from Cortez's clutches.", "X-Men (1991) #26": "Working against the clock, the X-Men fly to Genosha to help Xavier. During the journey Colossus must make a difficult decision concerning where his loyalties lie. Meanwhile, Xavier and Beast must bide their time by fighting against new enemies.", "Doctor Strange, Sorcerer Supreme (1988) #55": "Infinity Crusade crossover! Dormammu tries to persuade Doctor Strange to be his channel into another dimension, because the Dread One is so afraid of The Goddess!", "X-Men (1991) #21": "A Tale of Two Psylockes! The team meets the Silver Samurai in Japan!", "X-Men Unlimited (1993) #1": "IT'S ALL ABOUT SURVIVAL! Cyclops, Storm, and Prof. X are trapped in the Antartic by Siena Blaze in a plot to kill them in the Upstart's game.", "X-Men (1991) #20": "Psylocke reveals that she's an impostor! How did Jean get her to confess?", "X-Force (1991) #19": "Members of X-Force are ready to break free! Meanwhile, Sunspot broods over the fate of X-Force, and Cannonball has a heated conversation with Professor X.", "X-Men (1991) #17": "Colossus is reunited with his family in Russia!", "X-Men (1991) #16": "X-CUTIONER'S SONG Part 11. The X-Men launch their attempt to rescue Cyclops and Jean Grey from Stryfe's secret moon base. Just what are the connections between Cyclops, Jean, Cable, and Stryfe?", "X-Factor (1986) #86": "X-CUTIONER'S SONG Part 10. The lives of the X-Men are in the hands of their enemies! Apocalypse may be the only one who can save Professor X from the Techno-Organic Virus, while Cyclops and Jean Grey are at the mercy of Stryfe.", "Uncanny X-Men (1963) #296": "X-CUTIONER'S SONG Part 9. Cyclops and Jean Grey struggle to escape the deadly clutches of Stryfe, while the other X-Men find themselves in one of their most shocking alliances ever!", "X-Men (1991) #15": "The X-Men, X-Force and X-Factor team up!", "X-Factor (1986) #85": "X-CUTIONER'S SONG Part 6. The machinations of some of the deadliest X-enemies are revealed, and members of multiple X-teams face down the Mutant Liberation Front.", "Uncanny X-Men (1963) #295": "X-CUTIONER'S SONG Part 5. The mystery surrounding the attempt on Xavier's life unravels as Apocalypse plans his next move.", "X-Men (1991) #14": "X-CUTIONER'S SONG Part 3. Apocalypse awakens! The X-Men organize into two teams in order to rescue Cyclops and Jean Grey and locate X-Force.", "Uncanny X-Men (1963) #294": "X-CUTIONER'S SONG Part 1.  The X-Men are assaulted by the Horsemen of Apocalypse! Meanwhile, a deadly assassin aims his sights at Professor X!", "X-Men (1991) #5": "The Hand's plans for Omega Red have blown up in their face! Their would-be weapon has ditched his mission for an all-out grudge match with Wolverine and his team of X-Men.", "X-Men (1991) #3": "It's X-Man against X-Man as Magneto's Acolytes brainwash the Children of the Atom for their own amusement.  Will Nick Fury be able to pull out a last minute save?", "X-Men (1991) #2": "After their assault on Asteroid M, the X-Men stand....defeated?!  Meanwhile, a dark secret from Magneto's past emerges that makes everyone question the depth of his evil.", "X-Men (1991) #1": "It's the X-Men vs. Magneto, Master of Magnetism!  The X-Men's oldest enemy is back and it's going to take everyone in the X-Men have to bring him down. A Marvel classic from Chris Claremont and Jim Lee!", "X-Factor (1986) #70": "After the fight with the Shadow King, Legion is in a coma and Xavier attempts to wake him up!", "X-Factor (1986) #69": "The Shadow King has taken over the minds of the X-Men! Can they escape the mind control without any help?", "Wolverine (1988) #39": "A rough exterior, but a warm heart. Wolvie has always been known for his dual sides, but this time we see his good intentions may be used against him…", "Uncanny X-Men (1963) #272": "The captured X-Men are on trial in Genosha, forced either to voluntarily become mindless mutates or face death at the hands of Cameron Hodge!", "Uncanny X-Men (1963) #271": "Wolverine and Psylocke infiltrate the citadel disguised as Magistrates, only to find themselves facing off against former X-Man Havok and the monstrous Cameron Hodge!", "New Mutants (1983) #95": "The New Mutants have been captured by the Magistrate Pipeline, and have had their powers taken by the Magistrate Wipeout. Will everyone make it through their escape from the citadel alive?", "Uncanny X-Men (1963) #270": "Storm's child body may be permanent, which doesn't bode well for the X-Men, as the Genoshan troops are on the offensive-with Havok on their side?!", "Wolverine (1988) #17": "Roughouse is abducted by a sinister cyborg, but Wolverine won't let a good sparring partner go that easily! Guest-starring Daredevil, the Man Without Fear!", "Classic X-Men (1986) #39": "Storm meets a new fellow mutant, but when she rebuffs his advances, it turns to battle!  Wolverine and Colossus show up to assist, but it leads to a deadly choice for Ororo.  Note: the issue does not include the reprint of Uncanny X-Men #133.", "Uncanny X-Men (1963) #243": "While Beast and Longshot get people to safety, Jean Grey battles Mr. Sinister on the psychic plane! As Sinister attempts to destroy every single memory that Jean has, Jean must integrate the personalities of both the Phoenix and Madelyne.", "Uncanny X-Men (1963) #242": "The X-Men defend the Goblyn Queen-who is disguised as Maddie-from X-Factor! Can the two teams discover the queen's ruse in time to stop her?", "X-Men Annual (1970) #13": "Jubilee may have bitten off more than she can chew when she agreed to join the X-Men. The teenage mutant and the X-team are in a battle for their lives at their Australian Outback base. And this time the X-men are facing the double threat of Mr. Jip and the Serpent Society!", "Uncanny X-Men (1963) #237": "Rogue and Logan have lost their powers-can they survive long enough for the X-Men to make it to Genosha?", "Uncanny X-Men (1963) #238": "Madelyne Pryor harnesses the Phoenix Force, and the X-Men siege the Magistrate citadel!", "Uncanny X-Men (1963) #235": "The Genoshan Press Gang goes to Australia to retrieve a former Genoshan nurse whose mutant gene has awoken. Who will be ensnared in their net along the way?", "Uncanny X-Men (1963) #227": "The X-Men must fight their way through a demonic distortion of the Vietnam War in order to reach their final showdown with the Adversary! Colossus returns to help his former teammates, but will that be enough?", "Uncanny X-Men (1963) #226": "With each team holding members of the other team captive, the X-Men and the Freedom Force are at an uneasy stalemate. But when the Adversary's chaos begins tearing Dallas asunder, the two teams must cooperate to save the innocent-and themselves!", "X-Men Annual (1970) #12": "The Savage Land has been decimated! The X-Men and High Evolutionary have a huge project ahead of them…but of course Garrok has to make things even more difficult, right?", "X-Factor Annual (1986) #3": "Members of X-Force all receive the same distress call! Jean decides to lead the investigation.", "Uncanny X-Men (1963) #223": "Destiny senses a terrible fate for the X-Men-and the world! Meanwhile, Storm is forced to fight supernatural animals without the help of a debilitated Nazà©, and even encounters Forge...but are things really as they appear?", "Uncanny X-Men (1963) #220": "Storm tasks Wolverine with taking over as leader of the X-Men while she searches for Forge to get him to return her powers. But where is Forge, and why does Nazà© want to find him so badly?", "New Mutants (1983) #51": "Professor Xavier is completely conflicted when he learns the truth behind the Mutant Massacre!", "Uncanny X-Men (1963) #213": "While Wolverine battles Sabretooth in the Mansion, Malice takes complete control of Dazzler and reveals her mutant identity to the public. Can the X-Men extract vital information from Creed while he battles Wolverine? Can Dazzler fight off Malice?", "Uncanny X-Men (1963) #211": "The Marauders have begun to exterminate the Morlocks in the abandoned subway tunnels beneath New York. After, a injured Morlock escapes and makes his way to the Mansion to enlist the X-Men's help. Prepare for the X-Men vs. Riptide!", "Marvel Fanfare (1982) #23": "Doc Ock and one set of armored tentacles is bad enough, but when he's got two sets, and one of them is adamantium — what can Iron Man do?", "Secret Wars (1984) #12": "NOTHING TO FEAR The heroes have defeated their enemies--all save one. Now, with the stolen power of The Beyonder himself, Doctor Doom strikes! Who can stop him now?", "Secret Wars (1984) #11": "...AND DUST TO DUST The penultimate chapter of SECRET WARS is here! The face of Doom is revealed!", "Secret Wars (1984) #10": "DEATH TO THE BEYONDER Though the heroes have successfully driven Galactus away, they find that their seeming victory has only sealed their fate.", "Secret Wars (1984) #9": "ASSAULT ON GALACTUS As the heroes make their last ditch effort against Galactus, Doctor Doom seizes the opportunity to grind them all under his heel.", "Secret Wars (1984) #8": "INVASION As the battle-weary heroes recuperate and repair their gear, Spider-Man makes make a discovery that will change his life and his costume!", "Alpha Flight (1983) #17": "Heather Hudson becomes the new leader of Alpha Flight!", "Secret Wars (1984) #7": "BERSERKER The death of an Avenger! The X-Men's greatest battle! And, introducing the all-new Spider-Woman!", "Secret Wars (1984) #6": "A LITTLE DEATH Galactus prepares to destroy both the heroes and the villians! Now, as both sides of the engagement plan their next move, two MIA soldiers make their return!", "Secret Wars (1984) #5": "THE BATTLE OF THE FOUR ARMIES The villains have the upper hand! As they plan their final strike, Galactus' mysterious vigil comes to a surprising end...", "Secret Wars (1984) #4": "SITUATION: HOPELESS The heroes' HQ has been destroyed! Thor has been captured by Enchantress and taken straight to the villains! Doctor Doom scores his first kill!", "Secret Wars (1984) #3": "TEMPEST WITHOUT, CRISIS WITHIN Doctor Doom creates two new villains Called Volcana and Titania to take the heroes down! Meanwhile, Spider-Man battles the X-Men!", "Secret Wars (1984) #2": "PRISONERS OF WAR Doctor Doom brings Ultron back online to battle the champions of Earth! Meanwhile, Magneto takes the lone-wolf route!", "Secret Wars (1984) #1": "THE WAR BEGINS Earth's heroes have been whisked away to a mysterious construct in space, but they are not alone. Earth's villains have also appeared. Who is to blame for this meeting of good and evil?", "X-Men Annual (1970) #8": "Fairytales ‘round the campfire with Marvel’s mightiest mutants! Illyana spins a tale about Kitty Pryde and her Space Dragon Lockheed. Wolverine and Nightcrawler also make an appearance - as heroes taking on the White Queen and Black King!\n", "Uncanny X-Men (1963) #167": "The New Mutants, The Starjammers, and the X-Men must band together to save a Brood-infected Professor X once the Brood begins to take hold? Can their mentor be saved or will he die by their hands?", "X-Men Annual (1970) #7": "The Impossible Man unleashes his unique brand of chaos in the Marvel Office…and the X-Men are in fast pursuit! Plus, what’s become of Zabu, Ka-Zar's sabretooth tiger? Professor X and his band of mutants seek answers- and take names!", "Wolverine (1982) #4": "Wolverine, in solo combat with Lord Shingen! Yukio, the captive of her\nformer employer! Lord Shingen, armed with a sword and determined to\nprove to Mariko once and for all that Wolverine is not a fit mate for\nher! The Hand, surrounding the grounds and ready to fight to the death!\nGuest-starring the X-Men!", "X-Men Annual (1970) #6": "Storm, under the possession of Dracula! See what happens when the X-Woman loses control over her body and mind. Will young Shadowcat be able to save her mentor? Witness Kitty Pryde at her plucky best as she rouses the X-Men to save Storm from the grip of Dracula!", "Uncanny X-Men (1963) #143": "When Kitty Pryde is left behind at the mansion alone, she's attached by a N'garai demon. Can the newest X-Man handle the villain all by her lonesome?", "Uncanny X-Men (1963) #142": "In the present, the X-Men fight against the Brotherhood of Mutants. In the future, they battle the deadly mutant-killing Sentinels. And linking these two worlds, these two desperate battles, is Katherine Pryde. The fate of mutantkind is in her hands!", "Uncanny X-Men (1963) #141": "Journey into the dystopian future  - where Sentinels stalk the Earth, and the X-Men are humanity's only hope...until they die!", "X-Men Annual (1970) #5": "The X-Men versus the hordes of the Badoon! When a galactic threat looms over the merry mutants, the team calls in the aid of experts- the Fantastic Four! Meanwhile, Storm can’t shake her feelings for Arkon, and her need to end the battles in his home world. Can the X-Men and the Fantastic Four usher in an age of peace between two warring alien races?", "Uncanny X-Men (1963) #140": "Wendigo continues to wreck havok and its up to Alpha Flight and the X-Men to bring the beast down. And introducing the New Brotherhood of Evil Mutants.", "Uncanny X-Men (1963) #139": "Welcome to the X-Men Kitty Pryde...hope you survive the experience.  Plus, Alpha Flight shows up looking for Wolverine.", "Uncanny X-Men (1963) #138": "Following the events of the Dark Phoenix Saga, the X-Men lay Jean Grey to rest.  After losing the woman he loves, Cyclops quits the X-Men -", "Uncanny X-Men (1963) #137": "THE FATE OF THE PHOENIX! It's the Shi'Ar versus the X-Men in an epic duel on the blue area of the Moon! Winner decides the fate of the Dark Phoenix! Can Cyclops save his love? Or is she doomed to die at the hand of the Shi'Ar?", "Uncanny X-Men (1963) #136": "CHILDREN OF LIGHT AND DARKNESS! The Dark Phoenix has defeated the X-Men. Who remains with the power to oppose her? In a last ditch effort, Professor X enters the fray!", "Uncanny X-Men (1963) #135": "DARK PHOENIX! Jean Grey has become the Dark Phoenix, a corruption of the cosmic entity bonded to Jean. Now the Dark Phoenix seeks to destroy everything in its path! What can the X-Men do to defeat it? Must they kill Jean Grey?", "Uncanny X-Men (1963) #134": "TOO LATE, THE HEROES! Cyclops has survived! The X-Men retaliate against the Hellfire club-this time, with the power of the Phoenix on their side. But not everything is as it seems with Jean. Enter: Dark Phoenix!", "Uncanny X-Men (1963) #133": "WOLVERINE ALONE! Cyclops desperately tries to reach out Jean and bring her out of her dark transformation. But Mastermind has other plans and attacks Cyclops on the astral plane! Can Scott survive death in this psychic realm?", "Uncanny X-Men (1963) #132": "AND HELLFIRE IS THEIR NAME! Using Angel's Hellfire Club membership, the X-Men infiltrate a club event, only to be met with extreme force. Can the X-Men survive this battle? Will Jean finally become the Black Queen?", "Uncanny X-Men (1963) #131": "RUN FOR YOUR LIFE! The X-Men have rescued Kitty Pryde. Now it is time to take the fight to the White Queen and recue their comrades. Prepare for a psychic battle between Emma Frost and Phoenix!", "Uncanny X-Men (1963) #130": "DAZZLER Phoenix and Cyclops are on the hunt for a new mutant when they are attacked by a group of Mandroids who are eerily familiar with their power sets. Plus, Kitty Pryde escapes!", "Uncanny X-Men (1963) #129": "GOD SPARE THE CHILD... Kitty Pryde has been offered scholarships at both the Xavier Institute and Emma Frost's Massachusetts Academy. Where will she go? Plus, the X-Men engage...the Hellfire Club!", "X-Men Annual (1970) #4": "When the X-Men enter Nightcrawler's Inferno, they'll need the help of the Sorceror Supreme Doctor Strange to escape!", "Uncanny X-Men (1963) #128": "Proteus has taken Moira hostage while the X-Men wage their final assault-this time, with designs on taking the evil mutant down for good. Will the combined might of the X-Men be enough to defeat Proteus and save Moira?", "Uncanny X-Men (1963) #127": "In a bid to escape Muir Island, Proteus is moving from body to body, all the while pitting the X-Men against one another. What will it take to stop this Omega-level mutant? If it means taking Proteus out for good, are the X-Men willing to go that far?", "Uncanny X-Men (1963) #126": "The X-Men-in response to Lorna's call for help-are en route to Muir Island. What will they find there? And what happens when they learn that Mutant X has escaped?!", "Uncanny X-Men (1963) #125": "Jean Grey is alive and well on Muir Island. When Cyclops learns the news of this, he also discovers that the security on Muir Island has been breached and that Lorna is in grave danger! How will the X-Men respond?", "Marvel Team-Up (1972) #53": "NIGHTMARE IN NEW MEXICO! Spider-Man along with Banshee find themselves in the secret town of Liberty, New Mexico to cover the impending fight between Hulk and Woodgod. Spider-Man's demand for answers suddenly gets him caught in between the battle. Will he come out unscathed? The story continues in the next issue…\n"}