{"Marvel 2-In-One Vol. 2: Next Of Kin (Trade Paperback)": "Collects Marvel 2-In-One (2017) #7-12, Annual #1. Powerless and lost, Ben Grimm and Johnny Storm must fight for their survival in a savage wasteland ruled by…the Spider! Will this dreaded enemy destroy them — or will the shocking revelations they face do it first? Then, it’s a new life in a new town on a strange world. Everything has changed for the broken people once known as the Thing and the Human Torch. But can they repair things before one of their oldest villains puts the final nail in the coffin of the Fantastic Four? Wait, did someone mention the FF? They’re back! But there’s something not quite right about them. Plus: The Thing and his oldest enemy in new armor — the Infamous Iron Man! And the 2-IN-ONE team-up you’ve all waited years for!", "Marvel 2-in-One (2017) #12": " Our heroes were betrayed and left for dead, but now that the FANTASTIC FOUR are back, where’s RACHNA KOUL? The HUMAN TORCH and INVISIBLE WOMAN will soon find out, provided they can get past THE MOLE MAN! ", "Marvel 2-in-One (2017) #9": "THE FANTASTIC FOUR are BACK!  But there’s something quite off about them…Ben and Johnny, powerless and stranded, are in the fight of their lives as NEXT OF KIN continues!", "The Thing & The Human Torch By Dan Slott (Trade Paperback)": "Collects Spider-Man/Human Torch #1-5 and The Thing (2005) #1-8.\n\nDan Slott takes on half of the Fantastic Four — and, naturally, the ever-amazing writer brings Spider-Man along for the ride! First, the Human Torch and Spidey's unique friendship is explored across five adventures in different eras. From high school to adulthood, from the Coffee Bean to the Negative Zone, from Dorrie Evans to Mary Jane Watson, it's the ultimate team-up of flamebrain and web-head! Then, the ever-lovin' blue-eyed Thing takes the spotlight! The idol of millions is now worth billions, and he's enjoying his newfound riches — not to mention the odd game of poker — with pals including the FF, Goliath, Hercules, Lockjaw and, yes, Spider-Man! But fear not — bashful Benjy has reserved some clobberin' for foes like Arcade, Shockjock and classic sparring partners Trapster and Sandman!", "The Human Torch & The Thing: Strange Tales - The Complete Collection (Trade Paperback)": "Collects Strange Tales Annual #2 and material From Strange Tales (1951) #101-134. After the Fantastic Four’s groundbreaking debut, readers couldn’t get enough of Marvel’s innovative new heroes — especially the Human Torch! So Stan Lee and Jack Kirby gave the fiery teen sensation his own series in the pages of STRANGE TALES! After a hot streak of solo stories, the Torch was joined by the ever-lovin’ blue-eyed Thing, and the two teammates tackled some of the wildest ne’er-do-wells of the Silver Age: the Wizard, the Sandman, the Rabble Rouser, Plantman and the one and only Paste-Pot Pete! Also featuring Marvel’s first fire-and-ice battle between the Torch and the X-Men’s Iceman — and guest stars Spider-Man, Mister Fantastic and the Invisible Woman!", "Marvel 2-in-One (2017) #8": "A new life in a new town on a strange world. Everything has changed for the broken people once known as BEN GRIMM and JOHNNY STORM. But can they repair things before one of their oldest villains puts the nail in the coffin of THE FANTASTIC FOUR?", "Marvel 2-In-One Vol. 1: Fate Of The Four (Trade Paperback)": "Collects Marvel 2-In-One (2017) #1-6. A classic title from Marvel’s storied history is back at last — and it’s fantastic! With Reed and Sue Richards gone and presumed dead, Johnny Storm and Ben Grimm reunite in a bid to find their new place in the Marvel Universe. But something is wrong with the Human Torch, and only the Thing can help him! And what monumental secret has Victor Von Doom been hiding — and how will it completely change the lives of Ben and Johnny?! Prepare for things to go Multiversal as the Thing and the Torch explore the Fate of the Four! It’s the reunion you’ve been waiting for — well, half of it, at least — in the world’s new greatest comic magazine!", "Moon Girl and Devil Dinosaur Vol. 5: Fantastic Three (Trade Paperback)": "Collects Moon Girl And Devil Dinosaur #25-30. When the Silver Surfer comes to Manhattan with a warning about an ancient cosmic menace on a collision course with Earth, you’d better listen up! But without the First Family of the Marvel Universe around to answer the call, who’s going to step up and solve the impossible? Lunella Lafayette, that’s who! Without Devil Dinosaur by her side, Lunella must join forces with some new friends who are missing their pals, too: the Human Torch and the Ever-Lovin’ Blue-Eyed Thing! You don’t want to miss the debut of the Fantastic Three! Galactus and the Silver Surfer certainly won’t! But who will join the ranks of Lunella’s group to complete a truly awesome foursome?", "Marvel 2-in-One (2017) #7": "Powerless and lost, Ben and Johnny fight for their survival in the wasteland ruled by … THE SPIDER. But will the Spider destroy them first…or will the shocking revelations?", "Marvel 2-In-One Annual (2018) #1": "THE THING AND THE INFAMOUS IRON MAN – UNRAVELING THE SECRETS OF SECRET WARS! There is but one place in the Multiverse where VICTOR VON DOOM holds no sway. A spot where even DOOM can be judged and tamed. A place that houses…THE COUNCIL OF REEDS. Can Doom escape with his life in order to save BEN & JOHNNY?", "Marvel 2-in-One (2017) #6": "A mad final gambit against the death of a universe! Ben and Johnny join forces with familiar friends, but will DOOM ruin everything? THE FATE OF THE FOUR will be determined here!", "Marvel Masterworks: Marvel Team-Up Vol. 3 (Hardcover)": " Collects Marvel Team-Up (1972) #23-30 and Giant-Size Spider-Man #1-3. With his popularity skyrocketing, Spider-Man became comicdom’s top seller — and fans wanted more, more, more! MARVEL TEAM-UP provided a second monthly dose of Spidey action with the added bonus of a new heroic guest star every issue. When even that wasn’t enough, Marvel launched GIANT-SIZE SPIDER-MAN, featuring double-sized extravaganzas! And lucky you, they’re both being collected here! The action includes adventures with Daredevil, Shang-Chi and the Falcon; horrific tales featuring Dracula and Brother Voodoo; and Spidey vs. the Hulk! And while Spider-Man takes the stage in GIANT-SIZE, the Human Torch teams up with Thor, Iron Man and the X-Men! It’s all brought to you by some of the greatest writers and artists Spidey has ever known! ", "Moon Girl and Devil Dinosaur (2015) #30": "A FANTASTIC RETURN! Who stands between Earth and a world-devouring menace? An All-New, All-Different Fantastic Four with plenty of LEGACY…Plus! AN APPEARANCE BY 2018’S MOST REQUESTED CHARACTER!", "Marvel 2-in-One (2017) #5": "The Multiverse itself is on the brink of destruction! Ben and Johnny rise up to and stop the ultimate threat of two of their greatest foes!", "Moon Girl and Devil Dinosaur (2015) #29": "MOON GIRL, THE THING and HUMAN TORCH bond to become a new team of heroes to battle a world-destroying threat! But are they enough? H.E.R.B.I.E.? SILVER SURFER? Even the towering titan GALACTUS? Who will join them?!", "Marvel 2-in-One (2017) #4": "FATE OF THE FOUR Part 3! Ben and Johnny begin the search for their lost family! But the universe they’ve landed in may not last long enough!", "Peter Parker: The Spectacular Spider-Man (2017) #300": "An oversized anniversary epic, told the only way your pre-eminent pals in the Spidey-Office know how — in the Mighty Marvel Manner! For weeks, the Tinkerer has been launching a campaign against his do-gooder brother, the Mason, and Spidey’s nearly met his maker more than once trying to stop their sibling rivalry! With a little help from a tech-heavy team of Marvel heroes, Spider-Man takes the fight directly to Tinkerer! But Tinkerer’s got tech of his own…and it’s out of this world!", "Moon Girl and Devil Dinosaur (2015) #28": "FANTASTIC THREE PART 4! Smarter than MOON GIRL? Stronger than the THING? Hotter than the HUMAN TORCH? What mystery man can outmatch Marvel’s newest hero family? The FANTASTIC THREE are put to the test, and this is one exam LUNELLA LAFAYETTE — the Smartest There Is — might not pass (at least not with a little help)!", "Marvel 2-in-One (2017) #3": "Flame off! Johnny Storm is losing his powers, but why? And who is the mysterious woman who says she can help? Plus: The MAD THINKER and DOOM square off over REED RICHARDS as “THE FATE OF THE FOUR” continues!", "Moon Girl and Devil Dinosaur (2015) #27": "FANTASTIC THREE PART 3. Who’s behind the stretchy, fiery, wispy and rocky thefts going on all around town? Has the Fantastic Four turned to a life of crime – waitaminute, there ain’t no more FF anymore! It’s all up to Lunella Lafayette to solve the case!", "Marvel 2-in-One (2017) #2": "THE FATE OF THE FOUR Part 2. What is THE SECRET OF REED RICHARDS? And is it deep within MONSTER ISLAND? Ben and Johnny are the only ones who can uncover it, unless DOOM beats them to it! THE FATE OF THE FOUR continues here!", "Avengers: Tales to Astonish (Trade Paperback)": "Collects Tales to Astonish (1994) #1, Strange Tales (1994) #1, Tales of Suspense (1995) #1. Classic comic book titles from the past inspire fully painted Marvel masterworks featuring some of the world's greatest heroes! When a sadistic killer who claims to be descended from Loki goes on the rampage, it will take three Avengers to face a mad Viking - Hank Pym, the Wasp and the Hulk! Things take a turn for the monstrous in stories featuring Doctor Strange, the Thing, Human Torch and Nick Fury! And old friends Captain America and Iron Man are recruited by S.H.I.E.L.D. to stop a deadly new terror threat using Stark technology! Celebrate the heroic legacy of the Marvel Age of Comics with these strange tales of suspense guaranteed to astonish!", "Marvel 2-in-One (2017) #1": "THE FOUR ARE NO MORE, SO TWO MUST DO! Something is very wrong with THE HUMAN TORCH and only THE THING can help him! It’s the Marvel Universe reunion you’ve all been waiting for (well, HALF of it, at least!). Plus: What monumental secret has DOOM been hiding since the end of SECRET WARS, and how will it completely change the lives of Johnny Storm and Ben Grimm?", "Uncanny Avengers (2015) #30": "Love, loss, and the road ahead. Where does the Unity Squad go from here?", "Peter Parker: The Spectacular Spider-Man Vol. 1 - Into the Twilight (Trade Paperback)": "Collects Peter Parker: The Spectacular Spider-Man (2017) #1-6 and material from Free Comic Book Day 2017 (Secret Empire) #1. Spider-Man is back in his friendly neighborhood! The wall-crawling wonder returns to New York City, going back to basics for big heroics in the Big Apple while taking on threats old and new! A crime ring is tightening around Spidey, and Ironheart could help him zero in on the source - if only she'd stop beating him up. When Spider-Man's old pal, the Human Torch, joins in on the trail of terrifying tech, the web-head and flame-brain will be led to...Wilson Fisk! And they'll find out that the former Kingpin of Crime is still a force to be reckoned with! Plus: What is jolly J. Jonah Jameson up to these days? And Spider-Man's newest ally, the Mason, falls prey to the Vulture!", "Moon Girl and Devil Dinosaur (2015) #25": "FANTASTIC THREE Part 1. When THE SILVER SURFER comes to Manhattan with a warning about an ancient cosmic menace on a collision course with Earth, you better listen up! But without the First Family of the Marvel Universe around to answer the call, who’s going to step up and solve the impossible? Lunella Lafayette, that’s who! Without Devil Dinosaur by her side, Lunella must join forces with some new friends who are missing their pals, too: THE HUMAN TORCH! THE EVER-LOVIN’ BLUE-EYED THING! DON’T MISS THE RETURN OF THE FANTASTIC THREE! PLUS: Includes 3 bonus MARVEL PRIMER PAGES!", "The Amazing Spider-Man (2015) #790": "THE FALL OF PARKER Part 1. Down on your luck Peter Parker is back, for good or ill. New York has changed, and so has Peter – but entering a new phase of his Spider-Man life isn’t easy; neither are new relationships OR new foes. Peter Parker is not the Spider-Man you remember, but why is he taking his fight to THE DAILY BUGLE? And what happened to PARKER INDUSTRIES? PLUS: Includes 3 bonus MARVEL PRIMER PAGES! Story by Robbie Thompson and art by Mark Bagley!", "Uncanny Avengers (2015) #28": "When it comes to super heroics, Wonder Man and the Beast have seen it, done it, got the t-shirt. When the world throws you cosmic conflict, global calamity, death, rebirth and heartache aplenty, it's important to remember where your friends are. Join us for \"A Pint or Two\", won't you?", "Doctor Strange Epic Collection: Afterlife (Trade Paperback)": "A new look for Strange - but will it be his last? The Sorcerer Supreme has a youthful appearance, yet he's still taking care of business - including Nightmare's hunt for an heir! But long hair and dark glasses don't suit a man as urbane as Stephen Strange. It's time for a dapper new wardrobe and a new source of power: catastrophe magic! Which is fi tting, given what arch-foe Baron Mordo has in store. Mordo has had a profound impact on Strange's life - and now the villain is plotting his death! Plus: In an award-winning classic, discover what disturbs Stephen! And a particularly Strange Tale unites the Sorcerer Supreme with the Thing and Human Torch! Collects Strange Tales (1994) #1, Doctor Strange, Sorcerer Supreme #76-90, Ashcan Edition; Doctor Strange: What Is It That Disturbs You, Stephen?", "Uncanny Avengers (2015) #27": "It's hard to take a stand when the world keeps spinning...", "Uncanny Avengers (2015) #26": "THE WITCH IS BACK! Wanda Maximoff has returned to the Avengers at last! But not everyone on the team is happy about it - At the same time, an old foe returns and our heroes' lives are thrown upside down!", "Peter Parker: The Spectacular Spider-Man (2017) #3": "Spider-Man and the Human Torch are following a trail of terrifying tech, and the trail takes them to - WILSON FISK?! The former Kingpin of Crime is still quite a force to be reckoned with - but what is HIS connection to all this?", "Uncanny Avengers (2015) #25": "SECRET EMPIRE TIE-IN! Manhattan is under siege! In order to survive this endless night, the Avengers must face darkness without and darkness within...", "Uncanny Avengers (2015) #24": "SECRET EMPIRE TIE-IN! Tricked by Hydra, trapped in a prison they never anticipated, the Uncanny Avengers have a cunning escape plan...but it might just make things even worse!", "Uncanny Avengers (2015) #22": "The Unity Squad has been playing a cat-and-mouse game with Red Skull — but it all ends here! Not everyone will finish on their feet...The final fate of Charles Xavier’s telepathic brain is revealed! Rogue does some soul searching in an unlikely place, and we present our craziest final splash page ever.", "Uncanny Avengers (2015) #17": "The former Avengers fight a rampaging zombie Hulk and ninjas in Japan. It’s brother versus brother! Voodoo takes on his scheming brother in a climactic battle. And for 17 issues the Red Skull has plotted, lurked and waited for the time to destroy the Unity Squad. His wait is over…", "Uncanny Avengers (2015) #16": "CIVIL WAR II AFTERMATH! The Hand has resurrected the Hulk, and the only ones standing in the way of the undead rampaging brute are the former Avengers of the Unity Squad. And to make matters worse, Steve Rogers gave an order that the Avengers did not follow. We’ll find out how that works out for everyone!", "Uncanny Avengers (2015) #15": "CIVIL WAR II AFTERMATH!\nThe Uncanny Avengers have been betrayed! The team stand fractured and disavowed! The Hand has acquired the corpse of “The Fallen” hero! Now, what remains of the Unity Squad travels to Tokyo to smash ninjas and steal back a hero’s remains. Can they get there in time, before the Hand revives “The Fallen”?!", "Uncanny Avengers (2015) #11": "The Uncanny Avengers fight a war on two fronts as they discover they can’t trust someone close. Not everyone is happy to see that Hank Pym has returned. And…a fateful decision will change the life of one Avenger forever.", "Fantastic Four (2014) #7": "ORIGINAL SIN: THE FATEFUL FOUR PART II\nThe FANTASTIC FOUR are being torn apart at their very foundation!\nWill Ben be able to cope with the Original Sin he&#39;s learned about Johnny?\nWill Sue and Reed lose FRANKLIN and the rest of the FUTURE FOUNDATION?\nWill what&#39;s left of the team be able stop their headquarters from being shut down by&hellip;THE AVENGERS?", "Fantastic Four (2014) #6": "EVERYBODY HAS ONE...", "Fantastic Four (2014) #5": "\"THE FALL OF THE FANTASTIC FOUR\" PART 5 - Super-Sized issue!\n- The Baxter Building is quarantined and shut down!\n- The Fantastic Four held accountable for the destruction in Manhattan!\n- A major turning point for the team and a dire blow to the family!\n- The trial of the century featuring an all-star roster of guest artists!", "Fantastic Four (2014) #4": "\"THE FALL OF THE FANTASTIC FOUR\" PART 4\n- FLAME OFF!!! JOHNNY STORM has lost his powers! - The HUMAN TORCH is no more!!!\n- With one member down, a new threat emerges -- the WRECKING CREW...with powers mysteriously elevated to A-level destruction as they team-up with the WIZARD to be a new, devastating version of the FRIGHTFUL FOUR!\n- And as BEN and ALICIA'S romance rekindles, so looms the PUPPET MASTER with dark plans for both of them.\n- All this and the return of FF members ANT MAN, MS. THING and SHE-HULK.", "Fantastic Four (2014) #3": "\"THE FALL OF THE FANTASTIC FOUR\" PART 3\n- The FANTASTIC FOUR were victorious defending Manhattan from inter-dimensional invasion but at a terrible cost!!!\n- Is this \"Flame Off\" forever for the HUMAN TORCH?\n- Introducing a new stronger, deadlier version of the WRECKING CREW!!!", "Fantastic Four (2014) #2": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 2\n\n\n\n\n\n<ul><li>Manhattan is under attack by a monstrous killer swarm from a corrupted pocket universe, and in order to defeat it the FANTASTIC FOUR will need all their courage, powers and skill...as well as those of every other hero in New York!</li><li>But to attain final victory one of the First Family will must make a TERRIBLE SACRIFICE!</li><li>And so the first strings are pulled and the first pieces are put in place...</li><li>...On the Fantastic Four&#39;s DOWNFALL!</li></ul>", "Fantastic Four (2014) #1": "&quot;THE FALL OF THE FANTASTIC FOUR&quot; PART 1\nThe world&#39;s greatest comics magazine begins anew with Marvel&#39;s First Family, the Fantastic Four! But as the brilliant MR. FANTASTIC, the compassionate INVISIBLE WOMAN, the ever lovin&#39; THING &amp; the hot-headed HUMAN TORCH embark on a strange mission, they aren&#39;t met with new beginnings, but an untimely end! As the family of cosmic explorers head towards their darkest hour, who could possibly be behind their downfall? And how is one of their oldest enemies, the sadistic dragon known as Fing-Fang-Foom involved? Prepare for the fantastic!", "Captain America and Bucky (2011) #640": "- FINALE ISSUE! GET READY TO HAVE YOUR FACES PUNCHED CLEAN OFF!\n- Captain America and Black Widow lead the multiverse's finest in a final assault on Venemma Multiversal!\n- Black Widow vs. Black Widow...to the death!\n- Forget 11...on a scale of 1 to AWESOME this eye-popping, senses-snapping, jaw-dropping final issue goes to 12!", "FF (2010) #22": "* Concluding the crossover with FF #610, witness the fallout of Bentley 23&rsquo;s reunion with his father, the Wizard. It&rsquo;s Bad Father, Worse Son.", "FF (2010) #21": "In a move that surprises everyone, Black Bolt and the Inhumans return to Earth. What does this mean for Marvel's first family?", "FF (2010) #20": "<ul><li> A closer look at the Universal Inhuman supergroup. \n</li><li> See what happens when they are called home to Attilan. \n</li><li> Witness the shocking events of what happened when\nBlack Bolt caught the new Supreme Intelligence.</li></ul>", "Secret Avengers (2010) #29": "<ul><li> To prevent a death the Secret Avengers must risk starting a war!\n</li><li> A secret romance heats up!\n</li><li> A rivalry between two members threatens to jeopardize the mission!\n</li><li> Will Hawkeye discover he has a spy on his team in time to prevent tragedy?</li></ul>", "FF (2010) #17": "Now that he's back among the living, the Human Torch moves in with Spider-Man! Can two superheroes share an apartment without driving each other crazy?", "Secret Avengers (2010) #25": "Its man vs. machine!  Can the Secret Avengers stop a group of maniacal mechanical monstrosities from carrying out a contagious robotic evolution? To make matters worse, the team faces a betrayal from within their own ranks!", "Fantastic Four (1998) #604": "The epic conclusion of Jonathan Hickman's three year Fantastic Four epic!", "Amazing Spider-Man (1999) #681": "Spider-Man and the Human Torch are trapped on a space station ful of Octo-Zombies plummeting toward the Earth! The best buds super team-up is running out of air and running out of time!", "Amazing Spider-Man (1999) #680": "Spider-Man in space! Trapped 22,300 miles above the Earth, Spidey has to rescue John Jameson from the ongoing machinations of Doctor Octopus!", "Fantastic Four (1998) #601": "\"Forever\" Part 2 Finally, It's Clobberin' Time.", "Fantastic Four: Season One (2012) #1": "In Manhattan's most famous skyscraper, the Baxter Building, scientific genius Reed Richards hatches a plan that will change the lives of those he loves most - and the very course of human history - in a way no one could have ever imagined. Revisit the story that irrevocably altered comics and pop culture in this all-new graphic novel, modernizing the journey of Reed Richards, Susan Storm, Johnny Storm and Ben Grimm as they travel to the stars - and return with fantastic, devastating results! Plus: Witness the FF's cataclysmic first battles with the Mole Man, Dr. Doom and Prince Namor, the mysterious Sub-Mariner, in a way you've never seen before. You only think you know the story! Also features FANTASTIC FOUR #570 by Jonathan Hickman and Dale Eaglesham.\n136 PGS./Rated T+ ...$24.99", "Iron Age (2011) #3": "Iron Man's quest through history to save the Earth from the destruction of Dark Phoenix is near complete. Will a weakened Tony Stark be able to hold his own in the classic battle between the Uncanny X-Men, The Hellfire Club and Jean Grey herself!", "Ultimate Fallout (2011) #3": "Witness the fate of the Ultimate Comics Universe after DEATH OF SPIDER-MAN.", "Iron Age (2011) #2": "Trapped in the past, Iron Man teams up with The Human Torch. With Doctor Doom standing in their path, will they be able to survive? And will Tony decide to warn Johnny Storm of his ultimate demise? Also, Iron Fist makes his first appearance!", "Iron Age (2011) #2 (Variant)": "CAN IRON MAN SAVE JOHNNY STORM'S LIFE?! Trapped in the past, Iron Man must team with The Human Torch to get back to the future - but DOCTOR DOOM stands in their way! IF they survive, can Stark warn Johnny of his eventual demise? SHOULD he?  Killer Robots!  Broken Hearts!  The Battle of Gettysburg!  This one's got it all!  Writer Elliott Kalan (AGE OF HEROES) joins the legendary team of Ron Frenz (SPIDER-GIRL) and Sal Buscema (SPECTACULAR SPIDER-MAN) in JOHNNY STORM: SUPER STAR! BUT FIRST! Can the combined muscle of POWER MAN & IRON FIST help Iron Man get back to the present and save our world from the PHOENIX? Jen Van Meter (THE BLACK CAT) joins Nick Dragotta (FANTASTIC FOUR) to bring you GHOSTS OF CHRISTMAS PAST!", "All-Winners Squad: Band of Heroes (2011) #1": "It's World War II super-action as Captain America heads up a top-secret, all-hero unit of the U.S. military! But a mystery surrounding the Band of Heroes rears its ugly head in the present...and you won't believe how deep it goes.", "Iron Age (2011) #1": "Trapped in the past, Iron Man races the clock to save the future from annihilation. But who will believe his story? The familiar faces who are willing to help may shock you! The fight for the Earth's salvation begins!", "Human Torch & Hulk: From the Marvel Vault (2011) #1": "Follow the Hulk and Johnny Storm the Human Torch, as they battle with the twisted genius known as the Wizard who has gained the power of the moon's magnetism!", "Fantastic Four: The Last Stand (2011) #1": "Collecting FANTASTIC FOUR #574 and #587-588", "Marvel Masterworks: Golden Age Captain America Vol. 5 (Variant) (Hardcover)": "The never-before-reprinted adventures of Captain America's Golden Age exploits continue with four more amazing 64-page issues! There's action aplenty with menacing monsters; sub-earth horrors; super villains out for revenge; and, of course, more than just a few of Cap's World War II Axis enemies gettin' a red-white-and-blue sock in the kisser! You'll see Cap and Bucky grapple with Killer Kole, the reanimated murderer; battle the lovely and lethal Queen Medusa, ruler of towering sub-earth monster worms; go ten frames against the fifth column's bowling alley of death; contend with the return of the super villains the Black Talon and the Black Toad; and fight crocodile-men. And in a special story written by Stan Lee, the dire threat of the Nazi is spelled out in no uncertain terms. To top it off, Cap's tales are backed up by the Human Torch; the Sub-Mariner; Fighting Yank; and Roddy Colt, the war-bond-promoting boy hero also known as the Secret Stamp. Collecting CAPTAIN AMERICA COMICS #17-20.", "Marvel Masterworks: Golden Age Captain America Vol. 5 (Hardcover)": "The never-before-reprinted adventures of Captain America's Golden Age exploits continue with four more amazing 64-page issues! There's action aplenty with menacing monsters; sub-earth horrors; super villains out for revenge; and, of course, more than just a few of Cap's World War II Axis enemies gettin' a red-white-and-blue sock in the kisser! You'll see Cap and Bucky grapple with Killer Kole, the reanimated murderer; battle the lovely and lethal Queen Medusa, ruler of towering sub-earth monster worms; go ten frames against the fifth column's bowling alley of death; contend with the return of the super villains the Black Talon and the Black Toad; and fight crocodile-men. And in a special story written by Stan Lee, the dire threat of the Nazi is spelled out in no uncertain terms. To top it off, Cap's tales are backed up by the Human Torch; the Sub-Mariner; Fighting Yank; and Roddy Colt, the war-bond-promoting boy hero also known as the Secret Stamp. Collecting CAPTAIN AMERICA COMICS #17-20.", "The Marvels Project (Trade Paperback)": "Captain America. Bucky Barnes. The Angel. Namor, the Sub-Mariner. Nick Fury. The Human Torch. Toro. The Phantom Bullet. Witness the birth of the Marvel Universe through the eyes of one of its own Golden Age heroes! As the dashing Angel fights crime in the streets of pre-wartime America of the 1930s and '40s, he witnesses the rise of an entire generation of titans - of fiery men, undersea kings and inspiring soldiers. Will these Marvels be enough to fight back the onslaught of World War II - including the Nazi's own super-soldier, the Red Skull? The beginning of the Marvel Age of Heroes is documented in this fast-moving and shocking tale from the mind of writer Ed Brubaker (SECRET AVENGERS, CAPTAIN AMERICA) and the pen of artist Steve Epting (CAPTAIN AMERICA, FANTASTIC FOUR). Collecting THE MARVELS PROJECT #1-8.", "Amazing Spider-Man (1999) #657": "FF: THREE TIE-IN Spider-Man visits the FF for a very private wake-just for family.", "Fantastic Four (1998) #587 (3rd Printing Variant)": "One of the four will fall!", "Fantastic Four (1998) #587 (2ND PRINTING VARIANT)": "The conclusion to \"Three\"!", "Fantastic Four (1998) #587 (SPOILER VARIANT)": "One of the four will fall!", "Fantastic Four (1998) #584 (2ND PRINTING VARIANT)": "It's the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again. Join Jonathan Hickman and superstar artist Steve Epting in THREE, part 2: 'Congratulations, Mr. Grimm...You're Human Again.'' Rated A ...$2.99", "Fantastic Four (1998) #587": "THREE PART 5 This is the penultimate chapter of THREE! Which member of the Fantastic Four will perish?", "Fantastic Four (1998) #586 (2ND PRINTING VARIANT)": "As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth amidst the chaos of Galactus devouring Nu-World. 32 PGS./Rated A ...$2.99", "Fantastic Four (1998) #585 (2ND PRINTING VARIANT)": "FANTASTIC FOUR #585 Written by JONATHAN HICKMAN Penciled by STEVE EPTING Cover by ALAN DAVIS World's apart from each other, the Fantastic Four embark on their individual journeys with one destined to end in tragedy and change the face of Marvel's first family. It's THREE, part 3:'The Last Kings of Atlantis'! 32 PGS./Rated A ...$2.99", "Fantastic Four (1998) #583 (3RD PRINTING VARIANT)": "Now joined by artist Steve Epting (CAPTAIN AMERICa) , Jonathan Hickman's tenure on FANTASTIC FOUR hits critical mass with \"THREE\", running through FF #583-588. The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last! Change is in the air as the World's Greatest Comic Magazine lives up to its motto! While the Fantastic Four have to deal with an uprising in the Forever City of the High Evolutionary, back home in the Baxter Building Val finds her father's Bridge machine and learns the Cost of Solving Everything. It's the return of Doctor Doom and the debut of superstar artist Steve Epting in THREE, part 1: 'In Lateveria, the Flowers Bloom in Winter. Rated A ...$2.99", "Fantastic Four (1998) #586": "THREE PART 4 As the army of the Anti-priest begins an invasion of the Baxter Building, and the Invisible Woman is caught in between the warring factions of New and Old Atlantis, Reed Richards must decide the fate of the Earth!", "Fantastic Four (1998) #585": "THREE PART 3 Worlds apart from each other, the Fantastic Four embark on their individual journeys. One member won't make it back...", "Chaos War: Chaos King (2010) #1": "As darkness blankets the stars, only the gods of Zenn-La, homeworld of the Silver Surfer, remain to oppose the Chaos King before he begins his march on the final battleground: Earth!", "Fantastic Four (1998) #584": "THREE PART 2 In this issue: the return of Galactus, a trip to Nu-World, the Old Kings of Atlantis and Namor, the all-new Yancy Street Gang, and the day the Thing becomes human again.", "Fantastic Four (1998) #583": "THREE PART 1 The War of Four Cities has begun, and when it's run its course, one member of the Fantastic Four will have breathed their last!", "Fantastic Four (1998) #580": "A giant toy store full of deadly videogame kids and killer playthings. An underground labyrinth inhabited by needy Swedish nannies. The Impossible Man. Arcade. And a babysitter named Johnny Storm...Enter the Frank-tastic Four.", "Fantastic Four (1998) #579": "Think the world is a bad place, everything is going to hell, and the end times are surely around the corner? Try reading the World's Greatest Comic Magazine.", "The Marvels Project (2009) #8": "The startling conclusion to the origin of the Marvel Universe. Pearl Harbor, secret Nazi experiments gone wrong, and the seeds of destruction that would lead to the modern Marvel world of today will stand revealed! ", "Fantastic Four (1998) #578": "PRIME ELEMENTS PART 4 The Fantastic Four head to the Negative Zone to deal with one of their most dangerous foes! Annihilus is back!", "Fantastic Four (1998) #576": "PRIME ELEMENTS PART 2 The Fantastic Four head to the bottom of the world to discover the mystery of the Vostok Station!", "Fantastic Four (1998) #575": "PRIME ELEMENTS PART 1 Witness the return of the Mole Man and see the Fantastic Four discover the world's smartest Moloid!", "Fantastic Four (1998) #574": "All the Marvel cool kids show up at the bestest birthday party ever! We got X-kids, Power Pack, and Spider-Man in the house as Franklin celebrates his birthday!. Who cuts the cake? Who brings the best present? And who's the special guest of honor? It's Days of Future Franklin!", "The Marvels Project (2009) #4": "Project Rebirth begins! As 98 pound weakling Steve Rogers finally enters the picture, Nazi spies move in the shadows onto US soil...and the Angel comes close to finding the man who's murdering masked heroes.", "Fantastic Four (1998) #573": "Adventures on Nu Earth! Ben and Johnny have big plans for a much needed vacation in the company of refugees from the future - booze, ladies, misadventures...and two stowaways named Franklin and Val.", "Fantastic Four (1998) #572": "Spinning Marvel's first family into a bold new era of adventure. Be there to see Reed Richards SOLVE EVERYTHING.", "Dark Reign: Zodiac (2009) #3": "The explosive climax!  New York in flames!  Norman Osborn tearing out his bizarre-looking hair! The deepest, darkest secrets are finally revealed as Zodiac makes his big play.  But will a lone H.A.M.M.E.R. Agent expose him before he can fulfill his destiny?  You've never seen super-villainy like this!\r\nRated T  ...$3.99", "Fantastic Four (1998) #571": "Reed continues his quest to right all wrongs while Ben and Johnny prepare for a trip to Nu-Earth. Val figures out what her dad is up to and Sue wants to know  \"is that an ultimate nullifier in your pocket?\" All that and a world-eater before breakfast!", "The Marvels Project (2009) #2": "The Human Torch is on the run, The Angel makes his masked debut, The Sub-Mariner stalks the surface-worlders who have targeted his people -- and a young soldier named Nick Fury saves a German scientist from the Nazis and leads him to the USA. ", "Fantastic Four (1998) #570": "It's adventure, it's family, it's tough questions in dark times...See what happens when Reed Richards tries to SOLVE EVERYTHING.", "Dark Reign: Zodiac (2009) #2": "Zodiac's master plan escalates to dizzying heights.  First up: a horrific act of super-villain terrorism that involves a group of iconic Marvel heroes!  Next: a planet-wide threat that will test Norman Osborn's leadership abilities like no other has!  And what does Galactus have to do with all of this?  The new wave of Marvel villains has finally arrived!\r\nRated T  ...$3.99", "Fantastic Four (1998) #569": "THE MASTERS OF DOOM FINALE It's the last stand of the FF before the triumphant Marquis of Death! And should Marvel's First Family survive that, they've still got the wedding of the Thing to look forward to!", "Fantastic Four (1998) #568": "THE MASTERS OF DOOM PART THREE Reed Richards is offered a Solomon's choice by the triumphant Marquis of Death!", "Avengers/Invaders (2008) #12": "DUTY NOW...FOR THE FUTURE!\r\nThe year long event concludes with a battle royale against a Cosmic Cube powered Red Skull that shakes history to its core. In an altered past and an unrecognizable present, three super-powered teams made up of Earth Mightiest Heroes and the Greatest Heroes of World War Two, find themselves at a crossroads that none of them...or us...may survive.\r\nRated T  ...$2.99", "Dark Reign: Zodiac (2009) #1": "Norman Osborn may be running the show, but not every super-villain is going to accept the new world order.  But who -- or\r\nwhat -- is ZODIAC?  In this dark, brooding tale that snakes through the underbelly of the modern Marvel Universe, the new breed of super-villain has finally arrived!  The order of the day is \"mischief for mischief's sake,\" and no one -- neither hero *nor* villain -- is safe!\r\nRated T  ...$3.99", "Astonishing Tales: One Shots (The Thing) (2009) #1": "MARVEL DIGITAL COMICS EXCLUSIVE\r\n\r\nA regular night at the bar turns into a sobering experience for Ben when he encounters a powerful Fantastic Four villain from the past... Equinox!", "The Mighty Avengers (2007) #26": "In this issue: Mr. Fantastic and Hank Pym's battle of the brains! Hercules and The Thing's battle o' the brawn! Plus, an all-new HQ for the team!", "Adam: Legend of the Blue Marvel (Trade Paperback)": "An unstoppable super-villain attacks New York City - and the Mighty Avengers fall before him! Where did Anti-Man come from? And who can stop his overwhelming rampage?! Now Iron Man races to find the only man who's ever defeated Anti-Man - THE BLUE MARVEL! A hero the world hasn't seen since 1961! Will Tony Stark uncover the truth behind Blue Marvel's disappearance and will Blue Marvel ever recover from it? Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League) join forces to create Marvel's newest powerhouse super hero! Collecting ADAM: LEGEND OF THE BLUE MARVEL #1-5.\r\nRated T  ...$19.99 \r\nISBN: 978-0-7851-2409-2", "Fantastic Four (1998) #567": "THE MASTERS OF DOOM PART TWO The Marquis of Death has returned to Earth. His first target: his once-pupil, Victor Von Doom! \n", "Fantastic Four (1998) #566": "THE MASTERS OF DOOM PART ONE They come from across the universe, returning to Earth after a 20 year journey of genocide and sadism. They're the men who tutored Doctor Doom in villainy, and they've returned to destroy the Fantastic Four!\n", "Avengers/Invaders (2008) #9": "Picking up from the jaw-dropping events of Avengers/Invaders #8, our heroes find themselves back in time, with the fate of the very world on their shoulders. Disguised as the heroes of the golden past, Iron Man, Spider-Man, Wolverine, Spider-Woman, Ms. Marvel and Luke Cage now face Nazis, the power of the Cosmic Cube and the Red Skull... Avengers Assemble!\r\nRated T  ...$2.99", "Fantastic Four (1998) #565": "A visit to Reed's most remote relatives becomes a fight for survival as a creature beyond the confines of science targets the Richards' offspring for consumption.\n", "Wolverine: Weapon X (Trade Paperback)": "Wolverine's a lot of things to a lot of people, but to one infamous enclave he was nothing but a weapon. And weapons kill people. They found that out well enough. Find out for yourself in this prequel to recent revelations of the murderous mysteries that have mesmerized our favorite mutant! Collecting MARVEL COMICS PRESENTS #72-84.\r\nRated T  '$16.99\r\nISBN: 978-0-7851-3726-9", "Fantastic Four (1998) #564": "Prepare for a Christmas gone horribly wrong as the Fantastic Four must battle for survival just in time for the holidays!", "Avengers/Invaders (2008) #8": "With the real enemy revealed, two teams of Avengers are drawn together for a brutal battle royale. Meanwhile, a secret from the Invaders' past threatens to destroy the present, upend the chessboard and send several heroes back through the veils of time...perhaps lost forever.\r<br>Rated T+ ...$2.99\r<br>", "Fantastic Four (1998) #563": "Mr. and Mrs. Thing! A threat from the world of 1985! Plus: Who are the Masters of Doom?\n", "Fantastic Four Cosmic-Size (2008) #1": "To be revealed at a later date. Check back to Marvel.com, the Marvel Mailer & Diamond Daily for more information.\r<br>Rated A ...$4.99\r<br>", "Fantastic Four (1998) #562": "It's a Fantastic Four wedding and a funeral, as Sue Storm speaks at her own burial, and Ben Grimm finally pops the question!\n\n\n", "Avengers/Invaders (2008) #7": "Marvel's biggest self-contained story of the year continues!  Featuring Earth's Mightiest Heroes and spanning the\r\n<br>generations from 2008 to the war-torn days of World War II! Surrounded by a trio of enemies they thought long-vanquished, The Avengers are victims of one of the most powerful pieces of technology in the Marvel Universe. Meanwhile, the\r\n<br>Invaders find themselves trapped in an alternate reality that promises to destroy its most powerful member as the\r\n<br>countdown to Armageddon begins.\r\n<br>Rated T  ...$2.99\r\n<br>", "X-Men: The Complete Onslaught Epic Book 4 (Trade Paperback)": "The final onslaught is ON! Mutantdom's mightiest telepaths are forced to turn on one of their own, because Professor X's evil side won't stand for any more repression! The world's greatest hero teams gird for battle against one of their deadliest enemies, and when the smoke clears, not only will some of them not still be standing, they won't be there at all! The X-Men are left to take the blame for over a dozen dynamic disappearances, leading the man called Bastion to lay the groundwork for their NEXT crisis! But even if Onslaught is purged from this world, can a reborn world say the same? Guest appearances galore, plus step-by-step details on where the turning point of the 1990s began and ended! Collecting FANTASTIC FOUR #416, X-MEN #56, ONSLAUGHT: MARVEL UNIVERSE, CABLE #36, UNCANNY X-MEN #337, X-MEN #57, ONSLAUGHT: EPILOGUE, IRON MAN #6 & X-MEN: ROAD TO ONSLAUGHT.\r<br>Rated T+ ...$29.99\r<br>", "Avengers: First to Last (Hardcover)": "They are the last of the Earth's Mightiest Heroes: Hawkeye, the blinded archer; the Wasp, pint-sized dynamo cursed with an incurable shrinking disease; Cannonball, mutant X-Man and Avenger; and former Ant-Man, former Giant-Man, former super hero Hank Pym, the last man who would have volunteered to lead them. They're not the strongest, but they are the only hope in the final battle against the greatest enemies of mankind. They are the Last Avengers. United, they will fall. This is THE LAST AVENGERS STORY. Also featuring timeless tales shedding new light on the early days of Earth's Mightiest Heroes: the Hulk, Iron Man, Captain America and Thor! In these previously untold stories, the six founding members vie for chairmanship of the team, Bruce Banner fears the Hulk's rage may have gone too far, Iron Man unveils his latest suit of armor, Captain America adjusts to life in the modern world, a WWII veteran reminisces about an early meeting between Cap and Thor, and more! Plus: Marvel's founding father, Stan Lee, tells the \"real\" story of how the Avengers became a team! Collecting THE LAST AVENGERS STORY #1-2 and material from AVENGERS CLASSIC #1-12.\r<br>Rated T+ ...$34.99\r<br>ISBN: 978-0-7851-3660-6\r<br>", "AVENGERS: FIRST TO LAST PREMIERE HC (Hardcover)": "They are the last of the Earth's Mightiest Heroes: Hawkeye, the blinded archer; the Wasp, pint-sized dynamo cursed with an incurable shrinking disease; Cannonball, mutant X-Man and Avenger; and former Ant-Man, former Giant-Man, former super hero Hank Pym, the last man who would have volunteered to lead them. They're not the strongest, but they are the only hope in the final battle against the greatest enemies of mankind. They are the Last Avengers. United, they will fall. This is THE LAST AVENGERS STORY. Also featuring timeless tales shedding new light on the early days of Earth's Mightiest Heroes: the Hulk, Iron Man, Captain America and Thor! In these previously untold stories, the six founding members vie for chairmanship of the team, Bruce Banner fears the Hulk's rage may have gone too far, Iron Man unveils his latest suit of armor, Captain America adjusts to life in the modern world, a WWII veteran reminisces about an early meeting between Cap and Thor, and more! Plus: Marvel's founding father, Stan Lee, tells the \"real\" story of how the Avengers became a team! Collecting THE LAST AVENGERS STORY #1-2 and material from AVENGERS CLASSIC #1-12.\r<br>Rated T+ ...$34.99\r<br>ISBN: 978-0-7851-3652-1\r<br>", "Adam: Legend of the Blue Marvel (2008) #2": "In the wake of Anti-Man's devastating attack on New York City, the Mighty Avengers are neutralized, and Iron Man's on a quest for answers! Who was the Blue Marvel?\r\nWhy did he disappear over 40 years ago? And...what alarming secrets will Iron Man discover about the U.S. government and his own agency of S.H.I.E.L.D.? There are no easy answers in the story of Marvel's newest super hero...created by Kevin Grevioux (NEW WARRIORS) and Mat Broome (The End League)!\r\nRated T  ...$3.99", "Marvels: Eye of the Camera (2008) #1": "News photographer Phil Sheldon's back, with the man-on-the-street's perspective on the big events of the Marvel Universe!", "Marvel Masterworks: Golden Age All-Winners Vol. 3 (Hardcover)": "It's the titanic trio of the Timely Big Three - Captain America, the Human Torch and the Sub-Mariner - combined with Golden Age luminaries the Destroyer and the Whizzer in one all-out amazing series! Defending wartime America from Nazi airships, ape-men and anything and everything else the Axis can throw at them, the Human Torch and Toro burn up the comic page like it's still 1943. Captain America and Bucky parachute into adventures from mad scientists to buzz-bombing Nazis. Meanwhile, the Destroyer stops at nothing - including a battalion of Hitler impersonators - to stop the Nazi threat. And the Pacific Theatre won't be left waiting, not with the Sub-Mariner around! He takes it straight to the Emperor himself and comes back to clean up the docks while he's at it! But before you speed away, don't miss the Whizzer as he races through maddening mazes and thwarts the plans of kidnapping crooks! It's comic-book adventure at its purest, so reserve your copy today! Collecting ALL-WINNERS COMICS #9-14.\r<br>ISBN: 978-0-7851-3358-2\r<br>All Ages ...$59.99\r<br>", "Fantastic Four (1998) #561": "\"The Death of the Invisible Woman\" concludes, with...well, the death of the Invisible Woman!\r<br>Rated T+ ...$2.99\r<br>", "Avengers/Invaders (2008) #6": "The titanic team-up of the year continues! With the time-tossed Cap and Namor held by Tony Stark and his Mighty Avengers, Toro and Bucky are off-the-grid under the protective wing of the New Avengers... while the Torch finds himself in the presence of the most powerful threat to the Marvel Universe, whose identity is revealed in this issue!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Hulk: Heart of the Atom Premiere (Hardcover)": "In the sub-atomic kingdom of K'ai, the Hulk gained Bruce Banner's brain, but lost his heart to the gorgeous green Grace: Jarella! After the sinister Psyklop gets their world in his hands, the atom-crossed couple seeks happiness on Earth, but the odds seem stacked against them in both dimensions! Will the Hulk save his emerald angel and her war-torn world? Can green hearts be broken? Find out in this saga that spans time, space, and [non]human emotion! Guest-starring Captain Marvel and the Avengers! Collecting INCREDIBLE HULK #140, #148, #156, #202-203, #205-207 and #246-248; and WHAT IF? #23.\r<br>All Ages ...$29.99\r<br>ISBN: 978-0-7851-3087-1\r<br>Trim size: standard\r<br>", "Marvel Masterworks: The Fantastic Four Vol. 11 (Hardcover)": "The World's Greatest Comic Magazine marches forward with a new great artist, Big John Buscema, and the same great man - Stan \"The Man,\" 'natch - in A fresh set of epic adventures as only mighty Marvel can make 'em! It all begins when Johnny Storm's ladylove, Crystal, must leave the polluted human world for the Inhumans' sanctuary, but within her lies the secret solution to freeing the Thing from his rocky prison. Then, as Benjamin Grimm emerges with the power to change into the Thing at will, Reed Richards must descend into the dark of the Negative Zone to face entropic Annihilus and the mysterious Janus, the Nega-Man. But what good is controlling your powers, when you're losing control of your mind? The Thing goes on a rampage and New York City better look out because it can only end in the biggest, the baddest, the best fist-pounding, building-toppling, earth-shaking slobbernocker in Marvel history! The ever-lovin', blue-eyed Thing goes toe-to-toe with the gamma-powered goliath, the Incredible Hulk, and only one will walk out alive. That's not all, though! Before the FF collect themselves, the all-powerful Over-Mind descends on the planet Earth - and you know it ain't gonna be good for real-estate values when the Watcher shows up, too. It's a menace so great that even the evil Doctor Doom joins forces with the FF, so reserve your copy today, True Believer - there's plenty more classics to come! Collecting FANTASTIC FOUR #105-116.\r<br>All Ages ...$54.99\r<br>ISBN: 978-0-7851-3046-8\r<br>", "X-Men Vs. Apocalypse Vol. 2: Ages of Apocalypse (Trade Paperback)": "The Shi'Ar on the Moon, Cable and his wife in Egypt, Wolverine in the Negative Zone - what's wrong with this picture? Apocalypse has risen from the past to change timelines until he finds one he likes - but when the original X-Man looks him in the eye, both men are lost, leaving the X-Men to comb the world for friend and enemy alike! Will Cyclops literally become the thing he fears and hates the most, and vice versa? And where does the Red Skull fit into all of this? Anywhere he wants to! Guest-starring the Hulk, Machine Man, Deathlok and more! Collecting X-51 #8, UNCANNY X-MEN #378 and ANNUAL 1999, CABLE #77, WOLVERINE #148,\r<br>X-MEN UNLIMITED #26, X-MEN #98 and X-MEN: THE SEARCH OF CYCLOPS #1-4.\r<br>Rated T+ ...$29.99 \r<br>ISBN: 978-0-7851-2264-7\r<br>", "X-Men: The Complete Onslaught Epic Book 3 (Trade Paperback)": "You all know about Onslaught Reborn, now see how it first got underway! Professor X hasn't been himself lately - moody, inscrutable, but the psionic armor and army of Sentinels are the real tip-offs! It'll take every super hero New York has to face the Onslaught - including not only the X-Men, the Fantastic Four, the Avengers, but forgotten stars of the nineties like Green Goblin Phil Urich, Nate Grey the X-Man and Ben Reilly, a.k.a. Spider-Man! Also guest-starring the Hulk, the Pantheon, the Punisher, S.H.I.E.L.D. and others! Collecting HULK #445, IRON MAN #332, AVENGERS #402, PUNISHER #11, X-MAN #19, AMAZING SPIDER-MAN #415, GREEN GOBLIN #12, SPIDER-MAN #72, FANTASTIC FOUR #416 and WOLVERINE #105.\r<br>Rated T+ ...$29.99\r<br>", "Marvel Masterworks: Golden Age Marvel Comics Vol. 3 (Hardcover)": "The wait is over, and the stage is set. It's fire vs. water in the most famous battle of comics' Golden Age! Breaking new ground like none other, MARVEL MYSTERY COMICS, the flagship title of Marvel's earliest days, started a craze that defines super-hero comic books to this day. With hero pitted against hero in a fight to the finish, you'd better place those bets and settle into your seats. 'Cause it's the final round of the Human Torch vs. the Sub-Mariner!\r<br>Headlined by the lavish, manic and truly amazing Sub-Mariner by Bill Everett and the high-flying Human Torch by Carl Burgos, MARVEL MYSTERY COMICS is a bona-fide treasure trove of Golden Age action and adventure. The awesome and idiosyncratic Steve Dahlman brings you Electro, the Marvel of the Age, the monster-stomping robot featured today in THE TWELVE, while Paul Gustavson's Angel woos damsels in distress and battles the undead evils of the subterranean realm, and the jungle adventurer, Ka-Zar the Great, protects the Belgian Congo from the threats of the outside world.\r<br>Also featuring the wild Western tales of the Masked Raider, boy-adventurer Terry Vance and a host of four-color companions -- each painstakingly restored to provide you with the best experience of these truly classic tales.\r<br>Collecting MARVEL MYSTERY COMICS #9-12.\r<br>Rated A ...$59.99\r<br>", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 2 TPB (Trade Paperback)": "It's the past, it's the future, it's an alternate Earth - when it's down to fighting cyborg dictators and displaced dinosaurs, who has time to figure out where they are?! It's another Simonson odyssey for the Fantastic Four and company, plus personal crises for the Human Torch and Ms. Marvel (Sharon Ventura)! Guest-starring Spider-Man and Rusty Collins of X-Factor/New Mutants fame! Collecting FANTASTIC FOUR #342-346.\r<br>All Ages ...$14.99\r<br>", "FANTASTIC FOUR: LOST ADVENTURES BY STAN LEE PREMIERE HC (Hardcover)": "The comic-book equivalent of a lost Beatles track! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished - until now! Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott reunited to complete the work they started almost four decades ago! Plus: The legendary writer and Fantastic Four co-creator joins forces with artist John Romita Jr. to tell his final story of the team that started the Marvel Age! Collecting FANTASTIC FOUR: THE LOST ADVENTURE and THE LAST FANTASTIC FOUR STORY, plus rare Stan stories from FANTASTIC FOUR #296 and #543.\r<br>Rated A ...$24.99\r<br>ISBN: 978-0-7851-3097-0\r<br>", "INVADERS CLASSIC VOL. 2 TPB (Trade Paperback)": "After their first several sagas of success, the Invaders spread Facross the world to discover new friends and new foes, plus the ever-present question of which is which! Introducing Spitfire! Warrior Woman! The Golem! The Blue Bullet! The Spirit of '76! Agent Axis! Plus: genuine Golden Age villains not seen in decades! Crusaders, Avengers and Destroyers - all for you in '42! Collecting INVADERS #10-21 and ANNUAL #1.\r<br>All Ages ...$29.99 \r<br>ISBN: 978-0-7851-3120-5\r<br>", "Secret Invasion: Fantastic Four (2008) #2": "Trapped in the Negative Zone with Franklin and Val, beseiged by monsters, Ben and Johnny are scrambling to get back home before a cosmic anomoly with the power to consume everything swallows Manhattan.", "Hulk Vs. the Marvel Universe (Trade Paperback)": "Before WORLD WAR HULK, before PLANET HULK, the Green Goliath spent years fighting the finest the Marvel Universe has to offer! Hulk vs. the Thing! Hulk vs. Thor! Hulk vs. the Silver Surfer, Wolverine and more! Whether facing a tag-team match from the Fantastic Four and the Avengers or going one-and-one against Spider-Man and Daredevil, the Incredible Hulk's the strongest one there is no matter who his opponents are! Also featuring the X-Men, S.H.I.E.L.D. and Fin Fang Foom! Collecting FANTASTIC FOUR #25-26, JOURNEY INTO MYSTERY #112, TALES TO ASTONISH #92-93, DAREDEVIL #163, INCREDIBLE HULK #300 AND #340, PETER PARKER: SPIDER-MAN #14; and HULK VS. FIN FANG FOOM #1.\r<br>All Ages ...$24.99 \r<br>ISBN: 978-0-7851-3129-8\r<br>", "Avengers/Invaders (2008) #1 (Finch Variant)": "Legends Live Again. \r\nThe original Invaders (Captain America , Bucky , Human Torch , Toro , and the Sub-Mariner) return in a twelve issue maxi-series by the award winning team behind EARTH X, Justice and Project Superpowers .The greatest super-team of World War II finds themselves transported from the battlefields of the Second World War to a future they never imagined! Now, the Invaders find themselves confronted by two teams of Avengers who want desperately to believe these heroes are who they say they are, while Tony Stark faces his greatest challenge since the Civil War as he must deal with the \"return\" of Steve Rogers.  Confronted by a world they barely recognize, the Invaders will have to show two teams of the Earth's Mightiest Heroes just what kind of power, courage and sheer determination it took to defeat the forces of unrelenting evil in the Twentieth century. In fact...they may just have to do Rated T  ...$2.99", "Avengers/Invaders (2008) #1": "Legends Live Again. \r\nThe original Invaders (Captain America , Bucky , Human Torch , Toro , and the Sub-Mariner) return in a twelve issue maxi-series by the award winning team behind EARTH X, Justice and Project Superpowers .The greatest super-team of World War II finds themselves transported from the battlefields of the Second World War to a future they never imagined! Now, the Invaders find themselves confronted by two teams of Avengers who want desperately to believe these heroes are who they say they are, while Tony Stark faces his greatest challenge since the Civil War as he must deal with the \"return\" of Steve Rogers.  Confronted by a world they barely recognize, the Invaders will have to show two teams of the Earth's Mightiest Heroes just what kind of power, courage and sheer determination it took to defeat the forces of unrelenting evil in the Twentieth century. In fact...they may just have to do it again in the Twenty-First.\r\nRated T  ...$2.99", "Marvel Masterworks: Atlas Era Heroes Vol. 2 (Hardcover)": "The Atlas Era Hero Revival continues with the adventures of the comics' most famous trio of Communist conquering heroes: Captain America, the Human Torch and the Sub-Mariner!  Beginning with the Big Three's anthology adventures in Men's Adventures, we then dive headlong into Captain America's complete 1954 solo series. Illustrated by Bullpen legend John Romita in some of his very first super hero stories, you'll see Cap and Bucky fight Fifth Columnists, Commie spies and even the Soviet Electro!  Next up, it's the Human Torch and Toro! Returned from his slumber by an atomic bomb, the Torch has rejoined his young sidekick in a battle to clean up threats as amazing and entertaining as vampires, killer robots and his 1950s nemesis, the Vulture. Their crime-fighting adventures even take on a global purchase, stretching all the way to the 38th Parallel and Communist Korea!  And finally, for a quick taste of what's to come in Atlas Era Heroes' next volume, comes an assortment of Bill Everett's lavishly drawn tales of the lord of the Atlantis, Namor the Sub-Mariner. Considered by many to be the definitive take on the character, Everett's '50s Sub-Mariner is nothing less than treasure from the deep!  We'd be remiss to leave you without a bevy of historical bonuses, including a rare Human Torch tale that went unprinted for more than a decade, original artwork, Atlas Era house ads and an introduction by Hero Revival scholar extraordinaire Roy Thomas.  Collecting MEN'S ADVENTURES #27-28, CAPTAIN AMERICA #76-78, HUMAN TORCH #36-38 and MARVEL SUPER-HEROES #16.\r<br>All Ages ...$59.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #33": "It's all fun and games when Ben tells a group of schoolchildren a rather fanciful account of a battle against the Rhino, but when the real life Abomination shows up, things turn deadly serious for the Fantastic Four.\r<br>All Ages...$2.99\r<br>", "Fantastic Four: The Lost Adventure (2008) #1": "IT'S THE COMIC BOOK EQUIVALENT OF A LOST BEATLES TRACK! Together, Stan Lee and Jack Kirby produced 102 consecutive issues of FANTASTIC FOUR. But there was a 103rd story they'd begun in 1970, but never finished-until now!  Working from copies of Jack's penciled pages, Stan Lee and Joe Sinnott have reunited, to complete the work they started almost four decades ago! Plus, this super-sized issue includes reproductions of Kirby's unlinked penciled pages, with border notes and analysis by John Morrow, and a complete reprint of FANTASTIC FOUR #108 by Stan Lee and John Buscema, which incorporated some of the material from the lost story as a flashback.\r<br>Rated A ...$4.99 \r<br>", "Fantastic Four (1998) #554": "MARK MILLAR! BRYAN HITCH! Need we say more? All right, we will! Who is Mrs. Fantastic? And how will her return into Reed's life rock comicdom's First Family? Also, get ready to meet the Invisible Woman's brand NEW super-team! This issue kicks off a year-long storyline that will make FANTASTIC FOUR \"The World's ULTIMATEST Comic Magazine!\" Promise!\r<br>Rated A...$2.99 \r<br>", "Black Panther (2005) #34": "It's clobberin' time-in the arena and in the streets, between the new Fantastic Four and several gangs that may have their number.", "Black Panther (2005) #33": "The new Fantastic Four's battle with the Skrull gangsters reaches a pulse-quickening conclusion!", "Fantastic Four: Isla De La Muerte! (2007) #1": "Ben Grimm has been keeping a secret from his teammates for years. But when Reed, Sue and Johnny investigate, the mystery brings them to the tropics, face-to-face with an old nemesis and a monstrous creature!", "Fantastic Four: Isla De La Muerte (Spanish Language Edition) (2008) #1": "Los Cuatro Fantásticos han viajado por todo el mundo, el universo y hasta otras dimensiones combatiendo amenazas inconcebibles, pero la amenaza más reciente a la que se enfrentan tiene su origen en la Isla del Encanto, Puerto Rico. En el número especial Fantastic Four: ¡Isla de la Muerte! One-Shot, escrito por el aclamado Tom Beland e ilustrado por el artista emergente Juan Doe, los Cuatro Fantásticos visitan la preciosa isla de Puerto Rico...¡donde se ha de revelar un secreto del pasado de la Cosa! Como si no bastara el resurgimiento de un antiguo enemigo, ahora los Cuatro Fantásticos deben enfrentarse al monstruo boricua al que se le conoce como...¡el chupacabras!\r<br>\r<br>¡Esta edición especial también estará disponible en español en la inaudita Los Cuatro Fantásticos: ¡Isla de la Muerte! Edición Boricua en Español! Ya sabe, fanático-¡puede leer esta historia repleta de acción en el idioma de Puerto Rico, y tomar parte en las aventuras de sus favoritos exploradores del desconocido como nunca antes!\r<br>\r<br>No se pierda esta edición especial de 38 páginas, en la que los Cuatro Fantásticos se enfrentan a uno de sus antagonistas más extraños-¡e intentan salir a salvo de la Isla de la Muerte!\r<br>\r<br>Rated A ...$3.99\r<br>", "Fantastic Five: The Final Doom (Trade Paperback)": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff - and cameos galore! Collecting FANTASTIC FIVE #1-5.\r<br>Rated A ...$13.99\r<br> \r<br>", "X-Men: The Complete Onslaught Epic Vol. 1 TPB (Trade Paperback)": "It begins here! The saga that literally re-made the Marvel Universe of the 1990s is collected in chronological order across four volumes! The psionic force of nature known only as Onslaught sprang forth from the fractured psyche of mutant mentor Charles Xavier and the genetic terrorist called Magneto. Powered by his progenitors' rage, Onslaught laid siege to humanity -- touching off a cataclysmic conflict destined to deprive a world of its most revered icons! Collecting X-MEN #53-54, UNCANNY X-MEN #334-335, AVENGERS #400-401, ONSLAUGHT: X-MEN, X-MAN #18, X-FORCE #57, CABLE #34 and INCREDIBLE HULK #444.\r\n272 PGS./Rated T  '$29.99\r\nISBN: 978-0-7851-2823-6", "Marvel Adventures Fantastic Four (2005) #31": "Cleanup on Aisle Four!!!! MAN, the FF just CAN'T catch a break! Even when they're just going shopping, they gotta deal with evil geniuses that've created an entire STORE designed to destroy our heroes!\r<br>All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 8 TPB (Trade Paperback)": "John Byrne's FF endeavors end in era-transcending odysseys when the World's Greatest Super-Team ventures into the Negative Zone, a remade past and a future sculpted around the FF itself! Plus, the death, life and rebirth (not necessarily in that order) of Doctor Doom! Guest-starring Nick Fury, the Avengers and the Beyonder! Collecting FANTASTIC FOUR #287-295.\r<br>Rated A ...$24.99 \r<br>", "Black Panther (2005) #32": "Someone get them a road map! The new Fantastic Four have just taken another wrong turn on the dimensional superhighway -- and this time, they've landed in the middle of a gang-war between machine-gun toting Skrulls!", "Marvel Adventures Fantastic Four (2005) #30": "You've been bombarded with cosmic rays, granting you astounding abilities beyond the average human...do you use those powers to explore amazing new worlds and take on beings with near-limitless power, or do you take your skills to the streets and help the little man? \r<br>All Ages ...$2.99 \r<br>", "Fantastic Four (1998) #551": "THE EPILOGUE CHAPTER 1 The Fantastic Four and Doctor Doom cross paths when Doom travels back in time to stop Richards from destroying the world. Could it be that Reed is a danger to all that he has sworn to protect? Is he capable of such villainy?", "Cable & Deadpool (2004) #46 (Zombie Variant)": "Since Deadpool is twice as much trouble as anyone in the Marvel Universe, the only logical people who could possibly rescue him and Bob, Agent of Hydra, from their temporal tantrum are... the FANTASTIC EIGHT? Twice the guest stars! Twice the fun! But not twice the price! How can you say no? 32 PGS./Rated T+ $2.99", "Marvel Masterworks: The Avengers Vol. 7 (Hardcover)": "Earth's Mightiest Heroes assemble once again under the banner of the crème de la crème of comics collections-the Marvel Masterworks. Joined by the titanic talents of John Buscema, Gene Colan, and Barry Windsor-Smith, AVENGERS scribe, Roy Thomas, elevates the intrigue to fever pitch in yet another watershed collection. Featuring Hank Pym's first turn as Yellowjacket, Hawkeye's metamorphosis into Goliath, the wedding of Giant-Man and the Wasp, a solo adventure with the Black Panther, and building to a boil with a battle against the one and only Ultron, we dare to catch your breath while reading this classic collection! And to top it all off, we're including Roy Thomas and Howard Purcell's rare Black Knight tale from the pages of MARVEL SUPER-HEROES! Reserve that copy today, True Believer!\r<br>Collecting THE AVENGERS #59-68 and MARVEL SUPER-HEROES #17 \r<br>256 PGS./Rated A ...$54.99 \r<br>ISBN: 978-0-7851-2680-5 \r<br>MARVEL MASTERWORKS: THE AVENGERS VOL. 7 - VARIANT EDITION VOL. 84 \r<br>256 PGS./Rated A ...$54.99 \r<br>ISBN: 978-0-7851-2681-2\r<br>", "Marvel Adventures Fantastic Four (2005) #29": "Hmmmm...can't remember...Hulk Knit! No, that's not right. Hulk Bake Muffins! Nope, nope...Oh! I know...HULK SMASH!!!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #28": "The populace of Earth hates and fears the stranded SILVER SURFER. But he falls in with a TV self-help guru who encourages him to win the planet over to his side -- by solving all the world's problems! Wielding the Power Cosmic, the Silver Surfer single-handedly wipes out famine, poverty and war, becoming the most popular super hero ever -- as well as the greatest threat to Earth's continued existence! Why does the Fantastic Four have to stop the Surfer from...saving the world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (Trade Paperback)": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans. Collecting SILENT WAR #1-6\r<br>144 PGS./Rated T+ ...$14.99\r<br>ISBN: 978-0-7851-2425-2\r<br>", "Fantastic Five (2007) #5": "With the Earth already conquered and his teammates dying, Reed Richards faces his final battle with Doctor Doom--and only one will survive!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Spider-Man (2005) #31": "HOT HOT HEAT!!! Spidey gets caught in the crossfire of the Human Torch AND Pyro! ONE hothead would be rough enough...but TWO? It's Spidey flambé, brought to you by the one-two punch of David and Mhan!!!!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Spider-Man Family: Back in Black (Digest)": "The action begins with a feature-length tale starring Spider-Man's alien costume and guest-starring the Sandman! Peter Parker would love nothing more than to get a good night's sleep, but his sleek, symbiotic suit has plans of its own...and no one is gonna get in its way! Next, Venom is back in town, and he's on a rampage...but it has nothing to do with his vendetta against Spidey? What could be so important that Venom doesn't have the time to torture his nemesis? Peter Parker is determined to find out, but first he'll have to match journalistic wits with none other than Eddie Brock! And finally, remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say...knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler. Plus: backup stories featuring the Lizard and TWO Scorpions! Collecting SPIDER-MAN FAMILY #1-3\r<br>112 PGS./Rated A ...$8.99 \r<br>ISBN: 978-0-7851-2626-3 \r<br>", "Punisher War Journal Vol. 1: Civil War (Trade Paperback)": "Hey, there, Marvel Universe. He's back - with a vengeance. Taking no prisoners. Literally. With CIVIL WAR in full throttle mode, Frank Castle is feeling the heat. His safe houses have been raided and his munitions seized, and he's square in the crosshairs of a Marvel Universe big gun who always gets his man. Until now, this wasn't Frank's war. But when Spandex-clad baddies start carrying badges - well, let's just say that's something the Punisher can't abide. Brought to you by rising star Matt Fraction (The IMMORTAL IRON FIST), with eye-popping art by superstar Ariel Olivetti (LAST AVENGERS STORY). Collecting PUNISHER WAR JOURNAL #1-4, plus the black-and-white edition of issue #1.\r<br>144 PGS./Rated T+ ...$14.99 \r<br>ISBN: 978-0-7851-2315-6\r<br>", "Black Panther (2005) #30": "After taking a wrong interdimensional turn, the Fantastic Four have just become the daily special in the Zombie Universe! Seated at table one: Zombie Galacti! At table two: Zombie Skrulls! And at table three: a Zombie Monster from the Negative Zone!", "The Last Fantastic Four Story (2007) #1": "Legendary writer and Fantastic Four co-creator Stan Lee unites with artist John Romita Jr. to tell his final story of the team that started the Marvel age!\r<br>64 PGS./Rated A ...$4.99\r<br>", "PARADISE X VOL. 2 TPB (Trade Paperback)": "The epic, visionary EARTH X saga concludes.  Will the Heroes of Earth be able to solve the problems of the Paradise they helped create? Will their quest for a new Death entity succeed so the pain and suffering of the world's population ceases? Collecting PARADISE X #6-12,  RAGNAROK, DEVILS, A, X.\r<br>\r<br>352 PGS./Rated T+ ...$29.99 \r<br>\r<br>ISBN: 0-7851-2416-0 \r<br>\r<br>\r<br>", "Marvel Adventures Fantastic Four (2005) #27": "And you thought meeting your girlfriend's parents was uncomfortable... The Human Torch invites his new heartthrob Crystal's family over to the Baxter Building for dinner with his family without realizing they're Black Bolt, Medusa, Gorgon, Triton, Karnak and Lockjaw ... The Inhumans! When agents of Maximus The Mad show up to capture them, you can be sure knowing which fork to use will be the least of the FF's problems...\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Fantastic Five (2007) #4": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 6: Monsters & Mysteries (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits. Featuring the Mole Man, the Skrulls, Rama-Tut and the Sub-Mariner! Collecting \r<br>MARVEL ADVENTURES FANTASTIC FOUR #21-24.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "Fantastic Five (2007) #3": "Though his metal implants have been destroyed, a severely wounded but still fighting mad Ben Grimm must take on the cosmically-powered Dr. Doom, who reveals unexpected super-allies in his quest to destroy the Fantastic Five and conquer the entire world!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Fantastic Four (1998) #548": "Fantastic Four vs. Frightful Four-'Nuff Said!", "Uncanny X-Men (1963) #489": "With the Morlocks committing terrorist acts, it's up to the X-Men to stop them and figure out why these normally-peaceful mutants have turned to violence.  Guest-starring Storm and her friends in the Fantastic Four!", "Fantastic Five (2007) #2": "As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r<br>\r<br>32 PGS. /Rated A ...$2.99 \r<br>", "Black Panther (2005) #29": "The New Fantastic Four is stranded on the Skrull Planet in the MARVEL ZOMBIES universe! They're all that stand in the way of Zombie Skrulls intent of eating the entire universe!", "Paradise X Vol. 1 (Trade Paperback)": "In EARTH X, Captain America, the Fantastic Four, Thor, the Hulk and the X-Men discovered that their purpose - and the meaning of all super heroes and mutated people in the universe - was nothing more than to protect their host planet, in this case Earth, from outside invasion. They learned super heroes are merely biological antibodies to protect a growing embryo within the Earth. An embryo for the Celestial race: This is the way these Gods fought back - only to cause a terrible ecological imbalance, a rift at its core that in time would wipe out all life on the planet. In UNIVERSE X, Captain Marvel was reborn on Earth years after his death. But he also still claimed to walk in the realm of the unliving, where Earth's fallen champions still exist. Mar-Vell led a team of heroes in a quest for the greatest weapons of mass destruction on Earth, suggesting this would limit the destruction caused by the growing power struggle on the planet. But this was not the only reason. For his crusade on Earth only supported and armed a battle he fought in the realm of the fallen, a battle against Death herself. Those living champions who died in his collection of artifacts were added to the battle raging in this other realm. Mar-Vell led a charge against Death and killed her. But now that Death is dead, no one will ever die again. They may writhe in pain in hospitals because their bodies have been broken beyond repair, but they will not die. They will call out for an end to their suffering. They will cry out for peace but there will be no answer. Paradise will be denied them. Yes. Death is truly dead. Long live the living. Collecting PARADISE X #0-5, PARADISE X: XEN and HERALDS #1-3.\r<br>304 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2415-2\r<br>", "World War Hulk (2007) #2 (John Romita Jr.)": "The puny human \"heroes\" of Earth, including Reed Richards, Iron Man, Dr. Strange and Black Bolt, called the Hulk a monster and shot him into space. Now the Hulk has returned with a rage that knows no bounds-and he has a posse! Can the mightiest powerhouses of the Avengers stop the Hulk and his cadre of super-powered Warbound gladiators as they carve their path of mayhem through the concrete canyons of Manhattan? Can battling Ben Grimm and the rest of the Fantastic Four save Reed Richards from the Hulk's wrath? And what hope can She-Hulk have of calming her great green cousin's terrible rage?\r<br>40 PGS./Rated T+ ...$3.99\r<br>", "Marvel Adventures Fantastic Four (2005) #26": "A massive alien refugee fleet streams through our solar system, bearing the warning: \"Galactus is coming! Galactus is coming!\" And right behind them is the World-Devourer's herald, the SILVER SURFER -- headed straight for Earth! Reed Richards has only a few days to evacuate the planet before it's destroyed ... or, failing that, figure out a way to somehow stop the unstoppable!\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "World War Hulk (2007) #2": "The puny human \"heroes\" of Earth, including Reed Richards, Iron Man, Dr. Strange and Black Bolt, called the Hulk a monster and shot him into space. Now the Hulk has returned with a rage that knows no bounds-and he has a posse! Can the mightiest powerhouses of the Avengers stop the Hulk and his cadre of super-powered Warbound gladiators as they carve their path of mayhem through the concrete canyons of Manhattan? Can battling Ben Grimm and the rest of the Fantastic Four save Reed Richards from the Hulk's wrath? And what hope can She-Hulk have of calming her great green cousin's terrible rage?", "Fantastic Five (2007) #1": "\"The Final DOOM!\" Part 1 of 5\r\n<br>As the Human Torch and Lyja discuss the merits of leaving the F5 to form their own team and Sharon Ventura returns to confront her ex-husband the Thing, the real Doctor Doom returns with cosmic-like power and a thirst for revenge on Reed Richards and the Sub-Mariner!  Also starring the Invisible Woman, Psi-Lord and Kristoff--and cameos galore!\r\n<br>32 PGS./Rated A ...$2.99\r\n<br>", "INVADERS CLASSIC VOL. 1 TPB (Trade Paperback)": "The Big Three of Marvel's Golden Age -- Captain America, the Human Torch and the Sub-Mariner -- entered their first alliance when the U.S. entered World War II! But the Axis had more than bombs to throw at them, as they soon learned in a battle with the Star-Gods! The Red Skull wants the Invaders themselves as Hitler's top hitmen, and only a second gathering of Golden Age greats can stop him! Featuring the first appearances of Spitfire, Union Jack and more! COLLECTING INVADERS #1-9, GIANT-SIZE INVADERS #1 and MARVEL PREMIERE #29-30.\r<br>240 PGS./Rated A ...$24.99\r<br>", "Black Panther (2005) #28": "The New Fantastic Four just has landed in the middle of Zombie-verse! If the Black Panther, Storm, the Human Torch and the Thing can't come up with the perfect escape plan, they're going to be the next hors d'ouvres for Zombie Galacti!", "Silent War (2007) #6": "Can Black Bolt hold it together as he suffers the unkindest cut of all? Betrayal, madness and a battle for the ages as the U.S.A. strikes back at Attilan.  Super-powered Kamikaze Marines go head-to-head with the Incomparable Inhumans in a battle for death ... or glory.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 7 TPB (Trade Paperback)": "Marvel once again poses the question, \"What If...?\" In \"The Other,\" Peter Parker returned from the dead and embraced his \"inner spider.\"  But what if he had been completely consumed by his inner, bestial impulses and became more spider than man? \"Disassembled\" was the darkest day in Avengers history. But what if the greatest threat had gone undetected? Hydra made Wolverine an \"Enemy of the State.\" But what if the world's deadliest killing machine was never de-programmed? In \"Deadly Genesis,\" Professor X sent a secret squad of young mutants to the living island, Krakoa, in an ill-fated attempt to rescue the original X-Men before he formed the now-famous All-New, All-Different team. But what if this second team had survived? Attempting to slay Magneto Legion accidentally killed Professor X, giving rise to the \"Age of Apocalypse.\" But what if Legion killed both Magneto and Xavier, leaving no leader to create any incarnation of X-Men to resist the onslaught of Apocalypse? Collecting WHAT IF? AVENGERS DISASSEMBLED, SPIDER-MAN THE OTHER, WOLVERINE ENEMY OF THE STATE, X-MEN AGE OF APOCALYPSE and X-MEN DEADLY GENESIS.\r<br>176 PGS./Rated T+ ...$16.99 \r<br>ISBN: 0-7851-2183-8\r<br>", "Fantastic Four Omnibus Vol. 2 (Hardcover)": "With all that Stan Lee and Jack Kirby accomplished in their first 30 issues of FANTASTIC FOUR, who would have thought they were just warming up? Well, True Believers, now it's time to jump into the fire because the second 30 are where they really start to turn up the heat!\r<br>Their achievements reflect the boundless energy of two creators at the top of their game with each issue, character and creation building upon and exceeding the scope of the last. It's a list of accomplishments unparalleled in the history of comics: the origin of Dr. Doom; the Frightful Four; the Wedding of Reed Richards and Sue Storm; the Inhumans; the first appearance of the Silver Surfer; the Galactus Saga; the debut of the world's first black super hero, the Black Panther; the cosmic clash between the FF, the Surfer and Dr. Doom; and, of course, \"This Man, This Monster!\" - the story widely regarded as the greatest FF tale of all! \r<br>Collecting the greatest stories from the World's Greatest Comics Magazine in one, massive collector's edition that has been painstakingly restored and recolored from the sharpest material in the Marvel Archives. With critical essays on the Lee/Kirby collaboration and bonus features a-plenty, this book is nothing short of a cornerstone to the Marvel Universe!\r<br>Collecting FANTASTIC FOUR #31-60 and ANNUAL #2-4.\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2403-9\r<br>Trim size: oversized\r<br>FANTASTIC FOUR OMNIBUS VOL. 2 HC - VARIANT EDITION\r<br>832 PGS./All Ages ...$99.99\r<br>ISBN: 0-7851-2510-8\r<br>", "Marvel Adventures Fantastic Four (2005) #25": "The Human Torch falls into a probability rift and finds himself flung across innumerable alternate realities, including: a world where a heroic Victor Von Doom, a.k.a. Doc Iron, battles against Mr. Devious, Monsterman, The Human Pyre, and The Unstoppable Woman ... a.k.a. The Frightful Four, a world where the Femmetastic Four defends a world completely depopulated of men (then Johnny shows up) and a world where Johnny's arch-nemesis runs the FF ... That's right, SPIDER-MAN! Can The Watcher help Torch get back to his timeline, or will he wander forever through \"The Worlds of What If?\" \r<br>And a warm welcome to new cover artist PAUL SMITH!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Spider-Man Family (2007) #3": "Remember back in the day, when super heroes would fight other super heroes? What? That still happens? Civil...what? Well, ANYway...we're taking you back in time, when Spidey was pretty new at all this super hero stuff, and would make silly mistakes, like, oh, say..knocking out the Invisible Girl! I think her friends might want to have a talk with the web-crawler...\r<br>Also! We've got a backup story featuring TWO Scorpions, Spider-Man J and classic Spidey archives !\r<br>104 PGS./Rated A ...$4.99\r<br>", "Fantastic Four/Inhumans (Trade Paperback)": "The incredible Inhumans have long been allies to the FF in defending the Earth, but what happens when they leave it? And what awaits them when they come back? See for yourself in a saga where treachery, intrigue and buried secrets reach from the depths of space to deep within Inhuman history! Guest-starring Ronan and Starlord of ANNIHILATION! Collecting INHUMANS (2000) #1-4 and FANTASTIC FOUR #51-54.\r<br>192 PGS./Rated T+ ...$19.99\r<br>ISBN: 0-7851-2703-8\r<br>", "Fantastic Four: The End Premiere (Hardcover)": "Alan Davis writes and pencils the final story of Marvel's first family! Even the strongest family can be torn apart by tragedy - and in the futuristic world of tomorrow, the members of the once-Fantastic Four are divided and vulnerable to opponents from their past. What events could have caused the FF to go their separate ways, and how does their disbanding set the stage for a conflict that will send shockwaves across the galaxy and beyond? Collecting FANTASTIC FOUR: THE END #1-6\r<br>144 PGS./Rated T+ ...$19.99 \r<br>", "Silver Surfer: Requiem (2007) #1": "The latest offering from the Marvel Knights line. Guest-starring the Fantastic Four! \r<br>For untold years Norrin Radd has surfed the galaxy, exploring the darkness between stars, witnessing the rise and fall of vast civilizations.  Now his ride is about to come to an end.  It starts with a small spot -- a blemish that will spread until he is no more.  Until then, the Silver Surfer would undertake his final voyage -- to the one destination that has always eluded him.  His journey starts where it began.\r<br>32 PGS./CARDSTOCK COVER/Rated T+ ...$3.99 \r<br>", "Marvel 1602: Fantastick Four (Trade Paperback)": "Doom returns! The Four from the Fantastik's greatest enemy has an insidious plan that takes them to the ends of the Earth! Peter David (FRIENDLY NEIGHBORHOOD SPIDER-MAN, X-FACTOR) takes the reins with superstar artist-to-be Pascal Alixe (Superman, The Legion) for the eagerly awaited spin-off from Neil Gaiman's 1602. What does Doom want? Why doesn't Invisible Woman want to fight him? And what does Shakespeare have to do with it? Collecting MARVEL 1602: FANTASTICK FOUR #1-5.\r<br>120 PGS./Rated T+ ...$14.99\r<br>", "Marvel Adventures Fantastic Four (2005) #24": "A trio of priceless tridents has been stolen from Atlantis, and the prime suspect is ... the Invisible Woman! Can Mr. Fantastic trade his scientist's hat for a detective's and uncover the real culprits before the SUB-MARINER declares war on the surface world?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Black Panther (2005) #27": "INITIATIVE tie-in. Black Panther and the new Fantastic Four must combat a creature from the Negative Zone.", "FANTASTIC FOUR VISIONARIES: WALTER SIMONSON VOL. 1 TPB (Trade Paperback)": "After a string of successes with THOR, X-FACTOR and AVENGERS, it's sensational Simonson storytelling for Marvel's First Family - starting when the FF's Congressional hearing is disrupted by dozens of vengence-seeking villains! After the famous foursome - plus Ms. Marvel - deal with the Capitol chaos, a time anomaly sends them to find the future's fate! But while Kang and Nebula take up their time, will the universe fall to Galactus? Guest-starring Thor, Iron Man and Death's Head! Collecting FANTASTIC FOUR #334-341.\r<br>192 PGS./Rated A  ...$19.99 \r<br>", "Fantastic Four (1998) #545": "The New FF has a doozy of a first job...stopping Galactus and the Silver Surfer!", "Silent War (2007) #4": "The pressure builds on Black Bolt. The hawks in the Inhumans council are calling for all-out war and as he struggles to make his fateful decision, Black Bolt finds himself betrayed. As if that weren¹t enough, a terrible secret from his past is revealed. It's enough to make a man scream.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "AMAZING SPIDER-MAN OMNIBUS VOL. 1 HC (Hardcover)": "In 1962, in the pages of a comic book slated for cancellation, Stan Lee and Steve Ditko gave birth to one of the most-enduring icons in American popular media: the one and only Amazing Spider-Man! Turning the concept of a super hero on its head, they imbued the young, guilt-ridden Peter Parker with the fantastic powers of an arachnid and the fantastic pressures of an everyday teenager. The combination was pure magic.\r<br>During the course of 40 issues of web-slinging, wisecracking wonderment Lee and Ditko built the foundation for 45 years of Spidey spectaculars - girl trouble; bill trouble; bully trouble; the Daily Bugle; and a cast friends, family and, of course, super-villains unlike any other!\r<br>Completing the entire Stan Lee/Steve Ditko Spider-Man run in one massive volume -including every page, every pinup and every letters column. Not to mention unused covers, critical essays and bonuses galore! \r<br>We went back to the Mighty Marvel Archive to restore each and every page in this volume for painstaking accuracy to the originals. There's no kidding - this collector's edition is the guaranteed be-all, end-all book for the Spider-Man fan!\r<br>Collecting AMAZING FANTASY #15, AMAZING SPIDER-MAN #1-38 and ANNUAL #1-2, STRANGE TALES ANNUAL #2, and FANTASTIC FOUR ANNUAL #1.\r<br>1088 PGS./All Ages ...$99.99\r<br>", "Marvel Adventures Fantastic Four Vol. 5: All 4 One, 4 for All (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits! Featuring the Absorbing Man, Arcade, Iceman of the X-Men...and Sue Storm, Secret Agent!? Collecting MARVEL ADVENTURES FANTASTIC FOUR #17-20.\r<br>96 PGS./All Ages ...$6.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #23": "RAMA-TUT, the Pharaoh from the Future, has reached through time to kidnap the Thing's girlfriend (who happens to be quite the sculptress) to design his pyramid for him, and only the Four can rescue her!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Black Panther (2005) #26": "INITIATIVE tie-in. Black Panther and Storm join Human Torch and Thing as the New Fantastic Four!", "Silent War (2007) #3": "Luna is forced to make a heart-breaking choice that could cost her life as the Inhumans finally track Quicksilver to Mutant Town and we see just how far he has descended into madness. This is a man who has seen the future and if his prophecies come true, things are looking very bleak for the Inhumans. If that wasn't bad enough, when Madrox and Layla arrive, things really get messed up.\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Wolverine: Weapon X Premiere (Hardcover)": "Wolverine's a lot of things to a lot of people, but to one infamous enclave he was nothing but a weapon. And weapons kill people. They found that out well enough. Find out for yourself in this prequel to recent revelations of the murderous mysteries that have mesmerized our favorite mutant! Collecting MARVEL COMICS PRESENTS #72-84.\r<br>136 PGS./Rated T+ ...$19.99 \r<br>", "Spider-Man: Birth of Venom (Trade Paperback)": "The Beyonder's Battleworld might seem a strange place to get new threads, but it's Spider-Man who becomes unraveled when his shape-changing costume attempts to darken his life as well as his fashion sense! But ridding himself of his riotous raiment proves an even greater mistake when its alien enmity bonds with mortal madness to form our hero's most dedicated decimator! Plus: the first appearances of Puma and the Rose! Mary Jane Watson's startling secret! And the debut of the battling...Bag-Man!? Guest-starring the Black Cat, the Fantastic Four and more! Collecting SECRET WARS #8; AMAZING SPIDER-MAN #252-259, #298-300 and #315-317; FANTASTIC FOUR #274; and WEB OF SPIDER-MAN #1;  AMAZING SPIDER-MAN ANNUAL #10.\r\n344 PGS./Rated A ...$29.99", "Marvel Adventures Fantastic Four (2005) #22": "The Invisible Woman and Mr. Fantastic are on one final date to save their relationship, but with a strike team of sinister SKRULLS stalking them, their relationship isn't the only thing in jeopardy!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: The End (2006) #6": "One last chance to put the past behind them and unite as a family. One final test of their mettle as super heroes and human beings. Do the members of the Fantastic Four possess the fortitude to conquer this greatest of challenges to humanity and to their own happiness? \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Spider-Man: Saga of the Sandman (Trade Paperback)": "It was no day at the beach when criminal Flint Marko was mutated into one of Marveldom's most versatile villains and began a career of kicking sand in our favorite heroes' faces! Some of the best battles between Sandman, Spider-Man, the Fantastic Four and the Hulk are collected here in commemoration of his gritty film debut! Collecting AMAZING SPIDER-MAN #4 and #18-19, FANTASTIC FOUR #61, INCREDIBLE HULK #138, MARVEL TEAM-UP #1, MARVEL TWO-IN-ONE #86, and UNTOLD TALES OF SPIDER-MAN #3.\r<br>176 PGS./Rated A ...$19.99 \r<br>", "Civil War: Front Line (2006) #11": "CLASSIFIED INFORMATION!", "Silent War (2007) #2": "Deep beneath the Pentagon the O*N*E is experimenting on the captured Inhumans with horrifying results. On Attilan, while pressure builds for all-out war on humankind, Quicksilver's young daughter Luna uses her developing powers of empathy to probe the dark corners inside the mind of Black Bolt's brother, Maximus the Mad. \r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Masterworks: Daredevil Vol. 4 (Hardcover)": "It's an identity crisis for Daredevil as Matt Murdock juggles a bevy of baddies seeking to sully his good name while he juggles the triple-identity of Matt Murdock, Mike Murdock, and DD! You just might want to ready your slide ruler for tragedy with this kind of trigonometry.\r<br>After a dust-up with the Beetle, the Trapster attempts to trick the Fantastic Four into attacking DD by disguising himself as none other than ol' hornhead himself! Wiser minds prevail, but only until none other than Dr. Doom steps up to the plate! In one of Daredevil's most amazing Silver Age adventures, he goes toe-to-toe with Doc Doom-in opposite toes! You guessed it, the Latverian monarch switches bodies with Daredevil bringing on a battle that drags the Fantastic Four, Spider-Man, Thor into the mix in one of Marvel's first crossover bonanzas!\r<br>As if kicking him out of his own body wasn't enough, next the Exterminator tries to evict Daredevil from the time stream! With the Unholy Three at his employ to clobber the hornhead back into the Stone Age, he's got a good chance of succeeding 'cause there's at least one cast member that won't be making it out of this adventure alive. Collecting DAREDEVIL (Vol. 1) #33-41 and FANTASTIC FOUR (Vol.1) #73.\r<br>224 PGS./All Ages ...$54.99\r<br>", "Marvel Adventures Fantastic Four (2005) #21": "The creatures of MONSTER ISLE have finally overthrown and exiled the MOLE MAN. And for their new leader they recruit the bravest, noblest monster they know ... the Thing!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Fantastic Four: The End (2006) #5": "The Mole Man! Ronan the Accuser! Diablo! The Mad Thinker! Annihilus! As the four members of the fractured family are drawn back together by a web of intrigue,  these villains and more will stand against them-with the future of humanity itself at stake!\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Punisher War Journal (2006) #3": "Civil War tie in\r<br>The Punisher.  Captain America.  Uneasy allies in even the best of times, now two fugitives fighting a common enemy in CIVIL WAR.  Every war is won or lost based on one decisive battle-- this might be the endgame for CIVIL WAR.  A clash that's been building for thirty years comes to a ferocious head as The Punisher and Captain America finally collide, and the reverberations will be felt for months to come.  Cap made a deal with the devil -- what happens when the devil comes to collect?\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #20": "THE HUMAN TORCH is really really hot. ICEMAN is really really cool. And they really really don't like one another. So we've stranded them together with a bunch of pretty girls and a super-villain! Let's see what happens!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Silent War (2007) #1": "SON OF M told how Quicksilver stole the precious Terrigen Mists from the Inhumans and how Black Bolt retaliated by declaring war on humanity. Now that war is about to break loose as Gorgon leads a terrorist attack on New York. Old friends become deadly enemies when the Fantastic Four are forced to defend their city against the Inhumans.\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Avengers Assemble Vol. 4 (Hardcover)": "The Avengers embark on international adventure against a nation-sized knight and a city of Hulks! Then, it's off to small-town Centerville to face Salem's Seven and the Sons of the Serpent! Plus: A major Marvel crossover! Avengers in space, and inquiries answered by the man who knows Earth's Mightiest Heroes best! Collecting AVENGERS #35-40 and ANNUAL 2000-2001, AVENGERS: THE ULTRON IMPERATIVE, and MAXIMUM SECURITY #1-3 and DANGEROUS PLANET.\r<br>416 PGS./Rated T+ ...$34.99\r<br>", "Fantastic Four (1998) #542": "CIVIL WAR Tie-In!  The Fantastic Four as we know them are finished, torn apart by the strife of CIVIL WAR! What will happen to the fragmented first family of Marveldom now-and will some other foursome rise to take their place?", "Fantastic Four: The End (2006) #4": "Their family scattered to the four corners of a solar system quarantined from the rest of the universe, besieged by a number of their most relentless enemies, including the Super-Skrull, the Mole Man, Diablo, the Mad Thinker and the Kree Sentry, can the members of the Fantastic Four survive-and triumph?\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Civil War: Front Line (2006) #10": "The betrayer among the Marvel heroes stands revealed, as war with Atlantis seems inevitable! And Speedball comes face-to-face with his accuser!\r<br>32 PGS. /Rated T+ ...$2.99 \r<br>", "Marvel 1602: Fantastick Four (2006) #4": "Count Otto Von Doom has a nefarious plan that only the Four from the Fantastick can thwart! But before they can thwart anything, they have to stop fighting each other.", "Marvel Masterworks: Golden Age All-Winners Vol. 2 (Hardcover)": "See the golden age in its glory as Captain America stops a plot against General Douglas MacArthur! The Human Torch foils a plan to freeze the English Channel!  The Destroyer fights the forces of the Devil himself! Plus the Sub-Mariner, the Whizzer, and more! With such wartime villains as the Stone-Man Slayer, Doctor Togu the Vampire, the Mock Mikado, and Doctor Crime, one of the few enemies Captain America had to fight more than once! Plus meet little-known characters like the Black Avenger, Raffles the Cracksman, and the Whizzer's sidekick Slow Motion Jones! With text stories by Mickey Spillane! Collecting All-Winners Comics #5-8\r<br>280 PGS./ Rated T+ ... $49.99\r<br>ISBN: 0-7581-2406-3\r<br>Marvel Masterworks: Golden Age All-Winners Vol. 2 - Variant Edition vol. 67\r<br>280 PGS./ Rated T+ ... $54.99\r<br>", "Heroes Reborn: Avengers (Trade Paperback)": "Cap, Thor, the Vision, Hawkeye, Hellcat, Mantis and more: The Avengers lineup is both new AND classic on an Earth that hits them with villains as fast as they can assemble! Revised versions of Ultron, the Radioactive Man, the Grim Reaper and many more prove their mastery of evil against Reborn Earth's mightiest heroes! Plus, the Heroes Reborn Universe only got a piece of the Hulk - but, darn it, it may still be more than it can handle! Guest-starring Nick Fury and the \r<br>Fantastic Four! Collects AVENGERS (VOL. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99  \r<br>", "Marvel Adventures Fantastic Four (2005) #19": "Ever have one of those days when it seems that someone's just out to get you? Well, MISTER FANTASTIC's having one of those days...because ARCADE's after him! Can the world's smartest hero survive a fun house of horrors without the rest of  his teammates?\r<br>(Psst! We ain't tellin'! Buy the book!)\r<br>32 PGS./All Ages ...$2.99\r<br>", "What If? Classic Vol. 3 (Trade Paperback)": "It's alternate-Earth anarchy as Doctor Strange, Captain Marvel, Ghost Rider, Spider-Woman, Nova and Shang-Chi are turned against humanity when fate is tossed a twist by that infamous question mark! Plus: The Howling Commandos fight for Earth, and Spider-Man fights for...ratings!? Featuring the Fantastic Four, Daredevil and Hellstorm! Collects WHAT IF? #14-15 and #17-20.\r<br>216  PGS./All Ages ...$24.99\r<br>", "Marvel Adventures Fantastic Four Vol. 4: Cosmic Threats (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on the powerful malevolent alien calling himself the Grant Master, the cosmic scavenger Terminus and the mad Titan known as Thanos - and have a close encounter with a world gone bonkers! Guest-starring Captain Marvel! Collects MARVEL ADVENTURES FANTASTIC FOUR #13-16.\r<br>96 PGS./ All Ages ... $6.99\r<br>", "Fantastic Four: The End (2006) #2": "Alan Davis writes and pencils the final story of Marvel's first family! Even the strongest family can be torn apart by tragedy-and in the futuristic world of tomorrow, the members of the once-Fantastic Four are divided and vulnerable to opponents from their past. What events could have caused the FF to go their separate ways, and how does their disbanding set the stage for a conflict that will send shockwaves across the galaxy and beyond?\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Civil War: Front Line (2006) #8": "In \"Embedded\": Hot on the trail of a revelation that could explode the rift between the pro-registration and anti-registration heroes and forever change the nature of the Registration Act, the Daily Bugle's Ben Urich and Sally Floyd have the story. Can they bring the power to the people?\r<br>In \"The Accused\": His powers are gone, he's been held culpable for the worst super-human disaster in history, and every super-villain in prison is looking to take a piece of Speedball. Will he make it out alive, and with hundreds of deaths on his conscious, does he want to? Also featuring true tales of war time in Civil War \"Correspondence!\"\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #18": "Flying cars, covert missions and secret handshakes...by day, she is the Invisible Girl of the Fantastic Four, but by night, she is...SUE STORM, SECRET AGENT!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Heroes Reborn: Iron Man (Trade Paperback)": "Iron Man left two lives behind when he vanished, but can he avoid his former mistakes in his new one? The armored Avenger takes on Hydra, Heralds and the Hulk - and the eyes of the Marvel Universe are upon him in the form of Loki, the Watcher and Onslaught himself! Featuring Doc Samson and - or rather, AS - the Abomination! Plus: Rebel O'Reilly, later of THUNDERBOLTS fame! Collects IRON MAN (VOL. 2) #1-12.\r<br>336 PGS./Rated A ... $29.99\r<br>", "Fantastic Four: First Family (Trade Paperback)": "For the first time, untold secrets of the Fantastic Four's earliest days are revealed! What happened the moment after Reed Richards' rocket crash-landed? What happened - to Sue Storm, to Ben Grimm, to Johnny Storm - in the days following that fateful event? An in-depth, action-packed, psychologically thrilling exploration of the FF's origin! Collects FANTASTIC FOUR: FIRST FAMILY #1-6.\r<br>144 PGS./Rated A... $15.99\r<br>", "Fantastic Four: The End (2006) #1": "Alan Davis writes and pencils the final story of Marvel's first family! Even the strongest family can be torn apart by tragedy-and in the futuristic world of tomorrow, the members of the once-Fantastic Four are divided and vulnerable to opponents from their past. What events could have caused the FF to go their separate ways, and how does their disbanding set the stage for a conflict that will send shockwaves across the galaxy and beyond?\r<br>32 PGS./Rated T+ ...$2.99 \r<br>", "Heroes Reborn: Fantastic Four (Trade Paperback)": "The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>The Fantastic Four are Reborn, but it could be a short and unwonderful life as menaces emerge from the earth, the sea and Latveria! But even the Mole Man, Namor and Doom himself pale before the threat of Galactus and his Heralds (one finally just wasn't enough)! Featuring the Avengers, S.H.I.E.L.D. and more! Guest-starring Wolverine and Franklin Richards, Son of a Genius! Collects FANTASTIC FOUR (Vol. 2) #1-12.\r<br>336 PGS./Rated A ...$29.99 \r<br>", "Captain America: Winter Soldier Vol. 2 (Trade Paperback)": "The questions plaguing Captain America's dreams and memories have been answered in the most brutal way possible. And in the wake of this brutality, General Lukin makes his first all-out assault - tearing open old wounds and threatening to make new scars that will never heal! Collects CAPTAIN AMERICA #8-9 and #11-14.\r<br>136 PGS./Rated T+ ...$14.99\r<br>", "Civil War: Front Line (2006) #7": "In \"Embedded\": Hot on the trail of a revelation that could explode the rift between the pro-registration and anti-registration heroes and forever change the nature of the Registration Act, the Daily Bugle's Ben Urich and Sally Floyd have the story. Can they bring the power to the people?\r<br>In \"The Accused\": His powers are gone, he's been held culpable for the worst super-human disaster in history, and every super-villain in prison is looking to take a piece of Speedball. Will he make it out alive, and with hundreds of deaths on his conscious, does he want to? Also featuring true tales of war time in Civil War \"Correspondence!\"\r<br>32 PGS./Rated T+ ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #17": "Hey, what's blue-eyed, rocky orange and in love all over? BEN GRIMM, a.k.a. THE THING! Ol' Benjy's fallen for a girl, and the only thing that could break the spell is...THE ABSORBING MAN!?!?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Masterworks: The Amazing Spider-Man Vol. (Hardcover)": "It's time for another round of webslinging wonderment by two of the men who put the \"master\" in Masterworks, Stan \"The Man\" Lee and \"Jazzy\" John Romita. They'll be coming at you in this arachnid eighth volume with a storyline as epic as they come: The Saga of the Stone Tablet! \r<br>All the swingin' calamity and social consciousness kicks off with the Kingpin's quest to decipher an ancient clay tablet whose secrets promise great power. Poor ol' Spidey gets into the mix and after saving the day finds himself branded Public Enemy No. 1 ('natch). With the Kingpin on one side and J. Jonah Jameson turning up the heat in the Daily Bugle, things go from bad to horrible with the introduction of Man-Mountain Marko and Maggia bossman, Silvermane. It's a Peter Parker pressure cooker only gets that only gets turned up from there!\r<br>Also featuring battles with Quicksilver, the Shocker, and the Lizard along with an extra-special bonus, the 1968 Stan Lee/Ross Andru Spidey yarn from Marvel Super-Heroes #14.\r<br>Collecting THE AMAZING SPIDER-MAN (Vol. 1) #68-77 and MARVEL SUPER-HEROES #14. \r<br>240 PGS./All Ages ...$49.99\r<br>", "Civil War: Front Line (2006) #6": "Embedded within the heart of the battle between super hero registrants and resistors you \r<br>will learn the real story behind both sides of the Civil War! In any conflict there are those \r<br>who want to keep the facts hidden, but on the Front Lines the truth will be told.\r<br>In \"The Accused\": The New Warriors survivor goes on trial! Their life was spared from the Stamford Disaster. Will justice be so kind?\r<br>Also featuring true tales of war in Civil War: Correspondence.\r<br>32 PGS. NO ADS!/Rated T+ ...$2.99  \r<br>", "Marvel Adventures Fantastic Four (2005) #16": "When the Titan known as THANOS captures Captain Marvel and uses his cosmic powered Negabands to travel to planet earth, not even the combined powers of the Fantastic Four are enough to stop him! To save the earth they must first save Captain Marvel who is trapped light years away in deep space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 6 TPB (Trade Paperback)": "At last, the Thing returns from the Secret Wars - but he's been replaced in more than just the heart of the team! The FF learn the shocking secrets of their deadliest enemy, and it only costs them everything they hold dear! Plus: Franklin Richards vs. Mephisto! And the Psycho-Man gives the Invisible Girl a makeover neither will ever forget! Guest-starring Daredevil, Spider-Man, Iron Fist and Luke Cage! Collects FANTASTIC FOUR #276-284, THING #23 and SECRET WARS II #2.\r<br>264 PGS./Rated A ...$24.99\r<br>", "Marvel Masterworks: The Human Torch Vol. (Hardcover)": "Turn back the clock to 1962. After the debut of a quiet little magazine called The Fantastic Four and a relatively unknown teen hero named Spider-Man, Mighty Marvel decided to go out on a limb and put these two risky ideas together into a featuring starring...The Human Torch. With Jack Kirby on art, man, talk about yer risky business, True Believers.\r<br>But, believe it or not, yes, even with that kind of pedigree it was a sure-fire hit! Johnny Storm the thrill-seeking, impulsive teen wonder of the Fantastic Four set the world on fire in these scorchin' solo stories!\r<br>He's going to head-to-head against none other than Namor the Sub-Mariner, Spider-Man, Captain America, Paste-Pot Pete, the Wizard, the Sandman and the Living Bomb! If that ain't diagnosis teenage angst, than you can call me Freud!\r<br>Collecting Strange Tales #101-107 and ANNUAL #2.\r<br>272 PGS./All Ages ...$49.99\r<br>", "Civil War: Front Line (2006) #5": "Embedded within the heart of the battle between super hero registrants and resistors you \r<br>will learn the real story behind both sides of the Civil War! In any conflict there are those \r<br>who want to keep the facts hidden, but on the Front Lines the truth will be told.\r<br>In \"The Accused\": The New Warriors survivor goes on trial! Their life was spared from the Stamford Disaster. Will justice be so kind?\r<br>Also featuring true tales of war in Civil War: Correspondence.\r<br>32 PGS. NO ADS!/Rated T+ ...$2.99", "Fantastic Four: First Family (2006) #6": "The final chapter in the FF's baptism by fire!  It all comes down to the final confrontation between a fractured family and their very first arch-enemy... not to mention a base full of cosmically-irradiated monsters!  Everything -- including the future of the FF -- will be decided here!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #15": "The Fantastic Four travel to the South Pole to study a newly-discovered species, but find themselves on the front lines of a battle against TERMINUS, the cosmic scavenger! The clock is ticking down toward Armageddon as the FF make their stand against a superior force from outer space!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 3: World's Greatest (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they take on Klaw, the Black Panther, the Molecule Man and Dr. Doom! Collects MARVEL ADVENTURES FANTASTIC FOUR #9-12.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Black Panther (2005) #18": "BRIDE OF THE PANTHER PART 5 The Black Panther and Storm are ready to tie the knot. Prepare for the wedding of the decade!", "Civil War: Front Line (2006) #4": "\"Embedded\" - Civil War has ignited across the Marvel Universe! Embedded reporters Sally Floyd and Ben Urich are driven into the heart of battle-a battle in which a hero will fall. Their investigations will take Sally into the heart of Captain America's resistance, while Urich is about to get reacquainted with a certain green friend...\r<br>\"The Accussed\" - Despised by a nation, the lone survivor of the New Warriors' team is behind bars. Without family, without a friend in the world and without a reason to go one, will this hero make a deal, or take a stand?\r<br>\"Correspondence\" - Juxtaposing stories of war throughout time with the Marvel Civil War, \"Correspondence\" adapts tales from World War I and more!\r<br>32 PGS. NO ADS!/Rated T+ ...$2.99 \r<br>", "Black Panther (2005) #18 (TURNER VARIANT)": "CIVIL WAR Tie-in\r\n\"BRIDE OF THE PANTHER\"\r\nSPECIAL DOUBLE-SIZED ISSUE! It's the Wedding of the Century as T'Challa and Storm finally make it to the altar -- and not since Reed and Sue tied the knot have so many of Marvel's super heroes assembled for such a happy occasion.  Can this gathering offer much-needed respite from the Civil War that's erupted in the U.S., or will it too be engulfed by the insanity that's currently rocking the Marvel Universe?  Don't miss this historic event -- and turning point in the CIVIL WAR.  Featuring backup features, including a look behind the scenes at the creation of Storm's wedding gown, and wraparound cover by Frank Cho!  Part 5 (of 5).\r\n48 PGS./Rated T  ...$3.99", "New Avengers Vol. 2: Sentry (Trade Paperback)": "THE MYSTERY OF THE SENTRY REVEALED! The Avengers try to help the most powerful super hero in the world figure out who he is and where he came from! But will this knowledge destroy the man they're trying to help? Collects NEW AVENGERS #7-10 and the NEW AVENGERS: MOST WANTED FILES handbook.\r<br>152 PGS./Rated A ...$14.99\r<br>", "Marvel Adventures Fantastic Four (2005) #14": "While attempting to communicate with extraterrestrials via deep space communication, the Fantastic Four unknowingly gaining the attention of a powerful malevolent alien calling himself the Grand Master. Now each member of the Fantastic Four must battle in individual competition as the fate of the world hangs in the balance.\r<br>32 PGS./All Ages ...$2.99\r<br>", "Civil War (2006) #1 (sketch variant)": "Go behind the lines of the Marvel Comics event starring Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon. This bonus edition reprints CIVIL WAR #1 - plus script, sketches, deleted scenes and more!\r\n64 PGS./ Rated T  ...$4.99", "Avengers Assemble Vol. 3 (Hardcover)": "The crisis of the Eighth Day is followed by Triathlon's first day as an Avenger, which takes the team south of the border and back in time thousands of years! And how does the mystery of Madame Masque match the curse of Count Nefaria? Guest-starring Spider-Man and Captain Marvel! Plus: Citizen V, the Crimson Cowl and Scourge! Includes an untold tale of the Avengers' earliest adventures! Collects AVENGERS #23-34 & #1 1/2 and THUNDERBOLTS #42-44.\r<br>432 PGS./Rated T+ ...$34.99\r<br>", "Civil War: Front Line (2006) #3": "\"Embedded\" - Civil War has ignited across the Marvel Universe! Embedded reporters Sally Floyd and Ben Urich are driven into the heart of battle-a battle in which a hero will fall. Their investigations will take Sally into the heart of Captain America's resistance, while Urich is about to get reacquainted with a certain green friend...\r<br>\"The Accussed\" - Despised by a nation, the lone survivor of the New Warriors' team is behind bars. Without family, without a friend in the world and without a reason to go one, will this hero make a deal, or take a stand?\r<br>\"Correspondence\" - Juxtaposing stories of war throughout time with the Marvel Civil War, \"Correspondence\" adapts tales from World War I and more!\r<br>32 PGS. NO ADS!/Rated T+ ...$2.99  \r<br>", "Fantastic Four: First Family (2006) #5": "More secrets of the FF's earliest days revealed!  This issue: the Human Torch's first solo adventure (not a raging success)!  Mr. Fantastic's first solo adventure (also not a raging success)!  A team divided!  An enemy uncovered!  Plus, an army of cosmically-mutated monsters!  What more could you ask for?\r<br>32 PGS./Rated A ...$2.99\r<br>", "Last Planet Standing (2006) #5": "Is this the end of the MC-2 Universe? The sequel to last year's surprise hit concludes and it's all-out action in the merry Marvel manner as...\r<br>Determined to evolve, Galactus prepares to sacrifice the Earth and the entire universe! An army of Mainframes take on a horde of Punisher robots!  The Silver Surfer unleashes his full cosmic fury against his former master!  The last heroes standing make their final assault on the planet-eater!  And Spider-Girl and a few friends take a desperate, perhaps fatal, gamble to save their world and the universe entire!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Civil War: Front Line (2006) #2": "\"Embedded\" There's a truth buried deep in the heart of every war, and reporters Sally Floyd and Ben Urich will be there, uncovering that truth in the midst of the biggest conflagration in the Marvel Universe! In the wake of the Stamford Disaster, the public cries out for Super Hero Registration. Are the costumed heroes of the Marvel Universe protectors or ticking time bombs? Find out here when Spider-Man has his say. And you won't want to miss as one hero makes public a painful secret.\r<br>\"Accused\" The lone survivor of the team that caused the Stamford Tragedy has been found.  But living through one of the worst superhuman disasters in history may be the worst thing that could happen, as this vilified hero is placed under arrest for the deaths of an entire town.  Unfortunately, the trouble's just beginning... Also, with the lives of Marvel's heroes in turmoil what opportunities lie for their nemeses? Norman Osborn has a few ideas...   \r<br> And, in \"Civil War Correspondence,\" see stories inspired by tales of war correspondence throughout history!\r<br>32 PGS. (each) NO ADS! /Rated T+ ...$2.99 (each)\r<br>", "Earth X (New (Trade Paperback)": "Great epics come along only once in a long while. Stories that push the normal boundaries and force the reader to think. Stories so powerful in message and so grand in scale that the guidelines by which such tales are usually judged are completely rearranged. Spawned from the brilliant creative mind of Alex Ross, EARTH X is one such epic. Along with writer Jim Krueger and artist John Paul Leon, Ross breathes life into and gives amazing detail to every facet of the EARTH X mythos - made evident by everything from his early conceptual pencil sketches to each of his fourteen beautifully painted covers. EARTH X explores the depths and heights of the Marvel Universe, from the roots of its humble beginnings to the peak of its ultimate potential. \r<br>Collects all twelve issues of the EARTH X regular series, and the #0 and #X bookends.\r<br>472 PGS./Rated T+ ...$29.99\r<br>ISBN: 0-7851-2325-3\r<br>", "Last Planet Standing (2006) #4": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Marvel Adventures Fantastic Four (2005) #13": "The space-faring Fantastic Four discover an amazing new planet! One race of aliens rules another on the surface of this strange world, but in space, things are not always as they appear. High adventure, super hero action and science fiction collide in this tale of a world gone bonkers!\r<br>32 PGS./All Ages ...$2.99\r<br>", "Last Planet Standing (2006) #3": "The sequel to the critically acclaimed LAST HERO STANDING continues--!\r<br>A major Marvel Universe character dies!  The Great Elders and Comic Powers of the Universe launch a desperate attack against Galactus! The citizens of Earth are ordered to evacuate the planet! New York City is targeted for destruction! The Silver Surfer joins the fray! And the action hits overdrive as the Avengers, Spider-Girl and the Fantastic Five prepare to make their final stand!\r<br>32 PGS./All Ages ...$2.99", "Civil War: Front Line (2006) #1": "\"Embedded\" There's a truth buried deep in the heart of every war, and reporters Sally Floyd and Ben Urich will be there, uncovering that truth in the midst of the biggest conflagration in the Marvel Universe! In the wake of the Stamford Disaster, the public cries out for Super Hero Registration. Are the costumed heroes of the Marvel Universe protectors or ticking time bombs? Find out here when Spider-Man has his say. And you won't want to miss as one hero makes public a painful secret.\r<br>\"Accused\" The lone survivor of the team that caused the Stamford Tragedy has been found.  But living through one of the worst superhuman disasters in history may be the worst thing that could happen, as this vilified hero is placed under arrest for the deaths of an entire town.  Unfortunately, the trouble's just beginning... Also, with the lives of Marvel's heroes in turmoil what opportunities lie for their nemeses? Norman Osborn has a few ideas...   \r<br> And, in \"Civil War Correspondence,\" see stories inspired by tales of war correspondence throughout history!\r<br>32 PGS. (each) NO ADS! /Rated T+ ...$2.99 (each)\r<br>", "Fantastic Four: First Family (2006) #4": "More untold secrets of the FF's earliest days revealed!  See Reed move the team into the newly-built Baxter Building -- and see the Thing's less than thrilled reaction!  Meanwhile, the FF's first villain -- unknown until now -- finally makes his move!  But will the fledgling team disintegrate before they get to confront him?  Of course not, but order the book anyway...!\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Masterworks: The Fantastic Four Vol.10 (Hardcover)": "Certifiably the World's Greatest Comic Collaboration, the Stan Lee/Jack Kirby Fantastic Four run stands as one of the high-water marks in the history of the medium. The ten titanic years on the title laid the very foundation of the Marvel Universe, and birthed more amazing concepts and creative characters than perhaps any series before or since. In this tenth Masterworks volume, we celebrate the entire Lee/Kirby run with essays by critics, creators and luminaries in the field of comics.\r<br>But it just ain't waxing nostalgic, True Believer! This is a Marvel comic, after all! Expect plenty of explosive action and family drama a-go-go as the FF build up to their 100th issue featuring everyone from Doc Doom to Dragon Man! They'll also help mankind take one giant leap when the Kree's robot Sentry tries to stop the Apollo 11 moon landing! Just for good measure, we'll throw in the uncanny Inhumans and Attilan, and the whole shebang comes to a head when the mutant menace, Magneto, teams up with Namor in a bid to conquer the world-Nixon is not pleased!\r<br>Collecting FANTASTIC FOUR #94-104.\r<br>272 PGS./All Ages ...$49.99\r<br>", "Last Planet Standing (2006) #2": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Last Planet Standing (2006) #1": "At last! The long awaited sequel to last year's surprise hit, the sold-out LAST HERO STANDING, which Ray Tate of Silver Bullet Comics called \"a comic book mini-series that's worth buying!\"\r<br>For centuries beyond reckoning, Galactus has consumed entire worlds to satiate his never-ending quest for sustenance, but now he has a new plan--one which may threaten the very existence of the entire Universe!  Featuring: the mighty Thor, the Warriors Three, the Avengers, Spider-Girl, the Fantastic Five and the Shi'ar Imperial Guard!\r<br>32 PGS./All Ages ...$2.99 \r<br>", "Fantastic Four: First Family (2006) #3": "The untold tale of the FF's first adventure continues!  Ever wonder if any of the Mole Man's monsters followed the FF back to New York City after their first encounter with them?  Neither did the FF... and that mistake leads to a very public demonstration for the fledgling super hero team.  Plus, Ben Grimm's first visit back to Yancy Street (it ain't pretty!), and the FF's first headquarters (it wasn't the Baxter Building!).\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #12": "Monster Garage has nothing on Johnny Storm when he rebuilds Reed's old college ride as the hottest rod on Earth! FF villains hate eating rubber, but fans love the car. Unfortunately, a European Repo Man takes the vehicle back to its original owner in LATVERIA...\r<br>32 PGS./All Ages ...$2.99\r<br>", "Uncanny X-Men Omnibus Vol. 1 (Hardcover)": "When a young writer named Chris Claremont took over X-Men in 1976, few fans could predict the incredible impact he would have on the Marvel Comics series. With a flair for realistic dialogue, heartfelt storylines and hard-hitting action, Claremont's writing breathed life into the characters. In collaboration with artists Dave Cockrum and John Byrne, Claremont crafted a run still heralded as a definitive era on the book. UNCANNY X-MEN became more than just another super-hero title: this diverse cast of mutants fighting against prejudice and intolerance has resonated in the hearts of millions of devoted readers. Now, the first five years of their landmark run on UNCANNY X-MEN are collected in one oversized volume. This keepsake edition also includes all original letters pages, newly remastered coloring and other uncanny extras! Collects UNCANNY X-MEN #94-131 and ANNUAL #3, and GIANT-SIZE X-MEN #1.\r<br>848 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$99.99\r<br>", "Civil War (2006) #1 (Turner Variant)": "THE LANDSCAPE OF THE MARVEL U IS CHANGING AND IT'S TIME TO DECIDE: WHOSE SIDE ARE YOU ON?  \r\nA conflict has been brewing in the Marvel Universe for over a year, threatening to pit friend against friend, brother against brother--and all it will take is a single misstep to cost thousands their lives and ignite the fuse!  As the war claims its first victims, no one is safe as teams, friendships, and families begin to fall apart.  Civil War, a Marvel Comics event in seven parts, stars Spider-Man, the New Avengers, the Fantastic Four, the X-Men and the entirety of the Marvel pantheon!  Civil War - the cross-over that rewrites the rules - begins here in this double-sized first issue!\r\n48 PGS./Rated T  ...$3.99", "New Mutants Classic Vol. 1 (Trade Paperback)": "Cannonball. Sunspot. Moonstar. Karma. Rahne. Teenagers, thrown together by the one thing they had in common: the X factor in their genes that made them different, made them mutants. Relive the adventurers of the team that will come to be known as X-Force...if they survive. Collects MARVEL GRAPHIC NOVEL #5, NEW MUTANTS #1-7 and UNCANNY X-MEN #167.\r<br>240 PGS./Rated T+ SUGGESTED FOR TEENS AND UP ...$24.99\r<br>", "Fantastic Four: First Family (2006) #2": "More secrets are revealed in the early days of the Fantastic Four in this stunningly-illustrated series!  As the cosmically irradiated foursome answers their first call to action, Reed Richards ensures that he and his friends don't end up as government lab rats.  But will Sue, Johnny and Ben go along with his plans?  Plus, the secret of the FF's first adversary (hint: it wasn't the Mole Man!).\r<br>\r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #11": "He's not so tough... he just has complete control of EVERYTHING  on an elemental level. Oh, and he can take over the body of anyone in the world without even being nearby. That's all. How in the world are the FF going to stop THE MOLECULE MAN???\r<br>\r<br>\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Adventures Fantastic Four Vol. 2: Fantastic Voyages (Digest)": "All adventure, all action, for all ages! Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits as they meet and defeat stampeding prehistoric creatures, the subterranean Mole Man and Namor, the Sub-Mariner - and embark on a journey through time and space! Collects MARVEL ADVENTURES FANTASTIC FOUR #5-8.\r<br>96 PGS./All Ages ...$6.99\r<br>", "Alias Omnibus (Hardcover)": "Once upon a time, Jessica Jones was a costumed super-hero, just not a very good one. Her powers were unremarkable compared to the amazing abilities of the costumed icons that populate the Marvel Universe. In a city of Marvels, Jessica Jones never found her niche. Now a chain-smoking, self-destructive alcoholic with a mean inferiority complex, Jones is the owner and sole employee of Alias Investigations - a small, private-investigative firm specializing in super-human cases. In her inaugural arc, Jessica's life immediately becomes expendable when she uncovers the potentially explosive secret of one hero's true identity. But her wit, charm and intelligence just may help her survive through another day. Thrust into the midst of a conspiracy that reaches the highest levels, has Jessica burned too many bridges to turn to old friends for help? Plus: Jessica travels to upstate New York to investigate the disappearance of a teenage girl rumored to be a mutant in a prejudiced small town, goes on a date with the Astonishing Ant-Man, teams up with Jessica Drew, the original Spider-Woman; and confronts the demons of her past! Collects Alias #1-28, What If? Jessica Jones had Joined the Avengers.", "Marvel Masterworks: Golden Age Marvel Comics Vol.2 (Hardcover)": "Marvel proudly presents more Golden Age goodness, reprinting issues #5-8 of MARVEL MYSTERY COMICS from 1940. This hardcover collection remasters and restores these early adventures, some reprinted for the very first time! See the Human Torch join the police force! Witness the execution of the Sub-Mariner! Plus: In the wake of the Sub-Mariner's attack on New York City, the Torch and the Sub-Mariner face off in their historic first meeting!\r<br>272 PGS./All Ages ...$49.99\r<br>ISBN: 0-7851-2112-9\r<br>MARVEL MASTERWORKS: \r<br>GOLDEN AGE MARVEL COMICS VOL. 2 - VARIANT EDITION VOL. 60\r<br>272 PGS./All Ages ...$54.99\r<br>", "Fantastic Four: First Family (2006) #1": "For the first time, untold secrets of the FF's earliest days are revealed!  What happened the moment after Reed Richards' rocket crash landed?  What happened -- to Sue Storm, to Ben Grimm, to Johnny Storm -- in the days following that fateful event?  An in-depth, action-packed, psychologically thrilling exploration of the FF's origin begins here! \r<br>32 PGS./Rated A ...$2.99\r<br>", "Marvel Adventures Fantastic Four (2005) #10": "War-drums are beating as four heroes work their way through the most mysterious jungle in Africa. An international misunderstanding has brought them here to be hunted by a shadowy figure who has uncanny skill and the technological might of the world's most advanced nation at his disposal. Will the Fantastic Four make it back from Wakanda, and will they be friends or prey for the man known in whispers as... THE BLACK PANTHER!?\r<br>32 PGS./All Ages ...$2.50\r<br>", "Captain America: Winter Soldier Vol. 1 (Trade Paperback)": "Cap is awakened in the dead of the night by agents of S.H.I.E.L.D., who need the kind of help only he can provide. But the corpse he finds on the Heli-carrier brings him face-to-face with the unthinkable, and opens doors to terror and manipulation he never dreamed possible! It's a new beginning as four-time Eisner-nominated Best Writer Ed Brubaker makes his Marvel debut, joined by white-hot artist Steve Epting! Collects CAPTAIN AMERICA #1-7.\r<br>176 PGS./T+ SUGGESTED FOR TEENS AND UP ...$16.99\r<br>", "House of M: World of M (Trade Paperback)": "Explore the people and places of the World of M! In BLACK PANTHER, a United Africa - ruled over by Storm and T'Challa - has become an economic powerhouse and a thorn in Magneto's side. When Storm speaks out about the persistence of supremacist notions in the mutant-controlled world, a furious Magneto is determined to stop her at any cost. In CAPTAIN AMERICA, see Steve Rogers move from the '40s to the present day - bearing witness to a changing landscape, and watching as man becomes the minority and mutant the ruler. In NEW THUNDERBOLTS, only Private Genis-Vell, a member of the Titan/Kree Exploratory Council, can see that something is desperately wrong with reality. Why does he keep having visions of people who wanted to hurt him? Is the only way to keep his mind from coming apart require him to destroy an entire world? In CABLE/DEADPOOL, Deadpool, Cannonball and Siryn desperately search for the missing Cable. After scouring several alternate worlds and various alternate Cables, where they find the one TRUE Cable will come as a very, VERY big shock! And in THE PULSE, HOUSE OF M mastermind Brian Michael Bendis peels a shocking layer off the mystery of the Marvel Universe that no AVENGERS fan (old or new) dare miss! Collects BLACK PANTHER #7, CAPTAIN AMERICA #10, NEW THUNDERBOLTS #11, THE PULSE #10, CABLE/DEADPOOL #17, HOUSE OF M SKETCHBOOK and THE PULSE SPECIAL EDITION.\r\n184 PGS./RATED T  ...$23.99\r\nISBN: 0-7851-1922-1", "Marvel Adventures Fantastic Four (2005) #9": "Can you hear him coming? It's KLAW, the Master of Sound! He's hit the Big Apple with a sound-proof plan to defeat the Fantastic Four: Divide and conquer, taking them on a one at a time! Can Ben, Reed, Johnny and Sue band together and mute Klaw's attacks...or will they fade into white noise?\r<br>\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #8": "Join Reed, Johnny, Sue and Ben on a journey through time and space! Lockjaw, everybody's favorite teleporting puppy, has the sniffles, and his malfunctioning powers take our Favorite Fighting Family up, down and around the universe, with no promise of returning to earth! Can Mr. Fantastic come up with a doggy cold medicine before they go careening into a black hole?\r<br>32 PGS./All Ages ...$2.99\r<br>", "Marvel Knights 4 Vol. 4: Impossible Things Happen Every Day (Trade Paperback)": "Four tales of the Four! First, when two Inhuman children seek asylum with the Fantastic Four, old alliances are threatened and friends stand now as enemies! Next, when Reed forget their anniversary yet again, it's up to Sue's best girlfriends -- Alicia, Crystal and the Sensational She-Hulk -- to cheer her up with a night out on the town... Marvel style!  Then, on Yancy Street, someone -- or something -- is putting the hurt on the neighborhood's tough guys. Ben Urich, Jessica Jones and the Thing are on the case, but what exactly is the nature of the threat they're facing? And finally, one of the Marvel U's most powerful entities -- the reality-bending Impossible Man -- pops up to cause havoc in this offbeat tale that blurs the line between fact and fiction, men and myth! Collects MARVEL KNIGHTS 4 #19-24.\r<br>144 PGS./ Rated T+ SUGGESTED FOR TEENS AND UP ...$14.99\r<br>ISBN: 0-7851-1808-X\r<br>", "Marvel Adventures Fantastic Four (2005) #7": "The Fantastic Four have encountered big menaces, but the ego of the Submariner may be their hugest foe yet! The monarch of the seas seeks a bride, and has set his sights on the world's most Fantastic girl!\r<br>\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "Daredevil Vol. V: Out (Trade Paperback)": "A down-on-his-luck FBI agent has sold the hero's most guarded secret to a tabloid newspaper, exposing Daredevil's identity to the entire world. How far will the Man Without Fear go to reclaim his life?", "SECRET WARS TPB (Trade Paperback)": "The classic 12-issue limited series is back in print! The first mega-crossover of its kind, SECRET WARS still stands as a milestone in the comic-book industry. The fate of the entire Marvel Universe hangs in the balance as all of Earth's greatest super heroes face their deadliest foes on the mysterious planet known as Battleworld! \r<br>336 pages./ T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Marvel Adventures Fantastic Four (2005) #6": "Underground action rules the day when the Fantastic Four go head-to-head with the Mole Man!  Strange tentacles and other weird stuff has been popping out of the New York City streets.  The FF want to get to the bottom of it-literally!  But when they tunnel to the Mole Man's subterranean territory, even more fantastic surprises are in store...  \r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Masterworks: Golden Age Human Torch Vol.1 (Hardcover)": "Marvel presents more Golden Age goodness, reprinting the first four issues of HUMAN TORCH, #2-5a, from 1940-41. (Yes, folks, odd numbering was not solely the province of modern comic books; the Torch's solo book started with issue #2 and had two #5s.) This hardcover collection remasters and restores these early adventures, including the introduction and origin of Toro, the Flaming Torch Kid. See the Torch and Toro fight side-by-side with the Sub-Mariner, as he once again crashes into New York City! Also featuring the adventures of Microman, Mantor the Magician, the Fiery Mask and the Patriot.\r<br>280 PGS./All Ages ...$49..99\r<br>", "Marvel Adventures Fantastic Four (2005) #5": "The Human Torch is chasing a Pterodactyl around the Chrysler Building. A Brontosaurus is dragging The Thing down 5th Avenue. The Invisible Girl is trying to make a Tyrannosaurus stop chewing on her husband. Dinosaurs have come to New York, and they're not planning on going extinct this time! \r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Captain America (2004) #10": "HOUSE OF M tie-in  What changes await Steve Roger's life now that the House of M is in control? In this new world order, watch the hero known as Captain America moves from the '40s to the present day, bearing witness to a changing landscape, watching as man becomes the minority, and mutant the ruler.", "Marvel Adventures Fantastic Four (2005) #4": "The Fantastic Four don't feel so fantastic when their powers start failing-right when a Sentinel has decided to target them! It's not all bad though; at least Johnny has a cool new girlfriend. Or is all this connected somehow...?\r<br>\r<br>32 PGS./ALL AGES ...$2.50\r<br>", "Marvel Nemesis: The Imperfects (2005) #5": "Now able to track the mysterious source that controls Dr. Van Roekel's augmented army, Storm, Iron Man, The Human Torch and the Thing track Elektra to the jungles of the Amazon where they discover more than they bargained for…a full-on battle with The Imperfects. But can they survive long enough to turn the possessed assassin?", "Fantastic Four: House of M (2005) #3": "The treacherous Victor Von Doom's fantastic, fearsome foursome have at last maneuvered Magneto into the one place he is vulnerable, and it is time for Doom to strike. But, for all his elaborate planning, is there anything-or anyone-Doom has overlooked? And how much will that oversight cost him? Don't miss the exciting, action-packed finale!\r<br>\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>", "New Avengers (2004) #9": "\"THE SENTRY\"\r<br>The mystery of the Sentry revealed! What has kept the Sentry a secret from the world, and how will the world react to his re-emerging. Featuring guest stars galore, and the setup for the blistering new Sentry series by Sentry creator Paul Jenkins. Part 3 (of 3).\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.50\r<br>", "Marvel Adventures Fantastic Four (2005) #3": "A doctor is becoming famous for his seeming ability to cure patients of terrible diseases.  Nobody's sure how he does it, but everyone is fascinated by what seems to be a \"healing touch.\"  When the mysterious doc crosses paths with the scientific mind of Reed Richards, the FF are in for some surprises they never bargained for--and the adventures are just beginning!\r<br>32 PGS./All Ages ...$2.50\r<br>\r<br>", "Fantastic Four: Foes (Trade Paperback)": "The foes of the Fantastic Four take center stage! After years of continued defeat at the hands of the FF, why would a person still attempt something he has learned to be impossible? Get inside the heads of all your favorite FF foes as we watch their capers from start to finish from their perspective, their point of view, and at last learn...what were these guys thinking? Collects FANTASTIC FOUR: FOES #1-6.\r<br>144 PGS./Marvel T+ &#8230;$16.99\r<br>", "Marvel Adventures Fantastic Four (2005) #2": "When a rampaging alien from another dimension runs amok in New York City, there's only one thing to do-call in the Fantastic Four!  But what happens if they're the ones responsible?  Find out in this all-new FF adventure!\r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "4 (2004) #20": "INHUMANE\r<br>The conflict between the Family Fantastic and the Inhumans heats up with Black Bolt and Medusa's arrival on Earth. Sue is determined to keep the two Inhuman runaways safe no matter the cost, but with the rest of the FF wondering if they should even be involved in this dispute, what possible hope do she and the alien children have?   Part 2 [of 2]\r<br>32 PGS./T+ SUGGESTED FOR TEENS AND UP ...$2.99\r<br>", "Best of the Fantastic Four Vol. 1 (Hardcover)": "Follow the FF from their original adventure to the height of their success! Caught in a mental maelstrom of alien enemies! Trips into the Negative Zone, Subterranea and the soul of Ben Grimm! The triumph and tragedy of Mr. Fantastic! The Thing vs. the Thing! And who will be the last hero standing in the ultimate war...of practical jokes? Featuring Dr. Doom, Dr. Octopus, the Impossible Man, Daredevil and more! Collects FANTASTIC FOUR #1, #39-40, #51, #100, #116, #176, #236, and #267; FANTASTIC FOUR (Vol. 3) #56 and #60; MARVEL FANFARE #15; MARVEL TWO-IN-ONE #50; and MARVEL KNIGHTS 4 #4.\r<br>360 PGS./MARVEL PSR ...$29.99\r<br>", "Fantastic Four (1998) #527": "\"DISTANT MUSIC\" - A NEW ARC BEGINS HERE!\r<br>Just in time for movie season, new ongoing creative team J. Michael Straczynski (AMAZING SPIDER-MAN, SUPREME POWER) and Mike McKone (Teen Titans, EXILES) unite their talents to chart a new course for the world's greatest comic magazine! First up: an intriguing offer for a conflicted Reed, and a windfall for Ben!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: The Movie (2005) #1": "The comic adaptation of the blockbuster motion picture starring Ioan Gruffudd, Michael Chiklis, Jessica Alba, Chris Evans and Julian McMahon, this collection captures all the cinematic excitement of the new hit movie - plus a selection of the classic stories that inspired the film! Forty years ago, writer Stan Lee and artist Jack Kirby created a team of adventurers like no other that had come before. Unlike previous groups of stone-jawed super heroes who got along perfectly in their pursuit of liberty and justice, the Fantastic Four bickered, argued and fought among themselves - just like a real family. Their continued adventures around the world, into outer space and throughout uncharted dimensions have pushed the limits of the Marvel Universe, consistently challenging readers' perceptions of what a comic book could be!\r<br>120 PGS./T+ Suggested for Teens and Up ...$12.99\r<br>", "Spider-Man/Human Torch (2005) #5": "Peter Parker might be the coolest teacher in school, but how will he stack up to the guest-speaker at today's special assembly, the one-and-only Human Torch? And when a band of no-good crooks show up, will the duo be able to keep the students safe?", "Captain America (2004) #7": "Nomad is dead, struck down by the same hand that killed the Red Skull!  Now in a special interlude issue, we step back into Jack Monroe's last days and trace his last steps. Where had Jack been all these years, and what was he doing drowning his sorrows in some dive bar? Also -- what did Jack see that night, right before he breathed his last? You'll be shocked to find out!", "Essential Fantastic Four Vol. 4 (Trade Paperback)": "Relive more of the FF's classic exploits as they stand united against Dr. Doom, Annihilus and Galactus! Featuring the first appearances of the Kree and the microversal Psycho-Man! Guest-starring Spider-Man, Daredevil, Thor and the Warlock formerly known as Him! Lee and Kirby were the ones who started it all, and they kept it going in these cosmic tales! Collects FANTASTIC FOUR #64-83 and ANNUAL #5-6.\r\n536 PGS./All Ages ...$16..99", "Marvel Adventures Fantastic Four (2005) #1": "All adventure, all action, for all ages!  Join Mr. Fantastic, the Invisible Woman, the Human Torch and the Thing for a wild ride of all-new, unforgettable exploits.  When the world-renowned heroes happen upon some children in distress, they naturally rush to the rescue!  But not everything is as it seems, and the Fantastic Four are in for much more than they bargained for. \r<br>32 PGS./ ALL AGES ...$2.50\r<br>", "X-Men/Fantastic Four (Hardcover)": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding adventure! Can the two teams put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence? Even as the heroes trek into the stars, the real threat to their mission might just be among themselves! It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Collects X-MEN/FANTASTIC FOUR #1-5. \r<br>120 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>ISBN: 0-7851-1520-X\r<br>", "FANTASTIC FOUR VISIONARIES: GEORGE PEREZ VOL. 1 TPB (Trade Paperback)": "Before his cross-company fame for Disturbing Crises and Avenger Adventures, Perez put the World's Greatest Super-Team through its paces - and first up was a fight with a fabulous fifties favorite! The Thing gets replaced in the FF, but who's replacing Mr. Fantastic in...the Frightful Four? Also featuring the Incredible Hulk, Luke Cage, the High Evolutionary and costumed characters never seen before or since! Collects FANTASTIC FOUR #164-167, #170, #176-178, #184-186.\r<br>200 PGS./T+ Suggested for Teens and Up ...$19.99\r<br>", "FANTASTIC FOUR/SPIDER-MAN CLASSIC TPB (Trade Paperback)": "Marvel movie stars past and present unite in a series of senses-shattering slugfests for the ages! At the dawn of the Marvel Age, Spider-Man meets the Fantastic Four as the Chameleon strikes! Also featuring a battle royal with the Frightful Four! The first appearance of the future New Mutant known as Karma! The villainy of Dr. Doom! A date with Invisible Girl! When comics' first family and everybody's friendly neighborhood wall-crawler get together, chaos is sure to ensue! Collects AMAZING SPIDER-MAN #1; SPECTACULAR SPIDER-MAN #42; FANTASTIC FOUR #218; MARVEL TEAM-UP #100, 132-133; and UNTOLD TALES OF SPIDER-MAN '96.\r<br>152 PGS./Marvel PSR ...$16.99\r<br>", "Marvel Adventures Fantastic Four (2005)": "Marvel Adventures launches it's new Fantastic Four series with an all new, action-packed premier issue!  New York City is throwing a parade in honor of their favorite first family, but it looks like rain is in the forecast in the form of Dr. Doom!  Will MR. FANTASTIC, THE INVISIBLE WOMAN, THE HUMAN TORCH and THE THING be able to save the day and keep Times Square as clean as an all ages comic?  Find out in this specially priced opening issue!\r<br>32 PGS./ ALL AGES ...$1.99\r<br>", "Giant-Size Marvel (Trade Paperback)": "Giants roamed the Earth in those days, and now they're back! Witness the formation of the new X-Men and the old Invaders! The rapid return of the wartime runner called the Whizzer! The debut of the multiplying Marvel Knight Madrox! Spider-Man vs. the Man-Wolf! The Defenders vs. the Squadron Sinister! The tantalizing Tigra and more! Tales almost too tall to tell, together in a titanic tome! Collects GIANT-SIZE FANTASTIC FOUR #4; GIANT-SIZE AVENGERS #1; GIANT-SIZE DEFENDERS #4; GIANT-SIZE SUPER-HEROES #1, GIANT-SIZE INVADERS #1; GIANT-SIZE X-MEN #1 and GIANT-SIZE CREATURES #1.\r<br>216 PGS./MARVEL PSR ...$24.99\r<br>", "Human Torch Vol. 1: Burn (Digest)": "Johnny Storm is the youngest member of the world-famous Fantastic Four, with the powers and temperament of fire itself. Impulsive, restless and thrill-seeking by nature, the Torch doesn't need to wait for the rest of the FF. He can get into trouble all by himself. Years ago, after gaining his powers, Johnny became the most popular student on his high-school campus. The Big Man on Campus until the Torch came along was Olympic-bound wrestler Mike Snow. The Snow/Storm rivalry reached a terrible climax when the two fought over a girl. Snow never wanted to see Johnny again - until now, years later, when a fellow firefighter dies before his eyes, inexplicably bursting into flames ... like a Human Torch. Collects HUMAN TORCH #1-6\r<br>136 PGS./MARVEL (12 AND UP) ...$7.99\r<br>", "Fantastic Four (1998) #524": "This is it! The Waid/Wieringo team go out with a bang --but they have one last surprise up their sleeves as the foundation of the team is rocked one final time.  If you're hungry for one last jaw-dropping plot twist, here it is--and it's a doozy!\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Fantastic Four: Foes (2005) #4": "The Mole Man is BACK!  He's out to get revenge for all the times he's been defeated.  Now the Fantastic Four are face to face with one of the most deadly foes of their past, and it's all part of Reed's plan.\r<br>32 PGS./Marvel PSR ...$2.99\r<br>", "Captain America (2004) #5": "The mystery heats up, as clues begin to fall into place. But are the secrets Cap is searching for buried in a long-forgotten Invaders mission from the Russian front?", "Avengers Assemble Vol. 2 (Hardcover)": "The European country of Slorenia is dead. Every man, woman and child, eliminated with the cold precision of a machine. And out of the flaming remnants of this tiny Baltic state comes a message from its murderer: Mankind's days are numbered...because Ultron has returned! He - or it - is one of the Avengers' oldest, most implacable foes, menacing humanity countless times. But never before has Ultron been this dangerous, this deadly. Now, he stands on the brink of committing global genocide, and rebuilding Earth in his own robotic image. Our only hope is a desperate U.N. strike on Slorenia, led by the Avengers themselves. But will it be in time? Will the strength and courage of Earth's Mightiest Heroes be enough in the face of such overwhelming evil? For the sake of the world, it will have to be! Plus: When you're an Avenger, you're one of Earth's Mightiest Heroes - the first line of defense against the dangers no conventional foe could halt, the threats no ordinary man could withstand. Threats including Dominex, Lord Templar, Pagan and the Thunderbolts! Collects AVENGERS #12-22, #0 and ANNUAL 1999\r<br>336 PGS./Marvel PSR ...$29.99\r<br>ISBN: 0-7851-1773-3\r<br>", "Spider-Man/Human Torch (2005) #3": "Two guys hanging out in the garage, building a car from scratch. Sounds like your typical male-bonding experience, right? Well, not when they're putting together a Spider-Mobile! For the love of all that's holy--get off the streets, the walls too! ", "Fantastic Four Vol. 2 (Hardcover)": "It seemed like a simple enough idea at the time: Now that their arch-enemy, Doctor Doom, had seemingly perished, the Fantastic Four would journey into his nation of Latveria, disassemble its war machine and set its oppressed citizens free. But what appeared to be a black-and-white situation quickly turns a murky shade of gray, and Reed Richards and his family find themselves besieged on all sides - both by those they thought of as their allies, and by the very people they are trying to save. And in the awful aftermath of their authoritative action, three of the Four must contend with the defenses of the afterlife - and storm the gates of Heaven itself to rescue a fallen teammate. They've faced Galactus, the destroyer of everything. Now, they face the creator of everything, as the FF are reunited in the hereafter. Plus: The Fantastic Four have a lot to answer for - and when you're trying to regain the trust of cynical New Yorkers, is associating with a certain misunderstood wall-crawler really a wise move? Collects FANTASTIC FOUR #503-513.", "Spider-Man/Human Torch (2005) #2": "On a stupid dare, ol' web-head and hot-head trade places to see who's got it easier. Now the Human Torch has to track down Kraven the Hunter â€\" while Spidey joins the rest of the Fantastic Four on a strange new cosmic adventure! ", "Marvel Age Fantastic Four Tales (2005) #1": "The Fantastic Four cross the globe to meet the BLACK PANTHER and help him battle his lifelong nemesis - Klaw! A modern retelling of a classic story by Stan Lee and Jack Kirby, great for all ages!", "X-Men/Fantastic Four (2004) #3": "It's the X-Men and Fantastic Four versus...the X-Men and Fantastic Four?! An unexpected adversary turns Marvel's two greatest hero families against one another. Part 3 (of 5).", "Essential Peter Parker, the Spectacular Spider-Man Vol. (Trade Paperback)": "In 1976, backed by popular demand, Marvel launched PETER PARKER, THE SPECTACULAR SPIDER-MAN - an all-new action series starring your friendly neighborhood wall-crawler! In these inaugural issues, never before reprinted in one volume, Spidey faces some of his most fearsome foes - including Tarantula, Kraven, Lightmaster, Vulture, Hitman, Morbius, Brother Power, Hate Monger, Beetle and the Enforcers! Guest-starring the Fantastic Four, Inhumans and Champions! Collects PETER PARKER, THE SPECTACULAR SPIDER-MAN #1-31.", "Marvel Masterworks: The Uncanny X-Men Vol. 5 (Hardcover)": "In celebration of the 25th anniversary and presented here for the first time in full-archival color, including pages straight from the Byrne/Austin originals, the Dark Phoenix Saga! \r<br>Gathered together by Professor Charles Xavier to protect a world that fears and hates them, the X-Men had fought many battles, been on adventures that spanned galaxies, grappled enemies of limitless might, but none of this could prepare them for the most shocking struggle they would ever face. One of their own members, Jean Grey, has gained power beyond all comprehension, and that power has corrupted her absolutely!\r<br>Now they must decide if the life of the woman they cherish is worth the existence of the entire universe!\r<br>Collecting X-Men #132-140, Annual #4 with special bonus features including the original X-Men #137 story where Jean Grey lived \"Phoenix: The Untold Story\" and the Claremont/Buscema Phoenix classic from Bizarre Adventures #27! And if that wasn't enough, brace yourself for a brouhaha with Wendigo and the seminal story of that furry blue elf Nightcrawler in \"Nightcrawler's Inferno.\"\r<br>", "4 Vol. 2: The Stuff of Nightmares (Trade Paperback)": "While New York freezes in the icy grip of winter, an old foe resurfaces with a grudge: Namor! And the crown prince is demanding Sue make good on an old promise - even if it's over Reed's dead body. Meanwhile, closer to home, Johnny may be the only person who can help a Washington Heights woman find her missing son. Plus: Something very, very strange is happening to New York's First Family of Super Heroes. Their deepest fears and doubts are spreading from their dreams - their unconscious minds - to the waking world. What's real and what's not? The FF's old villain Psycho-Man may hold the key, but he's...dying?! Collects MARVEL KNIGHTS 4 #8-12.", "Spider-Man/Human Torch (2005) #1": "See what happens when young Johnny Storm wants some of Spidey's front page exposure...and hires Peter Parker to be his personal photographer! This one has doom written all over it - Doctor Doom that is!", "Fantastic Four Vol. 3 (Hardcover)": "This deluxe hardcover completes the collection of Waid and Ringo's run, re-presenting the stories from FANTASTIC FOUR VOL. 5: DISASSEMBLED and FANTASTIC FOUR VOL. 6: RISING STORM! In DISASSEMBLED, Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft -- and that's just the beginning! With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them -- but where to even start? And which member of the team will make a decision that will radically change the Fantastic Four for some time to come? Also: Witness the genesis of an all-new, all-twisted Frightful Four! And in RISING STORM, Galactus's worst Herald ever is running out of time! So far, Johnny Storm has been able to stall Galactus from sating his cosmic hunger -- but that luck won't hold forever. What planet will be chosen as Galactus's next victim? The reintroduction of a fan-favorite Marvel Universe hero into the battle may have caused more problems than it solved, because not even he can save the Fantastic Three from Johnny's newfound might! Who will live, who will die and how will Johnny ever be the same now that he's tasted the Power Cosmic? Collects FANTASTIC FOUR #514-524. \r<br>256 PGS./T+ SUGGESTED FOR TEENS AND UP ...$29.99\r<br>", "Fantastic Four (1998) #520": "\"GALACTUS\" PART 1 (OF 6)\r<br>No answers here, intrepid fans - all we'll say is this: no matter what your guess, we promise you'll be surprised by the answer!\r<br>", "Marvel Masterworks: The Fantastic Four Vol. 8 (Hardcover)": "Pony up, True Believer, the amazing eighth manic Masterworks featuring the First Family of Funnybooks is coming your way! Collecting an ironclad cadre of consecrated classics, this one's packed with more drama than you can shake a Skrull at! \r<br>Let's break it down: the Silver Surfer pursued by none other than the world-devouring Galactus; the FF vs. Spidey, DD and Thor in a barnstorming brouhaha; a fantastic voyage into the Microverse to battle the Psycho Man; the Thing-cured!; the first appearance of Annihilus; Crystal, the Inhuman, joins the FF, and one of comics' most historic moments, the birth of Franklin Richards-it just doesn't stop!\r<br>This one's a humdinger so chock-full of excitement it's ready to burst! And it's all brought to you by no less than the minds that made Marvel magnificent, Stan and Jack! 'Nuff Said!\r<br>Collecting FANTASTIC FOUR (VOL. 1) #72-81 and ANNUAL #6\r<br>272 PGS./All Ages ...$49.99\r<br>", "Marvel Masterworks: Captain Marvel Vol. 1 (Hardcover)": "There's no question we're back and better than ever, so brace yourself for the fabulous 50th Masterworks volume featuring a brand new Silver Age success story-Captain Marvel!\r<br>\r<br>That's right, True Believers, the space-born super hero is coming at you with scintillating science fiction in the Mighty Marvel Manner! Crafted by the titanic talents of Stan Lee, Roy Thomas, Gene Colan with a hearty helping from inheritors Arnold Drake and Don Heck, you're going to need your breathing potion to keep up with the Kree Captain!\r<br>\r<br>Branded a traitor by the vicious Colonel Yon-Rogg of the Kree for defending the people of Earth, Captain Mar-Vell assumes the human identity of Walter Lawson and becomes the planet's protector against an awesome array of interstellar baddies! Prepare to batten down the hatches for battles with the massive Sentry #459, the savage Super-Skrull, Prince Namor of Atlantis himself and Quasimodo the Living Computer! While you're at it don't forget to grab some tissues for the heartbroken Medic Una as the good Captain falls for Avenger-to-be Carol Danvers in her first-ever appearance!\r<br>\r<br>Here's to another 50 volumes of Masterworks magic!\r<br>\r<br>Collecting MARVEL SUPER-HEROES #12, 13 and CAPTAIN MARVEL (Vol. 1) #1-9.\r<br>\r<br>\r<br>240 PGS./Marvel PSR ...$54.99\r<br>", "Fantastic Four Visionaries: John Byrne Vol. 3 (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues! Featuring a four-part epic deep within the Negative Zone -- and the death of...Reed Richards?! Plus: Galactus devours the Skrull homeworld, and the Fantastic Four say goodbye to the Baxter Building! Guest-starring the Avengers! Collects FANTASTIC FOUR #251-257 and ANNUAL #17, AVENGERS #233, and THING #2.", "X-Men/Fantastic Four (2004) #1": "The X-Men and the Fantastic Four team up with the help of Pat Lee and Dreamwave Studios in this heart-pounding limited series! Can the X-Men and the Fantastic Four put their differences aside to stop a creeping menace from outer space that threatens our planet's very existence?! Join megawatt creator Pat Lee and writer Akira Yoshida (THOR: SON OF ASGARD) for mutant meyham and fantastic fights!", "Fantastic Four (1998) #519": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" FINALE! PART 3 (OF 3) Galactus the World-Eater is coming to Earth to choose one of the Fantastic Four as his new herald -but which one?  The consequences of his choice will set the tone and scope of the series, a", "4 (2004) #12": "\"THE STUFF OF DREAMS\" PART 3 (OF 3)\r\nEvery dream must come to an end-even the fear-induced nightmares that Psycho-Man is spreading across Manhattan!  It's the climax to the first year of Marvel Knights 4 and the final showdown between the FF and their reality-warping foe.  Hold onto your seats - especially you slight Marvelites - that wind blowing is a radical shift in the status quo of Marvel Comics' First Family of super heroes and adventurers!", "Fantastic Four (1998) #518": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 2 (OF 3) With public opinion of the FF at an all-time low and with all of Manhattan endangered by a mysterious alien overlord, which member of the team will make a decision that will radically change the Fan", "4 (2004) #11": "\"THE STUFF OF DREAMS\" PART 2 (OF 3) With a diseased Psycho-Man loose somewhere in the city, the very fabric of New York's reality is unraveling at a frightening rate. While Susan hunts their old foe, the rest of the Fantastic Four try to stem the tide of", "Fantastic Four (1998) #517": "AVENGERS DISASSEMBLED TIE-IN! \"FOURTITUDE\" PART 1 (OF 3) The FF goes \"widescreen\" in a tale of epic scope and proportion as Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft--and that's just the beginning!  With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them--but where to even start?", "Avengers Vol. 5: Once an Invader (Trade Paperback)": "Who is the mysterious figure that claims to be Captain America, and what mission is he recruiting the super-soldiers of past wars to accomplish? As the new Invaders hit the battlefield, Namor the Sub-Mariner marshals his forces against a crucial island nation! But whose side will the Avengers come down on? Collects AVENGERS #82-84 and INVADERS #0 - plus a classic encounter between the two teams, as told from both sides, in AVENGERS (Vol. 1) #71 and INVADERS ANNUAL #1!", "Marvel 65th Anniversary Special (2004) #1": "Happy Birthday to us!  Join with us in celebrating 65 years of Marvel!  Relive the first, historic battle between the Sub-Mariner and the Human Torch!  Never before collected, this special editopn features the first-ever crossover from the Golden Age of comics with stories from Marvel Mystery Comics #8 and #9.", "4 (2004) #10": "\"THE STUFF OF DREAMS\" 1 (OF 3) Something very, very strange is happening to New York's First Family of Super Heroes. Their deepest fears and doubts are spreading from their dreams - their unconscious minds-to the waking world. What's real and what's not?", "Fantastic Four (1998) #516": "\"DYSFUNCTIONAL\" PART 3 (OF 3) The final showdown with the all-new, all-twisted Frightful Four -- and the shocking secret of their newest member could destroy both teams! ", "4 (2004) #9": "\"FROZEN\" PART 2 (OF 2) As the mercury continues to plummet, Reed and Namor's conflict escalates further, catching Sue in the crossfire. Will these longtime rivals be able to put aside their differences to help Johnny and a team of rescuers find a woman's lost son? Or will their city-spanning battle end in final checkmate?", "Marvel Masterworks: The Fantastic Four Vol. 7 (Hardcover)": "\"The First Family of Super Heroes ushers in a new era of Marvel Masterworks with the addition of Fantastic Four Vol. 7 to the Masterworks Library! Showcasing the unmatched team-up of Stan Lee and Jack Kirby, this edition is a must-have! Hold on to your seats, True Believers, as the F.F. battle Blastaar, the Living Bomb-Burst, the Sandman, Ronan the Accuser and more! Also featuring the Silver Surfer, the incomparable Inhumans and the first appearance of Him, the man later to be known as Adam Warlock! Collecting Fantastic Four (Vol. 1) #61-71 and Annual #5.\"", "Fantastic Four (1998) #515": "An alternate dimension version of the Fantastic Four may scuttle any chance the FF ever has of redeeming its reputation!", "4 Vol. 1: Wolf at the Door (Trade Paperback)": "Comics' first family face their most personal and unpredictable crisis yet in this edgy MARVEL KNIGHTS series. Writer Roberto Aguirre-Sacasa and rising-superstar artist Steve McNiven pit the Fantastic Four against a challenge the likes of which they've never faced, and to overcome it they'll need to call on the same humor, determination and family bonds that have delivered them from danger time and time again. This is the FF ... the 4 ... like you've never seen them before!", "Fantastic Four (1998) #514": "\"DYSFUNCTION\" PART 1 (OF 3) At an all-time low, the Fantastic Four are confronted by a cracked-mirror version of their own team -- one that may scuttle any chance the FF ever has of redeeming its reputation!", "4 (2004) #8": "\"FROZEN\" PART 1 (OF 2) While New York freezes in the icy grip of winter, an old foe resurfaces with a grudge: Namor!  And the crown prince is demanding Sue make good on a old promise--even if it's over Reed's dead body. Meanwhile, closer to home, Johnny may be the only person who can help a Washington Heights woman find her missing son.", "Avengers Assemble (Hardcover)": "\"The Avengers embark on one of their strongest eras ever! Kurt Busiek and George Pérez have renovated the comic-book field with such works as Astro City and New Teen Titans, respectively; now, see their take on Earth's Mightiest Heroes. Fresh from the Heroes Reborn fiasco, the Avengers find themselves thrown into yet another alternate reality, under the power of Morgan Le Fay! Meanwhile, on the home front, the Squadron Supreme challenges their very identities! Collects AVENGERS #1-11 and ANNUAL '98.\"", "FANTASTIC FOUR VISIONARIES: JOHN BYRNE VOL. 2 TPB (Trade Paperback)": "Not since the days of Stan Lee and Jack Kirby, the trailblazers of the Marvel Universe, had someone so perfectly captured the intense mood, cosmic style and classic sense of adventure of Marvel's first family of super heroes. Writer/artist John Byrne launched the Fantastic Four into realms where few creators before had dared to go. Now, the collection of his classic run continues as the FF face off against two of their greatest foes: Galactus and Doctor Doom! Guest-starring the Black Panther, Thor, Spider-Man, Iron Man, Daredevil, Doctor Strange, the Inhumans, the X-Men and more! Collects FANTASTIC FOUR #241-250.", "Fantastic Four Vol. 1 (Hardcover)": "\"A team -- and a family -- of adventurers, explorers and imaginauts, the Fantastic Four live lives both ordinary...and extraordinary. Now, Reed Richards, Sue Richards, Benjamin Grimm and Johnny Storm blast into this fully loaded, oversized hardcover -- featuring an entire year's worth of the World's Greatest Comic Magazine and more than 30 pages of ever-lovin' extras! Finally, learn the truth behind Mister Fantastic's decision to cast his friends as the greatest squad of superhuman adventurers ever assembled; see the Fantastic Four face off against a sentient mathematical equation driven mad by love, an infestation of insects from another dimension, a cascading wave of molecular instability and a teammate on a homicidal rampage; and bear witness to history in the making as Doctor Doom does...the unthinkable. Collects FANTASTIC FOUR #60-70 and #500-502.\"", "Fantastic Four (1998) #513": "\"SPIDER SENSE\" PART 2 (OF 2) It's a sad day to be the Human Torch, when your popularity has sunk so low even the web-slinger is more beloved by the people of New York City! Plus: Who is the woman from Reed Richards' past?", "Marvel Masterworks: The Amazing Spider-Man Vol. 6 (Trade Paperback)": "The first brand-new Spider-Man Masterworks volume in 12 years debuts just in time for SPIDER-MAN 2! This action-packed volume collects an \"amazing\" selection of Spidey tales by legends Stan Lee & John Romita Sr. Includes a four-part Doctor Octopus epic - plus appearances by the Kingpin, Ka-Zar, the Spider-Slayer, Captain Stacy and more! And an introduction by John Romita Sr. himself!", "Human Torch (2003) #12": "In this SERIES FINALE and turning point for the Human Torch, Ben Grimm & Johnny battle the Dragon Man on the lawns of State University!\r\n32 PGS./MARVEL PSR...$2.99", "4 (2004) #5": "pt. 4\r\nThe FF are still feeling the aftershocks of having had their world turned upside down - and Reed finds himself drawing strength from the memory of one of the greatest men he's ever known: his grandfather. \r\n32 PGS./MARVEL PSR...$2.99", "Fantastic Four (1998) #512": "pt. 1 (of 2)\r\nThe FF have a lot to answer for in the aftermath of AUTHORITATIVE ACTION ... and when you're trying to regain the trust of cynical New Yorkers, is allying with a certain misunderstood wall-crawler a wise move?\r\n32 PGS./MARVEL PSR...$2.25", "4 (2004) #4": "pt. 4\r<br>The FF are still feeling the aftershocks of having had their world turned upside down - and Reed finds himself drawing strength from the memory of one of the greatest men he's ever known: his grandfather. \r<br>32 PGS./MARVEL PSR...$2.99\r<br>", "Marvels 10th Anniversary (Hardcover)": "Welcome to New York City. Here, burning figures roam the streets, men in brightly colored costumes scale the glass and concrete walls, and creatures from space threaten to devour the planet. Witness the birth of the Marvel Universe through the eyes of the proverbial man in the street - Daily Bugle photographer Phil Sheldon - in this lush hardcover collection commemorating the 10th Anniversary of one of the comic-book industry's all-time best-selling, critically acclaimed and fan-favorite titles.\r\nThis keepsake volume features nearly 200 pages of never-before-seen bonus material - including writer Kurt Busiek's original series proposals and scripts to all four issues.\r\nCollects MARVELS #0, 1-4, PLUS scripts and tons of special extras!\r\n[This is a resolicitation, all previous orders are cancelled.]", "Human Torch (2003) #11": "Johnny's ex-\"flame\" NAMORITA guest-stars when a floating ocean research station unleashes something that could exterminate all life in the universe! Can Johnny save the universe? And more importantly - will he and the Atlantean princess start dating again??", "Fantastic Four (1998) #511": "They've faced the destroyer of everything - Galactus. Now they face the CREATOR of everything, as the Fantastic Four are reunited - in the HEREAFTER!", "4 (2004) #3": "Metal-faced despots, intergalactic deities, and subterranean savages couldn't destroy the FF, but will Marvel's first family be torn apart by the most human threat it's ever faced?\r\nPlus: A classic knockdown, drag-'em-out brawl between The Thing and The Human Torch!", "Fantastic Four (1998) #510": "Having embarked on the ultimate journey, Reed Richards and the rest of the FANTASTIC THREE must contend with the defenses of the afterlife - and storm the gates of Heaven itself!\r\n32 PGS./MARVEL PSR...$2.25", "Fantastic Four (1998) #509": "\"HEREAFTER\" pt 1 (of 3)\r\nNo, not a misprint! The regular creative team readers demanded is \"back\" for good as the Fantastic Three embark on their greatest adventure yet by storming a 'fantastic' realm brand new to even them. They've heard of it of course, but have never there before! \r\nAnd yes ... the FANTASTIC THREE!\r\n32 PGS./MARVEL PSR...$2.25", "4 (2004) #2": "Comics' first family face their most personal and unpredictable crisis yet in this debut of their new edgy MARVEL KNIGHTS ongoing series. Writer Roberto Aguirre-Sacasa and rising-superstar artist Steve McNiven pit the Fantastic Four against a challenge the likes of which they've never faced, and to overcome it they'll need to call on the same humor, determination and family bonds that have delivered them from danger time and time again.\r<br>This is the FF ... the 4 ... like you've never seen them before!\r<br>32 PGS.(each)/MARVEL PSR...$2.99", "Human Torch (2003) #10": "\"A PLAGUE OF LOCUSTS\" Concludes!\r\nAs the final secrets of the radical Locust Project are revealed, Johnny must save hundreds of innocent lives ... AND find a way to undo the changes caused by the insidious project!\r\n32 PGS./MARVEL PSR...$2.99", "Fantastic Four (1998) #508": "\"AUTHORITATIVE ACTION\" CONCLUDES!\r\nIt's Armageddon from without and within as Nick Fury and S.H.I.E.L.D.'s peacekeeping forces besiege the FF and Latveria, and Marvel's First Family is simultaneously besieged by an evil at the heart of their own team! \r\n32 PGS./MARVEL PSR...$2.25", "Human Torch (2003) #9": "\"A PLAGUE OF LOCUSTS\" pt. 3 (of 4)\r\nThe Torch makes horrific discoveries about the Locust Project. Now a very unwilling \"special guest\" of this small group of fanatics, Johnny must either join them... or join those who have \"died for the cause.\" 32 PGS./MARVEL PSR...$2.99", "Fantastic Four (1998) #507": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Marvel Masterworks: The Sub-Mariner Vol. I (2nd) (Trade Paperback)": "From Namor, the Sub-Mariner's first adventure in MARVEL COMICS #1 to his Silver-Age revival. It's Namor in all his bitter, arrogant glory, fighting underwater threats and surface-dwellers alike! Featuring appearances by Daredevil and the Hulk!\r\nCollects MARVEL COMICS #1, DAREDEVIL Vol. 1 #7, TALES TO ASTONISH #70-87\r\n272 PGS./ALL AGES...$49.99", "Fantastic Four (1998) #506": "\"AUTHORITATIVE ACTION\" pts. 4 & 5 (of 6)\r\nWhat inner demons are driving Reed Richards to the brink - and can the FF overcome them before the bombs start to rain down on Latveria?\r\n32 PGS. (each)/MARVEL PSR...$2.25 (each)", "Human Torch (2003) #8": "\"A PLAGUE OF LOCUSTS\" pt. 2\r\nJohnny finds himself in the war-torn Balkans in a mysterious castle filled with dark secrets and deadly phantoms. It's the biggest fight of the Torch's life - because this time what he can't see... CAN kill him!\r\n[This is a resolicitation, all previous orders are cancelled.]\r\n32 PGS./MARVEL PSR...$2.99", "Namor (2003) #8": "New artists Pat Olliffe and John Livesay illustrate the mounting culture clash between Atlantis and the landlubbers, with star-crossed lovers Sandy and Prince Namor caught in the middle!\r\n32 PGS. (each)/MARVEL PSR...$2.99 (each) [Note Price]", "Fantastic Four (1998) #505": "\"AUTHORITATIVE ACTION\" pt. 3 (of 6)\r\nAs American forces mass on the border of Latveria, the Fantastic Four are named traitors to the United States!\r\n32 PGS. /MARVEL PSR...$2.25", "Human Torch (2003) #7": "\"A PLAGUE OF LOCUSTS\" pt. 1 (of 2)\r\nJohnny finds himself in the war-torn Balkans in a mysterious castle filled with dark secrets and deadly phantoms. It's the biggest fight of the Torch's life - because this time what he can't see... CAN kill him!\r\n[This is a resolicitation, all previous orders are cancelled.]\r\n32 PGS./MARVEL PSR...$2.99 [note price]", "Weapon X (2002) #14": "This stand-alone story features the return of  Mister Sinister! 'Nuff Said!\r\n32 PGS./MARVEL PSR...$2.99", "X-Men Legends Vol. III: Arthur Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.", "Thor Legends Vol. 2: Walt Simonson Book II (Trade Paperback)": "Few people have ever left their mark on one character quite the way Walter Simonson has. His work on the MIGHTY THOR swept the Norse God of Thunder to heights never before seen and rarely achieved since. Spanning epic tales of heroism and treachery, love and war, Simonson's work is often considered the definitive Thor. From the majesty and mystery of Asgard to the gritty streets of New York City, Thor was never the same. That is the mark of a true visionary. \r\nThis volume continues the collection of Simonson's epic run, reprinting THOR #349-355 and #357-359.", "Marvel Masterworks: Doctor Strange Vol. 1 (Hardcover)": "Master of the Mystic Arts, a sorcerer supreme, a white knight who wields black magic against blacker villains. Doctor Strange is mankind's only hope against the dark otherworldly forces that conspire to steal the life of the conscious world - forces such as Baron Mordo, the Dread Dormammu, Nightmare, Aggamon, The House of Shadows, Loki, the Mindless Ones, and more.\r\nCollects STRANGE TALES #110-111, 114-141", "X-Men Legends Vol. 3: Art Adams Book I (Trade Paperback)": "Before manga hit it big, Art Adams brought big monsters, big eyes and cute girls to the Marvel Universe. This volume collects the best of Adams' Marvel work, from his landmark work on the X-Men to his odd-couple new FF team of Spider-Man, the Hulk, Wolverine & Ghost Rider.\r\nCollects NEW MUTANTS SPECIAL EDITION #1; X-MEN ANNUALS #9-10, 12; FANTASTIC FOUR #347-349.", "Marvel Masterworks: The X-Men Vol. 2 (Trade Paperback)": "The origin of Professor X! The birth of the Juggernaut! The end of the Brotherhood of Evil Mutants! The coming of the Sentinels! And the mystery of the Mimic!\r\n\r\nCollects X-Men (Vol. 1) #11-21", "Spider-Man’S Tangled Web Vol. 4 (Trade Paperback)": "What's it like to live in a world where Spider-Man swings overhead? Find out as some of the comic book industry's most unique creators explore various city-dwellers, both super-powered and not, whose lives are changed when the wall-crawler leaps into their lives.\r\nCollecting SPIDER-MAN's TANGLED WEB #18-22 & PETER PARKER: SPIDER-MAN #42-43", "Spider-Man's Tangled Web Vol. III (Trade Paperback)": "Illustrated by Duncan Fegredo, Sean Phillips & Giuseppe Camuncoli", "Daredevil (1998) #34": "Now that the cat is out of the bag, will Matt Murdock continue to protect Hell's Kitchen?", "Fantastic Four: 1234 (2001) #4": "\"Prime Mover\" Learn the terrible history of Reed Richards and see Doom's plan revealed in all its horrible glory. Prepare for a game of robot annihilator chess on the planes of reality and the great metaphysical beyond!", "Fantastic Four: 1234 (2001) #3": "\"Darkness & The Mole Man\" Doom has crushed another member of the Four. Alicia is trapped in the subterranean caverns of the Mole Man, with only Johnny Storm to save her. But Namor has extinguished the Human Torch-can Storm still summon the flame?!", "Fantastic Four: World's Greatest Comics Magazine (2001) #11": "The FF's fortieth-anniversary special rockets towards its conclusion! Did the Fantastic Four survive last issue's bout with the Asgardians? Is this the World's Greatest Funeral Magazine? No way! Gearing up for the big finale we bring you Planet Doom -- and the return of the Cosmic Cube-wielding dictator of Latveria!", "Fantastic Four: 1234 (2001) #2": "\"Staring At The Fish Tank\" Ben Grimm has been transformed and badly wounded. It is rumored that Prince Namor is massing forces at the outskirts of American waters. And Johnny must engage a powerful foe. With Reed still in isolation, who can help?", "Fantastic Four: World's Greatest Comics Magazine (2001) #10": "Asgard...trashed by the Cosmic Cube! How does a journey to the home of the Norse gods fit into the FF's mission to save reality from the clutches of a Cosmic Cube-powered Dr. Doom?", "Fantastic Four: 1234 (2001) #1": "\"Once Upon a Time On Yancy Street\" When Reed Richards has the \"Deep In Thought\" sign up, the rest of the FF know not to bother him. But the heat is rising in Manhattan and a Doombot has just gone active. A sinister game is afoot!", "Fantastic Four: World's Greatest Comics Magazine (2001) #8": "When Atlantean Beasts attack! The FF and Black Panther return to the Baxter Building to confront a coastal assault orchestrated by Namor! Meanwhile, the Human Torch and Crystal try to find a missing link to unlock the full potential of the Terrigen Mists.", "Fantastic Four (1998) #44": "The Negative Zone epic ends here!", "Fantastic Four: World's Greatest Comics Magazine (2001) #5": "As the Fantastic Four come to grips with the fact that they're being manipulated by a hated enemy, the Hulk goes on a riotous rampage, setting the stage for a classic clash between ol' Jade Jaws and the ever-lovin' blue-eyed Thing!", "Fantastic Four: World's Greatest Comics Magazine (2001) #2": "If you're a fan of the FF (and who isn't), this is the issue for you: Dr. Doom! Crystal! The Sub-Mariner! The Kree Sentry! The Fantasti-Car! An all-star cast of creators delivers all-out action in the Mighty Marvel Manner!", "Fantastic Four: World's Greatest Comics Magazine (2001) #1": "In 1961, a quartet of intrepid explorers rocketed into space, were bathed in mysterious Cosmic Rays, and were transformed into the fabulous Fantastic Four! Mr. Fantastic, brilliant inventor with an elastic body! Invisible Woman, master of force fields! Human Torch, flaming hotshot! The Thing, monstrous man of might! In the years that have followed, this dynamic nuclear family has challenged the unknown, saving our world multiple times from the threat of alien invaders, scientists gone mad, and other-dimensional despots! Now writer/artist Erik Larsen and a host of terrific talents ask \"What if Stan Lee and Jack Kirby concluded their historic run on FF with one last wild adventure?\" The answer begins at the world famous Baxter Building, home of our famous foursome, which is pillaged and looted by none other than the team's arch-nemesis, Dr. Doom! What is the man in the iron mask looking for? And what does the Mad Thinker have to do with all this?", "Marvel Knights (2000) #6": "Chang Chi battles his evil father's personal assasin.  And surprise guest stars - the Fantastic Four!", "X-51 (1999) #8": "The Machine Man goes rogue!", "Thor (1998) #21": "Thor makes a terrible discovery when he travels to Asgard to seek the council of the gods.", "Avengers (1998) #24": "While the public protests continue outside the Avengers Mansion, Juggernaut faces off against the Exemplars!", "Daredevil Visionaries: Kevin Smith (Daredevil Vol. I: Guardian Devil) (Trade Paperback)": "Daredevil's notion of faith is tested when a mysterious baby winds up on his doorstep. Following the death of his longtime lover, Daredevil must find the strength to continue.", "Daredevil Vol. II: Parts of a Hole (Trade Paperback)": "Maya Lopez' deaf, but capable of assimilating an individual's fighting style on sight' has set her sights on Daredevil, who she believes to be responsible for her father's death.", "Marvels Vol. I (Trade Paperback)": "This seminal story examines the arrival of super heroes and villains from the point of view of the proverbial man in the street: Daily Bugle photographer Phil Sheldon.", "Earth X (1999) #7": "Banner and Thor are betrayed as Ben Grimm is recruited for the war against the Red Skull!", "Avengers Forever (1998) #8": "The Avengers stand defeated!  What secrets about Avengers history play into the fate of the future?", "Captain America: Sentinel of Liberty (1998) #11": "The Fantastic Four's Human Torch guest-stars!", "Daredevil (1998) #8": "Matt attends the funeral of Karen Page. Foggy's name is cleared and he's released from prison. And the fate of the mysterious child is revealed... Featuring, Spider-Man!", "X-Men (1991) #89": "Poetic irony? The X-Men are freed from one hellish dimension…only to arrive on the Skrull homeworld the night before it’s to be gobbled up by Galactus!", "Daredevil (1998) #7": "The showdown between Daredevil and the man behind Karen's death, the appearance of the Messiah baby, and all that has befallen Matt Murdock is here! Two shall fight...one shall live.", "Earth X (1999) #2": "Learn the final fate of the Fantastic Four in their final battle against Doctor Doom and Namor!", "Wolverine (1988) #134": "WOLVERINE VS. THE MARVEL UNIVERSE! Featuring too many guest stars to name!\n", "Avengers (1998) #11": "Wanda has been captured by the Unliving Legion! Meanwhile, the Grim Reaper casts a magic force wall around Central Park and the Avengers. Can Wanda free herself in time to aid her teammates?", "Captain America: Sentinel of Liberty (1998) #4": "With the Human Torch back to his right self, he, Cap and Namor battle the Firebrand Squadron in Atlantis.", "Avengers (1998) #10": "Wanda delves into her past to learn how to fully resurrect Wonder Man. Meanwhile, at the Avengers Parade, the proceedings are interrupted by the Grim Reaper and the Legion of the Unliving.", "Captain America: Sentinel of Liberty (1998) #3": "Cap escapes his imprisonment in Atlantis and discovers dozens of Prisoners of War being used in Nazi experiments!", "Captain America: Sentinel of Liberty (1998) #2": "In a flashback to 1942, things seem rather fishy when the Atlanteans and the Human Torch form alliances with the Nazis!", "Marvel Universe (1998) #3": "The Invaders…reassembled! Marvel’s World War II-age heroes reunite to dissemble both the Axis…and Hydra!", "Marvel Universe (1998) #2": "The rise of Baron Wolfgang von Strucker! Due to an act of time travel, the mad Nazi travels back to the age of World War II equipped with precious intel from the modern age that will guarantee a win by the Third Reich. But then the Invaders swoop in…", "Marvel Universe (1998) #1": "Journey back to Marvel’s Golden Age with this special adventure starring Namor, Captain America, and Jim Hammond, the first Human Torch! Hydra and their goons don’t stand a chance!", "X-Men (1991) #71": "At the Xavier Institute, the X-Men begin a relatively quiet day!", "Fantastic Four (1996) #12": "It's The Fantastic Four versus Terrax, Firelord, and Plasma! And if that wasn't enough, Doctor Doom is waiting in the wings!\n", "Fantastic Four (1996) #11": "During a quiet afternoon in Central Park, The Fantastic Four are attacked by none other than Terrax! Plus, a new member is added to Marvel's Finest Family.\n", "Fantastic Four (1996) #10": "Though Galactus has eaten, he still hungers. Next stop: Earth! Plus, The Fantastic Four and The Inhumans versus Maximus!\n", "Fantastic Four (1996) #9": "The Fantastic Four are the prisoners of The Inhumans! And Galactus' herald makes their way towards Earth!\n", "Fantastic Four (1996) #8": "Get ready for the HEROES REBORN debut of The Inhumans!\n", "Code of Honor (1997) #4": "Inferno plummets the entire city into madness. Piper makes amends with his wife.", "Fantastic Four (1996) #7": "Ben Grimm may be recuperating in the hospital, but The Fantastic Four are still on the job! Next stop: The Negative Zone! Featuring The X-Men!\n", "Fantastic Four (1996) #6": "While Alicia Masters waits for Ben Grimm to show up for their date, The Fantastic Four battles The Super-Skrull! Featuring, The Silver Sufer!", "Fantastic Four (1996) #5": "Doctor Doom has captured Ben, Sue, and Black Panther! Can Ben and Johnny rescue their teammates? And just who is Wyatt Wingfoot?\n", "Fantastic Four (1996) #4": "During a scientific mission in Wakanda, an entire group of scientists is wiped out by an unknown force. The Fantastic Four set out to investigate.\n", "Fantastic Four (1996) #3": "To stop Giganto's rampage in New York City, The Fantastic Four joins forces with The Avengers!\n", "Uncanny X-Men (1963) #335": "Apocalypse awakens and consults the Watcher. And Onslaught gathers his minions!", "Strange Tales (1994) #1": "A special one-shot featuring Thing, Doctor Strange, Human Torch and more!\n", "Marvels (1994)": "Phineas Thomas Horton is a brilliant inventor on the  brink of great discovery! Like a modern day Prometheus, Horton, unlocking the secrets of creation, hands the world a Human Torch! This is the beginning of Marvels!", "Marvels (1994) #1": "Phineas Horton was like a modern day Prometheus, stealing fire from heavens and handing a human torch down to man.  Writer, Kurt Busiek, and Artist, Alex Ross, tells the origin of The Human Torch in stunning detail.  Don't miss out on this Epic storytelling event in Book I of Marvels!", "Incredible Hulk Annual (1976) #20": "The Abomination tells a depressed woman the fairytale version of his life, as well as his unusual origin.", "Cage (1992) #20": "The Thing and Human Torch assist Cage in freeing himself of the Bogeyman!", "Fantastic Four (1961) #379": "Ms. Marvel uncontrollably mutates into an even more grotesque version of She-Thing!", "Doctor Strange, Sorcerer Supreme (1988) #37": "The Silver Surfer swoops in viciously to blindside Doctor Strange! The question is…WHY?\n", "Marvel Comics Presents (1988) #83": "Note: this issue contains only the Weapon X story by Barry Windsor-Smith.", "Doctor Strange, Sorcerer Supreme (1988) #32": "Silver Dagger comes for what is rightfully his…something in the possession of none other than Doctor Strange!\n", "X-Factor (1986) #66": "Nathan Summers is kidnapped by a mysterious woman during a battle.", "Fantastic Four (1961) #349": "A Skrull stands revealed underneath Monster Island! But what has roped the new Fantastic Four and the entire Skrull army into a confrontation within the Mole Man's secret lair?", "Fantastic Four (1961) #348": "The new Fantastic Four's investigation has taken them all the way to Monster Island, home of the dreaded Mole Man.  Will they find out the truth about the slain FF...or another set of secrets entirely?", "Fantastic Four (1961) #347": "The Fantastic Four are dead!  Long live the new Fantastic Four - Spider-Man, Wolverine, Hulk, and Ghost Rider!? Can they get to the bottom of the FF's demise? And just what do the Skrulls want with this new team?", "West Coast Avengers (1985) #65": "The Grim Reaper awakens, now in ZOMBIE form!", "West Coast Avengers (1985) #63": "New Yorker Human Torch may have to transition to the west coast lifestyle! Will he accept his invitation to join the West Coast Avengers?!", "X-Factor Annual (1986) #4": "Two FBI agents arrive in New York to discover what really happened during INFERNO. After X-Factor undergoes a round of questioning the team enlists the help of Reed Richards to help with their cover story.", "Secret Wars (1984) #12": "NOTHING TO FEAR The heroes have defeated their enemies--all save one. Now, with the stolen power of The Beyonder himself, Doctor Doom strikes! Who can stop him now?", "Secret Wars (1984) #11": "...AND DUST TO DUST The penultimate chapter of SECRET WARS is here! The face of Doom is revealed!", "Thor (1966) #353": "Thor and Odin have been defeated! Now Surtur is free to enact his devious plan. But is there no one left to stand against him? What of Loki? Can the God of Mischief put aside his tricks to save his kingdom?", "Secret Wars (1984) #10": "DEATH TO THE BEYONDER Though the heroes have successfully driven Galactus away, they find that their seeming victory has only sealed their fate.", "Thor (1966) #352": "Surtur versus Odin for the fate of Asgard! With the help of Mr. Fantastic and The Human Torch, can the Asgardians win the day? Or will the Shining City be enshrouded in endless winter?", "Thor (1966) #351": "The forces of Asgard battle Surtur and his minions! But if Surtur can best the Asgardian continent who will stand to oppose him in Asgard itself? Will it be Thor? Odin?", "Secret Wars (1984) #9": "ASSAULT ON GALACTUS As the heroes make their last ditch effort against Galactus, Doctor Doom seizes the opportunity to grind them all under his heel.", "Secret Wars (1984) #8": "INVASION As the battle-weary heroes recuperate and repair their gear, Spider-Man makes make a discovery that will change his life and his costume!", "Secret Wars (1984) #7": "BERSERKER The death of an Avenger! The X-Men's greatest battle! And, introducing the all-new Spider-Woman!", "Marvel Team-Up (1972) #147": "The Human Torch against the menace of the Black Abbott and the Black Apostles! What they can do to your body and soul is unspeakable!", "Secret Wars (1984) #6": "A LITTLE DEATH Galactus prepares to destroy both the heroes and the villians! Now, as both sides of the engagement plan their next move, two MIA soldiers make their return!", "Secret Wars (1984) #5": "THE BATTLE OF THE FOUR ARMIES The villains have the upper hand! As they plan their final strike, Galactus' mysterious vigil comes to a surprising end...", "Secret Wars (1984) #4": "SITUATION: HOPELESS The heroes' HQ has been destroyed! Thor has been captured by Enchantress and taken straight to the villains! Doctor Doom scores his first kill!", "Secret Wars (1984) #3": "TEMPEST WITHOUT, CRISIS WITHIN Doctor Doom creates two new villains Called Volcana and Titania to take the heroes down! Meanwhile, Spider-Man battles the X-Men!", "Secret Wars (1984) #2": "PRISONERS OF WAR Doctor Doom brings Ultron back online to battle the champions of Earth! Meanwhile, Magneto takes the lone-wolf route!", "Secret Wars (1984) #1": "THE WAR BEGINS Earth's heroes have been whisked away to a mysterious construct in space, but they are not alone. Earth's villains have also appeared. Who is to blame for this meeting of good and evil?", "Uncanny X-Men (1963) #167": "The New Mutants, The Starjammers, and the X-Men must band together to save a Brood-infected Professor X once the Brood begins to take hold? Can their mentor be saved or will he die by their hands?", "Amazing Spider-Man Annual (1964) #17": "It’s Peter’s Fifth High School Reunion, and some past problems threaten to bubble to the surface! Plus, Spidey’s case against Kingpin hits a snag when key evidence incriminating Fisk is destroyed!\n", "X-Men Annual (1970) #5": "The X-Men versus the hordes of the Badoon! When a galactic threat looms over the merry mutants, the team calls in the aid of experts- the Fantastic Four! Meanwhile, Storm can’t shake her feelings for Arkon, and her need to end the battles in his home world. Can the X-Men and the Fantastic Four usher in an age of peace between two warring alien races?", "Marvel Team-Up (1972) #83": "Spider-Man is joined by Nick Fury of S.H.I.E.L.D. to take down Silver Samurai and Boomerang! Black Widow guest-stars.", "Marvel Two-in-One (1974) #46": "It’s a battle of brawn between the Ever-Lovin' Blue-Eyed Thing and the Incredible Hulk! Which of these beloved heroes will come out on top in this fierce battle?\n", "Defenders (1972) #62": "The proverbial pot is stirred after a documentary is aired about the Defenders, inviting all heroes to come join the team. Will this unwanted TV time cause tension for the Defenders' current members?", "Marvel Two-in-One (1974) #27": "Mentallo and Fixer pull Deathlok from the future for their own nefarious deeds. Nick Fury and the Thing attempt to save Deathlok, but are soon sideswiped by Mentallo’s psychic powers. But why does Deathlok end up in chains, prisoner of the Fantastic Four?", "Peter Parker, the Spectacular Spider-Man (1976) #6": "Spidey recalls the time he teamed up with the Human Torch to defeat Morbius, the Living Vampire. Good thing Morbius' demise is set in stone…\n", "Captain Marvel (1968) #47": "THE SENTRY STRIKES! Mar-Vell clashes with one of the greatest terrors from his Kree homeworld! Can even the Human Torch help Mar-Vell survive this battle?", "Super-Villain Team-Up (1975) #7": "Henry Kissinger orders a ceasefire with Latveria, forcing the Fantastic Four back to American soil. Meanwhile, Namor senses an unusual presence; Enter Shroud, Marvel’s most mysterious mercenary! But why has Shroud agreed to take down Doom at the behest of Namor?", "Super-Villain Team-Up (1975) #6": "Absconded away to Latveria, Namor must remain a loyal servant to Doom, or meet his death. Will the Fantastic Four intervene in Doom’s latest attempt at world domination? You bet!", "Super-Villain Team-Up (1975) #5": "Namor in custody of the Fantastic Four! After Doom pulls the wool over his eyes, (and the air from his lungs), Namor recounts his failed alliance to the FF. Namor plots his revenge against the Latverian overlord, but his failing health puts him in grave danger! Will Doom relinquish the cure for Namor?", "Marvel Team-Up (1972) #39": "One classic team-up! Spider-Man lends a hand to the FF’s Human Torch when mob bosses capture Johnny Storm.", "Invaders (1975) #2": "Captain America and the Invaders take on Donar, the God of Storms.  Plus, who is the mysterious Hilda?  And is she friend or foe?", "Super-Villain Team-Up (1975) #1": "Will Doctor Doom and Sub-Mariner continue to be partners in crime? Their recent heists have fizzled in failure, and the two baddies have an ugly falling out. But will their alliance be renewed when Sub-Mariner falls into trouble and requires Doom's aid?", "Invaders (1975) #1": "America's greatest heroes of World War II led by Captain American himself!  The Invaders, including Sub-Mariner, Bucky and the Human Torch, take the fight to the front lines in this action-packed first issue!", "Marvel Team-Up (1972) #35": "Where are Spider-Man and Valkyrie? Doctor Strange and Human Torch are on the case, but find themselves entrenched in a mystery surrounding the “Innocents of God”. Who are the members of this odd, cultish collective? And what do they want with Valkyrie?", "Marvel Team-Up (1972) #32": "The Human Torch needs help, and only the Son of Satan can give it! Wyatt Wingfoot has been possessed by a shadowy force, so Johnny Storm seeks out the best exorcist in the world - Daimon Hellstrom!", "Marvel Team-Up (1972) #29": "Iron Man needs help and summons the Fantastic Four -- but for some reason, only the Torch bothers to show up!", "Marvel Team-Up (1972) #26": "The Human Torch must fight fire with fire when a lava man named Molto attacks him.", "Marvel Team-Up (1972) #23": "Iceman butts heads with the Human Torch when someone sets him up to take the fall for a jewelry store robbery.", "Marvel Team-Up (1972) #10": "The TOMORROW WAR rages on! With Iron Man trapped in the future, Spidey needs to find reinforcements, and who better to answer the call than the HUMAN TORCH! Best hero buddies, together again!", "Marvel Team-Up (1972) #3": "Spidey and the Torch are back at it again! But can they contend with the terrible power of MORBIUS, the Living Vampire?", "Marvel Team-Up (1972) #2": "The Amazing Spider-Man and the Human Torch in another team-up for the ages! This time, they're up against the menace of the FRIGHTFUL FOUR!", "Sub-Mariner (1968) #45": "Namor and the Human Torch team up -- or do they? -- to face the vengeful Llyra and the man called Tiger Shark!", "Uncanny X-Men (1963) #67": "Reprint of Uncanny X-Men (1963) #12", "Avengers (1963) #71": "Spotlight on Hank Pym and Wasp!  Can they put their checkered past behind them in time to fend off the deadly Whirlwind?", "Fantastic Four (1961) #48": "\"The Coming of Galactus\" begins here! As the Fantastic Four struggle to understand what the Silver Surfer's appearance means, they must steel themselves for what's ahead--Galactus, the devourer of worlds!", "Uncanny X-Men (1963) #13": "Nothing can stop the Juggernaut, but the X-Men will go down trying! Guest-starring the Human Torch!", "The Amazing Spider-Man (1963) #21": "It's Spider-Man and the Human Torch vesus the Beetle!", "The Amazing Spider-Man (1963) #19": "Spidey teams up with the Human Torch and sets the stage for one of the most enduring friendships in the Marvel Universe!", "The Amazing Spider-Man (1963) #17": "Flash Thompson invites everyone to attend the first meeting of the Spider-Man fan-club, except Peter Parker! Plus, the Return of the Green Goblin!", "Fantastic Four (1961) #30": "Witness the debut of the adept alchemist Diablo. Is this mysterious new superhuman friend or foe? And can he succeed in curing the Thing where Reed failed?\n", "Fantastic Four (1961) #29": "The Fantastic Four enter into a rematch against the Red Ghost and his Super-Apes! Guest-starring the Watcher!\n", "Fantastic Four (1961) #28": "The X-Men guest-star as they and the Fantastic Four face the combined menace of the Puppet Master, Mad Thinker, and the Awesome Android!\n", "Fantastic Four (1961) #27": "The Invisible Girl is kidnapped by Namor the Sub-Mariner, Prince of Atlantis! The remaining members of the Fantastic Four enlist the aid of Doctor Strange to expedite their rescues efforts!\n", "Fantastic Four (1961) #26": "The Hulk continues his rampage through New York City, but the Avengers have arrived to challenge their former member. Can the FF and Earth's Mightiest Heroes work together to stop the Jade Giant?", "Fantastic Four (1961) #25": "The battle you've been waiting for! The Incredible Hulk vs. the Ever Lovin' Blue-Eyed Thing! Nuff said!\n", "Fantastic Four (1961) #24": "A strange extra-terrestrial being is wreaking havoc on Earth! The FF must deal with a threat the likes of which they've never faced before: the Infant Terrible!\n", "Fantastic Four (1961) #23": "The diabolical Dr. Doom gathers a new super-villain group, the Terrible Trio! Can the Fantastic Four defeat their greatest nemesis when he's backed by his own team?\n", "Fantastic Four (1961) #22": "The Fantastic Four's first foe returns with a vengeance! The mighty Mole Man's plan is to sink the world's largest cities down to his level, and he already has a plan to deal with the FF!\n", "Fantastic Four (1961) #21": "The enigmatic Hate-Monger uses his hate ray to break up the Fantastic Four! Can Marvel's First Family overcome this mysterious enemy's strange ability? Guest-starring Nick Fury!\n", "The Amazing Spider-Man (1963) #3": "Witness the birth of one of Spider-Man's greatest enemies, the grotesque Dr. Octopus!", "Fantastic Four (1961) #15": "The Fantastic Four battle the Mad Thinker and his awesome Android! The Android...neither animal, nor vegetable, nor mineral...what is it?!", "Fantastic Four (1961) #14": "The Puppet Master has gained control over the Sub-Mariner and hatches a plan to finally ensnare and defeat the Fantastic Four.", "Fantastic Four (1961) #13": "More than two hundred thousand miles from Earth, the Fantastic Four face the menace of The Red Ghost!", "Fantastic Four (1961) #12": "General Ross tasks the Fantastic Four with finding and capturing the Hulk. But treachery is afoot and the Hulk sets out to find the real villain of the day...the Wrecker!", "Fantastic Four (1961) #11": "At last the Fantastic Four meet a foe whose power is even greater than theirs! Here is: The Impossible Man!", "Fantastic Four (1961) #10": "Dr. Doom impersonates Reed Richards so that he may use Richards' shrink ray to finally defeat the Fantastic Four!", "Fantastic Four (1961) #9": "When the Fantastic Four go bankrupt, they're invited to S.M. Studios to make the movie about their life in order to recoup their funding. Little do they know that S.M. Studios is owned by one of their greatest enemies!", "Fantastic Four (1961) #7": "The Fantastic Four journey across the cosmos to Planet X. This planet on the edges of spaces needs our heroes help to save it from utter destruction.", "Fantastic Four (1961) #1": "The Fantastic Four spring to action as a team for the first time. As they learn how to control their new found powers, will it be enough to stop the fury of the Mole Man?", "Men's Adventures (1950) #27": "A classic adventure starring the Original Human Torch!", "Captain America Comics (1941) #19": "Steve and Bucky find themselves in a forest swamp near a plantation mansion where a violent crocodile attacks.", "Human Torch Comics (1940) #8": "The Human Torch becomes even more powerful! The only downside? He is fully under the control of villains!", "Human Torch Comics (1940) #7": "Toro and The Torch take to the seas! Whom will they find lurking beneath the ocean's murky depths?", "Marvel Mystery Comics (1939) #28": "The Torch and Toro stop a murder spree! The Sub-Mariner battles a ghost ship! And the Vision clashes with a soul-stealing scientist!", "Marvel Mystery Comics (1939) #27": "The adventures of Marvel's first generation of heroes continue! Torch and Toro, Namor, the Angel and more pave the way to the Marvel Age of Comics!", "Human Torch Comics (1940) #6": "Torch goes undercover as a criminal to seek the origin of recent illegal arms trafficking.", "Marvel Mystery Comics (1939) #26": "Even more amazing tales from the early days of Marvel! Starring the Human Torch, Namor the Sub-Mariner, and the Golden Age Vision!", "Marvel Mystery Comics (1939) #25": "A collection of Marvel's Golden Age greats! Human Torch, Sub-Mariner, the original Ka-Zar and Vision, and more!", "Marvel Mystery Comics (1939) #24": "More incredible tales of action and mystery from the Golden Age of Marvel featuring the Human Torch & Toro, the Sub-Mariner, and many more!", "Marvel Mystery Comics (1939) #23": "More incredible tales of action and mystery from the Golden Age of Marvel featuring the Human Torch & Toro, the Sub-Mariner, and many more!", "Marvel Mystery Comics (1939) #22": "More incredible tales of action and mystery from the Golden Age of Marvel featuring the Human Torch & Toro, the Sub-Mariner, and many more!", "Marvel Mystery Comics (1939) #21": "More incredible tales of action and mystery from the Golden Age of Marvel featuring the Human Torch & Toro, the Sub-Mariner, and many more!", "Marvel Mystery Comics (1939) #20": "If the Golden Age heroes don’t pay up, New York City may go up in a smoke by an arsonist’s plot! Even Torch gets scorched by this one!\n", "Marvel Mystery Comics (1939) #19": "It’s Lights Out for New York City! The Human Torch and Toro realize that a temporary blackout may spell disaster for the New York Stock Exchange!", "Human Torch Comics (1940) #4": "The Human Torch cleverly uses Toro as bait, but will setting that same bait come back to bite him?", "Marvel Mystery Comics (1939) #18": "A collection of Marvel's Golden Age greats! Human Torch, Sub-Mariner, the original Ka-Zar and Vision, plus many more!", "Marvel Mystery Comics (1939) #17": "Get ready for a battle epic straight from the Golden Age of Marvel! The Human Torch and Sub-Mariner fight side-by-side once more, against the menace of the European Axis Powers!", "Human Torch Comics (1940) #3": "It's a miracle! Toro's parents are alive! That is, if they're real…\n", "Human Torch Comics (1940) #2": "Torch finds a boy who has powers similar to his own! Meet Toro, the Flaming Torch Kid!"}